/*
 Navicat Premium Data Transfer

 Source Server         : DataWarehouse
 Source Server Type    : MySQL
 Source Server Version : 80036 (8.0.36)
 Source Host           : localhost:3306
 Source Schema         : staging

 Target Server Type    : MySQL
 Target Server Version : 80036 (8.0.36)
 File Encoding         : 65001

 Date: 05/12/2024 18:49:08
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for staging
-- ----------------------------
DROP TABLE IF EXISTS `staging`;
CREATE TABLE `staging`  (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '',
  `datetime` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '',
  `temp` decimal(10, 2) NULL DEFAULT 0.00,
  `feelslike` decimal(10, 2) NULL DEFAULT 0.00,
  `dew` decimal(10, 2) NULL DEFAULT 0.00,
  `humidity` decimal(10, 2) NULL DEFAULT 0.00,
  `precip` float(10, 2) NULL DEFAULT 0.00,
  `precipprob` decimal(10, 2) NULL DEFAULT 0.00,
  `preciptype` varchar(65) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '',
  `snow` decimal(10, 2) NULL DEFAULT 0.00,
  `snowdepth` decimal(10, 2) NULL DEFAULT 0.00,
  `windgust` decimal(10, 2) NULL DEFAULT 0.00,
  `windspeed` decimal(10, 2) NULL DEFAULT 0.00,
  `winddir` decimal(10, 2) NULL DEFAULT 0.00,
  `pressure` float NULL DEFAULT 0,
  `cloudcover` float NULL DEFAULT 0,
  `visibility` float NULL DEFAULT 0,
  `solarradiation` float NULL DEFAULT 0,
  `solarenergy` float NULL DEFAULT 0,
  `uvindex` int NULL DEFAULT 0,
  `severerisk` int NULL DEFAULT 0,
  `conditions` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '',
  `icon` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '',
  `stations` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '',
  `LOCATION_ID` int NULL DEFAULT -1,
  `province_id` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '',
  `date_id` bigint NULL DEFAULT -1,
  `time_id` int NULL DEFAULT NULL,
  `stations_id` int NULL DEFAULT 0,
  `preciptype_id` int NULL DEFAULT 0,
  `conditions_id` int NULL DEFAULT 0,
  `winddir_id` int NULL DEFAULT 0,
  `icon_id` int NULL DEFAULT 0,
  `pressure_id` int NULL DEFAULT 0,
  `humidity_id` int NULL DEFAULT 0,
  `windspeed_id` int NULL DEFAULT 0,
  `uvindex_id` int NULL DEFAULT 0,
  `cloudcover_id` int NULL DEFAULT 0,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 2048 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of staging
-- ----------------------------
INSERT INTO `staging` VALUES (1, 'An Giang, Việt Nam', '2024-12-06T00:00:00', 26.60, 26.60, 23.50, 83.12, 0.60, 80.60, '[rain]', 0.00, 0.00, 5.80, 4.70, 219.80, 1009, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 1, 'VN1', 7280, 1, 1, 1, 1, 8, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (2, 'An Giang, Việt Nam', '2024-12-06T01:00:00', 26.30, 26.30, 23.60, 85.12, 0.00, 80.60, '[rain]', 0.00, 0.00, 6.80, 5.80, 209.90, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 1, 'VN1', 7280, 2, 1, 1, 1, 8, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (3, 'An Giang, Việt Nam', '2024-12-06T02:00:00', 26.00, 26.00, 23.60, 86.64, 0.10, 16.10, '[rain]', 0.00, 0.00, 6.80, 5.80, 213.30, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 1, 'VN1', 7280, 3, 1, 1, 2, 8, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (4, 'An Giang, Việt Nam', '2024-12-06T03:00:00', 25.80, 25.80, 23.50, 87.15, 0.00, 16.10, 'None', 0.00, 0.00, 6.10, 5.00, 223.90, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 1, 'VN1', 7280, 4, 1, 2, 2, 8, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (5, 'An Giang, Việt Nam', '2024-12-06T04:00:00', 25.50, 25.50, 23.40, 88.18, 0.00, 16.10, 'None', 0.00, 0.00, 4.00, 3.60, 202.30, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 1, 'VN1', 7280, 5, 1, 2, 2, 8, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (6, 'An Giang, Việt Nam', '2024-12-06T05:00:00', 25.60, 25.60, 23.40, 87.66, 0.00, 16.10, 'None', 0.00, 0.00, 2.90, 2.90, 230.80, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 1, 'VN1', 7280, 6, 1, 2, 2, 6, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (7, 'An Giang, Việt Nam', '2024-12-06T06:00:00', 25.50, 25.50, 23.30, 87.65, 0.00, 16.10, 'None', 0.00, 0.00, 4.30, 4.30, 272.50, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 1, 'VN1', 7280, 7, 1, 2, 2, 7, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (8, 'An Giang, Việt Nam', '2024-12-06T07:00:00', 25.90, 25.90, 23.40, 86.11, 0.00, 16.10, 'None', 0.00, 0.00, 6.50, 4.30, 273.30, 1009, 100, 24.1, 30, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 1, 'VN1', 7280, 8, 1, 2, 2, 7, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (9, 'An Giang, Việt Nam', '2024-12-06T08:00:00', 26.80, 29.20, 23.10, 80.19, 0.00, 64.50, '[rain]', 0.00, 0.00, 10.10, 7.60, 312.40, 1009, 100, 24.1, 136, 0.5, 1, 10, 'Rain, Overcast', 'rain', 'None', 1, 'VN1', 7280, 9, 1, 1, 1, 7, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (10, 'An Giang, Việt Nam', '2024-12-06T09:00:00', 27.90, 30.90, 22.80, 73.83, 0.00, 64.50, '[rain]', 0.00, 0.00, 9.00, 7.90, 333.60, 1010, 100, 24.1, 355, 1.3, 4, 10, 'Rain, Overcast', 'rain', 'None', 1, 'VN1', 7280, 10, 1, 1, 1, 4, 1, 1, 1, 1, 2, 1);
INSERT INTO `staging` VALUES (11, 'An Giang, Việt Nam', '2024-12-06T10:00:00', 28.80, 32.10, 22.70, 69.64, 0.00, 64.50, '[rain]', 0.00, 0.00, 8.60, 8.30, 353.60, 1010, 100, 24.1, 466, 1.7, 5, 10, 'Rain, Overcast', 'rain', 'None', 1, 'VN1', 7280, 11, 1, 1, 1, 4, 1, 1, 2, 1, 2, 1);
INSERT INTO `staging` VALUES (12, 'An Giang, Việt Nam', '2024-12-06T11:00:00', 29.60, 33.20, 22.70, 66.49, 0.10, 64.50, '[rain]', 0.00, 0.00, 7.20, 8.30, 7.60, 1009, 100, 24.1, 559, 2, 6, 10, 'Rain, Overcast', 'rain', 'None', 1, 'VN1', 7280, 12, 1, 1, 1, 5, 1, 1, 2, 1, 3, 1);
INSERT INTO `staging` VALUES (13, 'An Giang, Việt Nam', '2024-12-06T12:00:00', 30.30, 34.30, 22.80, 64.26, 0.30, 64.50, '[rain]', 0.00, 0.00, 8.30, 8.60, 16.60, 1008, 100, 24.1, 632, 2.3, 6, 10, 'Rain, Overcast', 'rain', 'None', 1, 'VN1', 7280, 13, 1, 1, 1, 5, 1, 1, 2, 1, 3, 1);
INSERT INTO `staging` VALUES (14, 'An Giang, Việt Nam', '2024-12-06T13:00:00', 31.00, 35.00, 22.60, 60.99, 0.20, 64.50, '[rain]', 0.00, 0.00, 10.80, 8.60, 41.70, 1007, 100, 24.1, 672, 2.4, 7, 10, 'Rain, Overcast', 'rain', 'None', 1, 'VN1', 7280, 14, 1, 1, 1, 5, 1, 1, 2, 1, 3, 1);
INSERT INTO `staging` VALUES (15, 'An Giang, Việt Nam', '2024-12-06T14:00:00', 31.40, 35.30, 22.40, 58.89, 0.30, 83.90, '[rain]', 0.00, 0.00, 12.20, 9.00, 67.60, 1006, 97.6, 13.5, 642, 2.3, 6, 10, 'Rain, Overcast', 'rain', 'None', 1, 'VN1', 7280, 15, 1, 1, 1, 3, 1, 1, 2, 1, 3, 1);
INSERT INTO `staging` VALUES (16, 'An Giang, Việt Nam', '2024-12-06T15:00:00', 31.40, 35.30, 22.40, 58.89, 0.20, 83.90, '[rain]', 0.00, 0.00, 14.00, 10.80, 85.30, 1005, 88.2, 24.1, 525, 1.9, 5, 10, 'Rain, Partially cloudy', 'rain', 'None', 1, 'VN1', 7280, 16, 1, 1, 3, 3, 1, 1, 2, 1, 2, 1);
INSERT INTO `staging` VALUES (17, 'An Giang, Việt Nam', '2024-12-06T16:00:00', 30.70, 34.70, 22.70, 62.42, 0.60, 83.90, '[rain]', 0.00, 0.00, 12.60, 11.20, 97.50, 1006, 15.2, 9.6, 385, 1.4, 4, 10, 'Rain', 'rain', 'None', 1, 'VN1', 7280, 17, 1, 1, 4, 2, 1, 1, 2, 2, 2, 5);
INSERT INTO `staging` VALUES (18, 'An Giang, Việt Nam', '2024-12-06T17:00:00', 29.20, 33.60, 23.80, 72.72, 0.70, 83.90, '[rain]', 0.00, 0.00, 11.90, 7.90, 100.20, 1006, 23.9, 11.6, 174, 0.6, 2, 30, 'Rain, Partially cloudy', 'rain', 'None', 1, 'VN1', 7280, 18, 1, 1, 3, 2, 1, 1, 1, 1, 1, 4);
INSERT INTO `staging` VALUES (19, 'An Giang, Việt Nam', '2024-12-06T18:00:00', 26.50, 26.50, 23.40, 83.11, 1.70, 83.90, '[rain]', 0.00, 0.00, 9.70, 8.60, 125.90, 1007, 31.7, 5, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 1, 'VN1', 7280, 19, 1, 1, 3, 2, 1, 1, 1, 1, 1, 4);
INSERT INTO `staging` VALUES (20, 'An Giang, Việt Nam', '2024-12-06T19:00:00', 26.00, 26.00, 23.60, 86.64, 1.50, 83.90, '[rain]', 0.00, 0.00, 9.70, 8.30, 146.60, 1008, 93, 21.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 1, 'VN1', 7280, 20, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (21, 'An Giang, Việt Nam', '2024-12-06T20:00:00', 26.40, 26.40, 23.80, 85.64, 0.20, 41.90, '[rain]', 0.00, 0.00, 13.30, 9.00, 150.00, 1009, 95.7, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 1, 'VN1', 7280, 21, 1, 1, 2, 1, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (22, 'An Giang, Việt Nam', '2024-12-06T21:00:00', 26.20, 26.20, 23.80, 86.66, 0.00, 41.90, 'None', 0.00, 0.00, 15.10, 9.00, 130.20, 1009, 43.2, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 1, 'VN1', 7280, 22, 1, 2, 6, 2, 4, 1, 1, 1, 1, 3);
INSERT INTO `staging` VALUES (23, 'An Giang, Việt Nam', '2024-12-06T22:00:00', 25.70, 25.70, 23.60, 88.20, 0.00, 41.90, 'None', 0.00, 0.00, 17.30, 9.70, 130.80, 1009, 48.1, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 1, 'VN1', 7280, 23, 1, 2, 6, 2, 4, 1, 1, 1, 1, 3);
INSERT INTO `staging` VALUES (24, 'An Giang, Việt Nam', '2024-12-06T23:00:00', 25.30, 25.30, 23.40, 89.24, 0.00, 41.90, 'None', 0.00, 0.00, 14.80, 8.30, 134.70, 1009, 98.6, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 1, 'VN1', 7280, 24, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (25, 'Bà Rịa, Việt Nam', '2024-12-06T00:00:00', 24.70, 24.70, 22.40, 87.05, 0.00, 45.20, '[rain]', 0.00, 0.00, 9.00, 5.80, 62.40, 1008, 100, 24.1, 0, 0, 0, 3, 'Rain, Overcast', 'rain', 'None', 2, 'VN25', 7280, 1, 1, 1, 1, 3, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (26, 'Bà Rịa, Việt Nam', '2024-12-06T01:00:00', 24.60, 24.60, 22.50, 88.11, 0.00, 45.20, '[rain]', 0.00, 0.00, 9.70, 6.50, 67.70, 1008, 100, 24.1, 0, 0, 0, 3, 'Rain, Overcast', 'rain', 'None', 2, 'VN25', 7280, 2, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (27, 'Bà Rịa, Việt Nam', '2024-12-06T02:00:00', 24.40, 24.40, 22.50, 89.17, 0.00, 0.00, 'None', 0.00, 0.00, 9.00, 6.10, 50.70, 1007, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 2, 'VN25', 7280, 3, 1, 2, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (28, 'Bà Rịa, Việt Nam', '2024-12-06T03:00:00', 24.30, 24.30, 22.60, 90.25, 0.00, 0.00, 'None', 0.00, 0.00, 6.10, 5.00, 47.20, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 2, 'VN25', 7280, 4, 1, 2, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (29, 'Bà Rịa, Việt Nam', '2024-12-06T04:00:00', 24.20, 24.20, 22.60, 90.79, 0.00, 0.00, 'None', 0.00, 0.00, 5.00, 4.70, 49.90, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 2, 'VN25', 7280, 5, 1, 2, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (30, 'Bà Rịa, Việt Nam', '2024-12-06T05:00:00', 24.10, 24.10, 22.60, 91.34, 0.00, 0.00, 'None', 0.00, 0.00, 4.70, 4.70, 41.70, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 2, 'VN25', 7280, 6, 1, 2, 2, 5, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (31, 'Bà Rịa, Việt Nam', '2024-12-06T06:00:00', 24.00, 24.00, 22.60, 91.89, 0.00, 0.00, 'None', 0.00, 0.00, 4.70, 4.30, 44.90, 1008, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 2, 'VN25', 7280, 7, 1, 2, 2, 5, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (32, 'Bà Rịa, Việt Nam', '2024-12-06T07:00:00', 24.90, 24.90, 23.00, 89.21, 0.00, 0.00, 'None', 0.00, 0.00, 4.70, 3.60, 42.20, 1009, 100, 24.1, 46, 0.2, 0, 10, 'Overcast', 'cloudy', 'None', 2, 'VN25', 7280, 8, 1, 2, 2, 5, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (33, 'Bà Rịa, Việt Nam', '2024-12-06T08:00:00', 26.20, 26.20, 23.20, 83.58, 0.00, 61.30, '[rain]', 0.00, 0.00, 5.00, 4.00, 39.60, 1009, 100, 24.1, 196, 0.7, 2, 10, 'Rain, Overcast', 'rain', 'None', 2, 'VN25', 7280, 9, 1, 1, 1, 5, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (34, 'Bà Rịa, Việt Nam', '2024-12-06T09:00:00', 28.30, 32.00, 23.50, 75.25, 0.00, 61.30, '[rain]', 0.00, 0.00, 6.50, 3.20, 52.60, 1010, 100, 24.1, 489, 1.8, 5, 10, 'Rain, Overcast', 'rain', 'None', 2, 'VN25', 7280, 10, 1, 1, 1, 3, 1, 1, 1, 3, 2, 1);
INSERT INTO `staging` VALUES (35, 'Bà Rịa, Việt Nam', '2024-12-06T10:00:00', 29.70, 33.60, 23.00, 67.32, 0.10, 61.30, '[rain]', 0.00, 0.00, 14.00, 5.00, 92.10, 1010, 100, 10.8, 673, 2.4, 7, 10, 'Rain, Overcast', 'rain', 'None', 2, 'VN25', 7280, 11, 1, 1, 1, 2, 1, 1, 2, 2, 3, 1);
INSERT INTO `staging` VALUES (36, 'Bà Rịa, Việt Nam', '2024-12-06T11:00:00', 30.60, 34.60, 22.70, 62.78, 0.10, 61.30, '[rain]', 0.00, 0.00, 20.20, 11.20, 106.30, 1009, 100, 24.1, 796, 2.9, 8, 10, 'Rain, Overcast', 'rain', 'None', 2, 'VN25', 7280, 12, 1, 1, 1, 2, 1, 1, 2, 2, 4, 1);
INSERT INTO `staging` VALUES (37, 'Bà Rịa, Việt Nam', '2024-12-06T12:00:00', 30.90, 34.90, 22.60, 61.34, 0.20, 61.30, '[rain]', 0.00, 0.00, 19.80, 12.60, 110.20, 1008, 100, 24.1, 782, 2.8, 8, 10, 'Rain, Overcast', 'rain', 'None', 2, 'VN25', 7280, 13, 1, 1, 1, 2, 1, 1, 2, 5, 4, 1);
INSERT INTO `staging` VALUES (38, 'Bà Rịa, Việt Nam', '2024-12-06T13:00:00', 30.70, 34.60, 22.60, 62.04, 0.30, 61.30, '[rain]', 0.00, 0.00, 19.10, 15.10, 112.10, 1007, 99.9, 22.7, 814, 2.9, 8, 10, 'Rain, Overcast', 'rain', 'None', 2, 'VN25', 7280, 14, 1, 1, 1, 2, 1, 1, 2, 5, 4, 1);
INSERT INTO `staging` VALUES (39, 'Bà Rịa, Việt Nam', '2024-12-06T14:00:00', 30.30, 34.20, 22.70, 63.87, 0.10, 64.50, '[rain]', 0.00, 0.00, 17.30, 14.40, 107.00, 1006, 70.2, 23.4, 731, 2.6, 7, 10, 'Rain, Partially cloudy', 'rain', 'None', 2, 'VN25', 7280, 15, 1, 1, 3, 2, 1, 1, 2, 5, 3, 6);
INSERT INTO `staging` VALUES (40, 'Bà Rịa, Việt Nam', '2024-12-06T15:00:00', 29.50, 33.20, 22.80, 67.28, 0.10, 64.50, '[rain]', 0.00, 0.00, 16.60, 15.10, 99.50, 1006, 28.1, 24.1, 586, 2.1, 6, 10, 'Rain, Partially cloudy', 'rain', 'None', 2, 'VN25', 7280, 16, 1, 1, 3, 2, 1, 1, 2, 5, 3, 4);
INSERT INTO `staging` VALUES (41, 'Bà Rịa, Việt Nam', '2024-12-06T16:00:00', 28.50, 31.90, 23.00, 72.16, 0.00, 64.50, '[rain]', 0.00, 0.00, 19.80, 16.90, 93.00, 1006, 15.3, 24.1, 378, 1.4, 4, 10, 'Rain', 'rain', 'None', 2, 'VN25', 7280, 17, 1, 1, 4, 2, 1, 1, 1, 5, 2, 5);
INSERT INTO `staging` VALUES (42, 'Bà Rịa, Việt Nam', '2024-12-06T17:00:00', 26.80, 29.30, 23.40, 81.66, 0.00, 64.50, '[rain]', 0.00, 0.00, 26.60, 14.80, 91.30, 1006, 4.8, 24.1, 156, 0.6, 2, 10, 'Rain', 'rain', 'None', 2, 'VN25', 7280, 18, 1, 1, 4, 2, 1, 1, 1, 5, 1, 5);
INSERT INTO `staging` VALUES (43, 'Bà Rịa, Việt Nam', '2024-12-06T18:00:00', 25.70, 25.70, 23.20, 86.09, 0.10, 64.50, '[rain]', 0.00, 0.00, 25.20, 10.40, 90.80, 1007, 22.1, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 2, 'VN25', 7280, 19, 1, 1, 3, 2, 1, 1, 1, 1, 1, 4);
INSERT INTO `staging` VALUES (44, 'Bà Rịa, Việt Nam', '2024-12-06T19:00:00', 25.50, 25.50, 23.30, 87.65, 0.00, 64.50, '[rain]', 0.00, 0.00, 22.30, 9.00, 92.40, 1008, 86.4, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 2, 'VN25', 7280, 20, 1, 1, 3, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (45, 'Bà Rịa, Việt Nam', '2024-12-06T20:00:00', 25.20, 25.20, 23.30, 89.23, 0.20, 22.60, '[rain]', 0.00, 0.00, 21.20, 8.60, 89.10, 1009, 17.3, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 2, 'VN25', 7280, 21, 1, 1, 5, 3, 3, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (46, 'Bà Rịa, Việt Nam', '2024-12-06T21:00:00', 24.80, 24.80, 23.40, 91.94, 0.80, 22.60, '[rain]', 0.00, 0.00, 15.80, 7.90, 62.30, 1009, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 2, 'VN25', 7280, 22, 1, 1, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (47, 'Bà Rịa, Việt Nam', '2024-12-06T22:00:00', 24.80, 24.80, 23.40, 91.94, 0.40, 22.60, '[rain]', 0.00, 0.00, 12.20, 6.10, 65.00, 1009, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 2, 'VN25', 7280, 23, 1, 1, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (48, 'Bà Rịa, Việt Nam', '2024-12-06T23:00:00', 24.60, 24.60, 23.30, 92.48, 0.10, 22.60, '[rain]', 0.00, 0.00, 10.10, 5.40, 73.00, 1009, 99.6, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 2, 'VN25', 7280, 24, 1, 1, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (49, 'Bạc Liêu, Việt Nam', '2024-12-06T00:00:00', 26.20, 26.20, 23.60, 85.62, 0.30, 25.80, '[rain]', 0.00, 0.00, 50.80, 26.60, 76.20, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 3, 'VN49', 7280, 1, 1, 1, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (50, 'Bạc Liêu, Việt Nam', '2024-12-06T01:00:00', 26.30, 26.30, 23.50, 84.61, 0.20, 25.80, '[rain]', 0.00, 0.00, 51.10, 27.70, 78.70, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 3, 'VN49', 7280, 2, 1, 1, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (51, 'Bạc Liêu, Việt Nam', '2024-12-06T02:00:00', 26.20, 26.20, 23.40, 84.60, 0.20, 6.50, '[rain]', 0.00, 0.00, 51.10, 27.40, 80.20, 1007, 100, 19, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 3, 'VN49', 7280, 3, 1, 1, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (52, 'Bạc Liêu, Việt Nam', '2024-12-06T03:00:00', 26.30, 26.30, 23.40, 84.10, 0.10, 6.50, '[rain]', 0.00, 0.00, 51.80, 28.40, 81.20, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 3, 'VN49', 7280, 4, 1, 1, 2, 3, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (53, 'Bạc Liêu, Việt Nam', '2024-12-06T04:00:00', 26.30, 26.30, 23.40, 84.10, 0.00, 6.50, 'None', 0.00, 0.00, 53.30, 29.50, 80.10, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 3, 'VN49', 7280, 5, 1, 2, 2, 3, 2, 1, 1, 6, 1, 1);
INSERT INTO `staging` VALUES (54, 'Bạc Liêu, Việt Nam', '2024-12-06T05:00:00', 26.30, 26.30, 23.40, 84.10, 0.00, 6.50, 'None', 0.00, 0.00, 54.00, 31.00, 81.40, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 3, 'VN49', 7280, 6, 1, 2, 2, 3, 2, 1, 1, 6, 1, 1);
INSERT INTO `staging` VALUES (55, 'Bạc Liêu, Việt Nam', '2024-12-06T06:00:00', 26.40, 26.40, 23.30, 83.10, 0.00, 6.50, 'None', 0.00, 0.00, 53.60, 31.00, 81.30, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 3, 'VN49', 7280, 7, 1, 2, 2, 3, 2, 1, 1, 6, 1, 1);
INSERT INTO `staging` VALUES (56, 'Bạc Liêu, Việt Nam', '2024-12-06T07:00:00', 26.70, 26.70, 23.60, 83.14, 0.00, 6.50, 'None', 0.00, 0.00, 51.80, 30.60, 79.70, 1008, 96.4, 24.1, 54, 0.2, 1, 10, 'Overcast', 'cloudy', 'None', 3, 'VN49', 7280, 8, 1, 2, 2, 3, 2, 1, 1, 6, 1, 1);
INSERT INTO `staging` VALUES (57, 'Bạc Liêu, Việt Nam', '2024-12-06T08:00:00', 27.50, 30.90, 24.00, 81.25, 0.00, 83.90, '[rain]', 0.00, 0.00, 47.90, 31.00, 77.00, 1009, 36.1, 24.1, 257, 0.9, 3, 30, 'Rain, Partially cloudy', 'rain', 'None', 3, 'VN49', 7280, 9, 1, 1, 3, 3, 1, 1, 1, 6, 2, 4);
INSERT INTO `staging` VALUES (58, 'Bạc Liêu, Việt Nam', '2024-12-06T09:00:00', 28.10, 31.80, 23.70, 77.05, 0.00, 83.90, '[rain]', 0.00, 0.00, 45.40, 33.50, 73.80, 1009, 5, 24.1, 489, 1.8, 5, 10, 'Rain', 'rain', 'None', 3, 'VN49', 7280, 10, 1, 1, 4, 3, 1, 1, 1, 6, 2, 5);
INSERT INTO `staging` VALUES (59, 'Bạc Liêu, Việt Nam', '2024-12-06T10:00:00', 28.60, 32.60, 23.70, 74.84, 0.20, 83.90, '[rain]', 0.00, 0.00, 43.20, 33.80, 72.50, 1009, 20.8, 24.1, 676, 2.4, 7, 10, 'Rain, Partially cloudy', 'rain', 'None', 3, 'VN49', 7280, 11, 1, 1, 3, 3, 1, 1, 1, 6, 3, 2);
INSERT INTO `staging` VALUES (60, 'Bạc Liêu, Việt Nam', '2024-12-06T11:00:00', 28.90, 33.10, 23.70, 73.55, 0.30, 83.90, '[rain]', 0.00, 0.00, 41.40, 33.50, 76.90, 1009, 60.8, 24.1, 784, 2.8, 8, 10, 'Rain, Partially cloudy', 'rain', 'None', 3, 'VN49', 7280, 12, 1, 1, 3, 3, 1, 1, 1, 6, 4, 2);
INSERT INTO `staging` VALUES (61, 'Bạc Liêu, Việt Nam', '2024-12-06T12:00:00', 29.00, 33.30, 23.80, 73.57, 0.20, 83.90, '[rain]', 0.00, 0.00, 40.00, 32.80, 79.10, 1008, 34.2, 24.1, 834, 3, 8, 30, 'Rain, Partially cloudy', 'rain', 'None', 3, 'VN49', 7280, 13, 1, 1, 3, 3, 1, 1, 1, 6, 4, 4);
INSERT INTO `staging` VALUES (62, 'Bạc Liêu, Việt Nam', '2024-12-06T13:00:00', 28.90, 33.20, 23.90, 74.44, 0.30, 83.90, '[rain]', 0.00, 0.00, 38.90, 32.00, 82.00, 1007, 99, 24.1, 818, 2.9, 8, 30, 'Rain, Overcast', 'rain', 'None', 3, 'VN49', 7280, 14, 1, 1, 1, 3, 1, 1, 1, 6, 4, 1);
INSERT INTO `staging` VALUES (63, 'Bạc Liêu, Việt Nam', '2024-12-06T14:00:00', 28.60, 32.70, 23.80, 75.29, 0.10, 87.10, '[rain]', 0.00, 0.00, 38.20, 31.30, 83.90, 1006, 100, 24.1, 709, 2.6, 7, 30, 'Rain, Overcast', 'rain', 'None', 3, 'VN49', 7280, 15, 1, 1, 1, 3, 1, 1, 1, 6, 3, 1);
INSERT INTO `staging` VALUES (64, 'Bạc Liêu, Việt Nam', '2024-12-06T15:00:00', 28.20, 32.00, 23.80, 77.07, 0.20, 87.10, '[rain]', 0.00, 0.00, 37.40, 29.50, 82.40, 1006, 100, 24.1, 515, 1.9, 5, 10, 'Rain, Overcast', 'rain', 'None', 3, 'VN49', 7280, 16, 1, 1, 1, 3, 1, 1, 1, 6, 2, 1);
INSERT INTO `staging` VALUES (65, 'Bạc Liêu, Việt Nam', '2024-12-06T16:00:00', 27.60, 31.10, 24.00, 80.78, 0.30, 87.10, '[rain]', 0.00, 0.00, 37.80, 25.90, 82.30, 1006, 100, 17.8, 312, 1.1, 3, 30, 'Rain, Overcast', 'rain', 'None', 3, 'VN49', 7280, 17, 1, 1, 1, 3, 1, 1, 1, 7, 2, 1);
INSERT INTO `staging` VALUES (66, 'Bạc Liêu, Việt Nam', '2024-12-06T17:00:00', 26.80, 29.50, 23.90, 84.15, 0.60, 87.10, '[rain]', 0.00, 0.00, 40.30, 23.80, 84.30, 1006, 100, 15.7, 136, 0.5, 1, 10, 'Rain, Overcast', 'rain', 'None', 3, 'VN49', 7280, 18, 1, 1, 1, 3, 1, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (67, 'Bạc Liêu, Việt Nam', '2024-12-06T18:00:00', 26.40, 26.40, 23.90, 86.16, 0.00, 87.10, '[rain]', 0.00, 0.00, 40.00, 21.60, 81.60, 1007, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 3, 'VN49', 7280, 19, 1, 1, 1, 3, 1, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (68, 'Bạc Liêu, Việt Nam', '2024-12-06T19:00:00', 26.30, 26.30, 24.00, 87.19, 0.00, 87.10, '[rain]', 0.00, 0.00, 40.70, 20.50, 82.00, 1008, 80.2, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 3, 'VN49', 7280, 20, 1, 1, 3, 3, 1, 1, 1, 7, 1, 2);
INSERT INTO `staging` VALUES (69, 'Bạc Liêu, Việt Nam', '2024-12-06T20:00:00', 26.40, 26.40, 24.00, 86.68, 0.00, 12.90, 'None', 0.00, 0.00, 41.80, 21.20, 81.40, 1008, 72.4, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 3, 'VN49', 7280, 21, 1, 2, 6, 3, 4, 1, 1, 7, 1, 6);
INSERT INTO `staging` VALUES (70, 'Bạc Liêu, Việt Nam', '2024-12-06T21:00:00', 26.40, 26.40, 24.00, 86.68, 0.00, 12.90, 'None', 0.00, 0.00, 42.50, 22.30, 82.60, 1009, 90.6, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 3, 'VN49', 7280, 22, 1, 2, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (71, 'Bạc Liêu, Việt Nam', '2024-12-06T22:00:00', 26.40, 26.40, 24.00, 86.68, 0.00, 12.90, 'None', 0.00, 0.00, 42.50, 22.30, 84.50, 1009, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 3, 'VN49', 7280, 23, 1, 2, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (72, 'Bạc Liêu, Việt Nam', '2024-12-06T23:00:00', 26.30, 26.30, 24.20, 88.25, 0.00, 12.90, 'None', 0.00, 0.00, 41.00, 22.70, 87.20, 1009, 69.6, 24.1, 0, 0, 0, 30, 'Partially cloudy', 'partly-cloudy-night', 'None', 3, 'VN49', 7280, 24, 1, 2, 6, 3, 4, 1, 1, 7, 1, 6);
INSERT INTO `staging` VALUES (73, 'Bắc Giang, Việt Nam', '2024-12-06T00:00:00', 20.50, 20.50, 16.90, 79.84, 0.00, 0.00, 'None', 0.00, 0.00, 10.10, 6.50, 108.80, 1014, 92.1, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 4, 'VN73', 7280, 1, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (74, 'Bắc Giang, Việt Nam', '2024-12-06T01:00:00', 21.00, 21.00, 16.60, 75.95, 0.00, 0.00, 'None', 0.00, 0.00, 10.40, 6.10, 106.90, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 4, 'VN73', 7280, 2, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (75, 'Bắc Giang, Việt Nam', '2024-12-06T02:00:00', 21.10, 21.10, 16.40, 74.54, 0.00, 3.20, 'None', 0.00, 0.00, 5.00, 2.90, 67.50, 1014, 98.9, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 4, 'VN73', 7280, 3, 1, 2, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (76, 'Bắc Giang, Việt Nam', '2024-12-06T03:00:00', 21.10, 21.10, 16.20, 73.59, 0.00, 3.20, 'None', 0.00, 0.00, 5.00, 3.20, 69.00, 1013, 88.4, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 4, 'VN73', 7280, 4, 1, 2, 6, 3, 4, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (77, 'Bắc Giang, Việt Nam', '2024-12-06T04:00:00', 20.90, 20.90, 16.10, 74.03, 0.00, 3.20, 'None', 0.00, 0.00, 4.30, 4.00, 42.50, 1013, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 4, 'VN73', 7280, 5, 1, 2, 2, 5, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (78, 'Bắc Giang, Việt Nam', '2024-12-06T05:00:00', 20.90, 20.90, 16.00, 73.56, 0.00, 3.20, 'None', 0.00, 0.00, 5.00, 4.30, 63.90, 1014, 99.7, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 4, 'VN73', 7280, 6, 1, 2, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (79, 'Bắc Giang, Việt Nam', '2024-12-06T06:00:00', 20.80, 20.80, 15.90, 73.54, 0.00, 3.20, 'None', 0.00, 0.00, 6.50, 5.00, 61.00, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 4, 'VN73', 7280, 7, 1, 2, 2, 3, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (80, 'Bắc Giang, Việt Nam', '2024-12-06T07:00:00', 20.90, 20.90, 16.10, 74.03, 0.00, 3.20, '[rain]', 0.00, 0.00, 11.50, 7.20, 64.10, 1015, 100, 24.1, 2, 0, 0, 10, 'Overcast', 'cloudy', 'None', 4, 'VN73', 7280, 8, 1, 1, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (81, 'Bắc Giang, Việt Nam', '2024-12-06T08:00:00', 20.80, 20.80, 16.50, 76.41, 0.10, 6.50, '[rain]', 0.00, 0.00, 20.20, 9.40, 86.90, 1015, 62.8, 24.1, 9, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 4, 'VN73', 7280, 9, 1, 1, 6, 3, 5, 1, 1, 1, 1, 6);
INSERT INTO `staging` VALUES (82, 'Bắc Giang, Việt Nam', '2024-12-06T09:00:00', 22.80, 22.80, 17.10, 70.24, 0.00, 6.50, 'None', 0.00, 0.00, 14.80, 9.00, 88.30, 1016, 100, 24.1, 215, 0.8, 2, 10, 'Overcast', 'cloudy', 'None', 4, 'VN73', 7280, 10, 1, 2, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (83, 'Bắc Giang, Việt Nam', '2024-12-06T10:00:00', 22.10, 22.10, 17.30, 74.23, 0.00, 6.50, 'None', 0.00, 0.00, 14.00, 9.00, 81.20, 1016, 100, 24.1, 40, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 4, 'VN73', 7280, 11, 1, 2, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (84, 'Bắc Giang, Việt Nam', '2024-12-06T11:00:00', 22.20, 22.20, 17.50, 74.72, 0.00, 6.50, 'None', 0.00, 0.00, 15.50, 9.40, 92.80, 1015, 100, 24.1, 59, 0.2, 1, 10, 'Overcast', 'cloudy', 'None', 4, 'VN73', 7280, 12, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (85, 'Bắc Giang, Việt Nam', '2024-12-06T12:00:00', 22.60, 22.60, 17.50, 72.92, 0.00, 6.50, 'None', 0.00, 0.00, 16.20, 8.60, 108.80, 1014, 100, 24.1, 52, 0.2, 1, 10, 'Overcast', 'cloudy', 'None', 4, 'VN73', 7280, 13, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (86, 'Bắc Giang, Việt Nam', '2024-12-06T13:00:00', 23.20, 23.20, 17.50, 70.32, 0.00, 6.50, 'None', 0.00, 0.00, 15.50, 8.60, 108.20, 1013, 100, 24.1, 92, 0.3, 1, 10, 'Overcast', 'cloudy', 'None', 4, 'VN73', 7280, 14, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (87, 'Bắc Giang, Việt Nam', '2024-12-06T14:00:00', 23.60, 23.60, 17.50, 68.64, 0.00, 45.20, '[rain]', 0.00, 0.00, 16.90, 9.70, 111.60, 1012, 98.3, 24.1, 97, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 4, 'VN73', 7280, 15, 1, 1, 1, 2, 1, 1, 2, 1, 1, 1);
INSERT INTO `staging` VALUES (88, 'Bắc Giang, Việt Nam', '2024-12-06T15:00:00', 23.60, 23.60, 17.50, 68.64, 0.00, 45.20, '[rain]', 0.00, 0.00, 16.20, 10.10, 110.40, 1011, 99.8, 24.1, 63, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 4, 'VN73', 7280, 16, 1, 1, 1, 2, 1, 1, 2, 1, 1, 1);
INSERT INTO `staging` VALUES (89, 'Bắc Giang, Việt Nam', '2024-12-06T16:00:00', 23.50, 23.50, 17.50, 69.06, 0.00, 45.20, '[rain]', 0.00, 0.00, 16.60, 9.40, 95.80, 1012, 99, 24.1, 29, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 4, 'VN73', 7280, 17, 1, 1, 1, 2, 1, 1, 2, 1, 1, 1);
INSERT INTO `staging` VALUES (90, 'Bắc Giang, Việt Nam', '2024-12-06T17:00:00', 23.20, 23.20, 17.40, 69.88, 0.00, 45.20, '[rain]', 0.00, 0.00, 19.10, 10.40, 89.60, 1012, 99, 24.1, 15, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 4, 'VN73', 7280, 18, 1, 1, 1, 3, 1, 1, 2, 1, 1, 1);
INSERT INTO `staging` VALUES (91, 'Bắc Giang, Việt Nam', '2024-12-06T18:00:00', 22.90, 22.90, 17.30, 70.71, 0.00, 45.20, '[rain]', 0.00, 0.00, 20.20, 10.10, 102.80, 1013, 81.4, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 4, 'VN73', 7280, 19, 1, 1, 3, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (92, 'Bắc Giang, Việt Nam', '2024-12-06T19:00:00', 22.40, 22.40, 17.20, 72.43, 0.00, 45.20, '[rain]', 0.00, 0.00, 16.60, 9.00, 116.70, 1013, 98.7, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 4, 'VN73', 7280, 20, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (93, 'Bắc Giang, Việt Nam', '2024-12-06T20:00:00', 22.40, 22.40, 17.00, 71.52, 0.00, 32.30, 'None', 0.00, 0.00, 14.80, 7.60, 111.60, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 4, 'VN73', 7280, 21, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (94, 'Bắc Giang, Việt Nam', '2024-12-06T21:00:00', 22.30, 22.30, 16.90, 71.50, 0.00, 32.30, 'None', 0.00, 0.00, 9.40, 5.40, 86.00, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 4, 'VN73', 7280, 22, 1, 2, 2, 3, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (95, 'Bắc Giang, Việt Nam', '2024-12-06T22:00:00', 22.10, 22.10, 16.60, 71.01, 0.00, 32.30, 'None', 0.00, 0.00, 8.60, 5.00, 45.90, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 4, 'VN73', 7280, 23, 1, 2, 2, 3, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (96, 'Bắc Giang, Việt Nam', '2024-12-06T23:00:00', 21.70, 21.70, 16.20, 70.93, 0.00, 32.30, 'None', 0.00, 0.00, 11.50, 7.60, 359.90, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 4, 'VN73', 7280, 24, 1, 2, 2, 4, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (97, 'Bắc Kạn, Việt Nam', '2024-12-06T00:00:00', 17.50, 17.50, 16.00, 90.92, 0.30, 3.20, '[rain]', 0.00, 0.00, 0.70, 0.40, 108.90, 1015, 100, 18.6, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 5, 'VN97', 7280, 1, 1, 1, 2, 2, 2, 1, 3, 4, 1, 1);
INSERT INTO `staging` VALUES (98, 'Bắc Kạn, Việt Nam', '2024-12-06T01:00:00', 17.40, 17.40, 15.90, 90.91, 0.20, 3.20, '[rain]', 0.00, 0.00, 2.50, 2.50, 40.70, 1015, 100, 23.7, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 5, 'VN97', 7280, 2, 1, 1, 2, 5, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (99, 'Bắc Kạn, Việt Nam', '2024-12-06T02:00:00', 17.20, 17.20, 15.70, 90.90, 0.10, 9.70, '[rain]', 0.00, 0.00, 1.40, 1.40, 67.10, 1015, 100, 23.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 5, 'VN97', 7280, 3, 1, 1, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (100, 'Bắc Kạn, Việt Nam', '2024-12-06T03:00:00', 17.10, 17.10, 15.40, 89.73, 0.00, 9.70, '[rain]', 0.00, 0.00, 2.20, 2.20, 102.90, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 5, 'VN97', 7280, 4, 1, 1, 2, 2, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (101, 'Bắc Kạn, Việt Nam', '2024-12-06T04:00:00', 16.90, 16.90, 15.10, 89.14, 0.00, 9.70, 'None', 0.00, 0.00, 2.50, 2.90, 94.30, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 5, 'VN97', 7280, 5, 1, 2, 2, 2, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (102, 'Bắc Kạn, Việt Nam', '2024-12-06T05:00:00', 16.80, 16.80, 14.80, 87.99, 0.00, 9.70, 'None', 0.00, 0.00, 2.90, 2.90, 98.30, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 5, 'VN97', 7280, 6, 1, 2, 2, 2, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (103, 'Bắc Kạn, Việt Nam', '2024-12-06T06:00:00', 16.80, 16.80, 14.60, 86.86, 0.00, 9.70, 'None', 0.00, 0.00, 2.90, 3.20, 96.70, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 5, 'VN97', 7280, 7, 1, 2, 2, 2, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (104, 'Bắc Kạn, Việt Nam', '2024-12-06T07:00:00', 16.90, 16.90, 14.70, 86.87, 0.00, 9.70, '[rain]', 0.00, 0.00, 3.60, 3.60, 101.90, 1015, 100, 24.1, 3, 0, 0, 10, 'Overcast', 'cloudy', 'None', 5, 'VN97', 7280, 8, 1, 1, 2, 2, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (105, 'Bắc Kạn, Việt Nam', '2024-12-06T08:00:00', 17.10, 17.10, 15.00, 87.45, 0.10, 3.20, '[rain]', 0.00, 0.00, 4.00, 2.90, 99.70, 1016, 100, 24.1, 12, 0, 0, 10, 'Overcast', 'cloudy', 'None', 5, 'VN97', 7280, 9, 1, 1, 2, 2, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (106, 'Bắc Kạn, Việt Nam', '2024-12-06T09:00:00', 17.30, 17.30, 15.20, 87.47, 0.00, 3.20, '[rain]', 0.00, 0.00, 4.70, 2.90, 77.70, 1017, 100, 23.8, 19, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 5, 'VN97', 7280, 10, 1, 1, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (107, 'Bắc Kạn, Việt Nam', '2024-12-06T10:00:00', 16.80, 16.80, 15.40, 91.45, 0.30, 3.20, '[rain]', 0.00, 0.00, 6.80, 4.00, 74.30, 1017, 100, 23.9, 15, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 5, 'VN97', 7280, 11, 1, 1, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (108, 'Bắc Kạn, Việt Nam', '2024-12-06T11:00:00', 16.70, 16.70, 15.40, 92.04, 0.00, 3.20, 'None', 0.00, 0.00, 6.10, 3.20, 57.50, 1016, 100, 24.1, 22, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 5, 'VN97', 7280, 12, 1, 2, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (109, 'Bắc Kạn, Việt Nam', '2024-12-06T12:00:00', 16.70, 16.70, 15.20, 90.86, 0.10, 3.20, '[rain]', 0.00, 0.00, 6.80, 3.60, 66.40, 1015, 100, 20.1, 31, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 5, 'VN97', 7280, 13, 1, 1, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (110, 'Bắc Kạn, Việt Nam', '2024-12-06T13:00:00', 16.20, 16.20, 14.90, 92.01, 0.20, 3.20, '[rain]', 0.00, 0.00, 6.80, 3.60, 66.30, 1014, 100, 24.1, 18, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 5, 'VN97', 7280, 14, 1, 1, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (111, 'Bắc Kạn, Việt Nam', '2024-12-06T14:00:00', 15.90, 15.90, 14.70, 92.58, 0.20, 67.70, '[rain]', 0.00, 0.00, 6.80, 3.60, 54.10, 1013, 100, 24.1, 18, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 5, 'VN97', 7280, 15, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (112, 'Bắc Kạn, Việt Nam', '2024-12-06T15:00:00', 15.50, 15.50, 14.60, 94.37, 0.10, 67.70, '[rain]', 0.00, 0.00, 7.20, 3.60, 60.60, 1013, 100, 24.1, 11, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 5, 'VN97', 7280, 16, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (113, 'Bắc Kạn, Việt Nam', '2024-12-06T16:00:00', 15.30, 15.30, 14.60, 95.59, 0.20, 67.70, '[rain]', 0.00, 0.00, 6.50, 3.20, 51.10, 1013, 100, 19.7, 7, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 5, 'VN97', 7280, 17, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (114, 'Bắc Kạn, Việt Nam', '2024-12-06T17:00:00', 15.10, 15.10, 14.70, 97.46, 0.30, 67.70, '[rain]', 0.00, 0.00, 7.60, 4.00, 56.00, 1014, 100, 24.1, 2, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 5, 'VN97', 7280, 18, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (115, 'Bắc Kạn, Việt Nam', '2024-12-06T18:00:00', 15.10, 15.10, 14.70, 97.46, 0.20, 67.70, '[rain]', 0.00, 0.00, 8.60, 4.30, 70.60, 1015, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 5, 'VN97', 7280, 19, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (116, 'Bắc Kạn, Việt Nam', '2024-12-06T19:00:00', 15.00, 15.00, 14.60, 97.45, 0.10, 67.70, '[rain]', 0.00, 0.00, 9.40, 4.70, 61.10, 1015, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 5, 'VN97', 7280, 20, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (117, 'Bắc Kạn, Việt Nam', '2024-12-06T20:00:00', 15.00, 15.00, 14.50, 96.83, 0.00, 71.00, '[rain]', 0.00, 0.00, 9.00, 4.30, 58.20, 1016, 100, 17.9, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 5, 'VN97', 7280, 21, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (118, 'Bắc Kạn, Việt Nam', '2024-12-06T21:00:00', 14.80, 14.80, 14.40, 97.45, 0.30, 71.00, '[rain]', 0.00, 0.00, 9.70, 4.70, 64.70, 1016, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 5, 'VN97', 7280, 22, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (119, 'Bắc Kạn, Việt Nam', '2024-12-06T22:00:00', 14.70, 14.70, 14.30, 97.45, 0.10, 71.00, '[rain]', 0.00, 0.00, 7.90, 4.00, 56.70, 1017, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 5, 'VN97', 7280, 23, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (120, 'Bắc Kạn, Việt Nam', '2024-12-06T23:00:00', 14.50, 14.50, 14.20, 98.08, 0.30, 71.00, '[rain]', 0.00, 0.00, 8.60, 4.30, 40.20, 1017, 100, 18.2, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 5, 'VN97', 7280, 24, 1, 1, 1, 5, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (121, 'Bắc Ninh, Việt Nam', '2024-12-06T00:00:00', 21.10, 21.10, 17.50, 79.92, 0.00, 0.00, 'None', 0.00, 0.00, 26.30, 9.70, 132.70, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 6, 'VN121', 7280, 1, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (122, 'Bắc Ninh, Việt Nam', '2024-12-06T01:00:00', 21.50, 21.50, 17.20, 76.52, 0.00, 0.00, 'None', 0.00, 0.00, 23.80, 9.40, 130.50, 1014, 92.7, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 6, 'VN121', 7280, 2, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (123, 'Bắc Ninh, Việt Nam', '2024-12-06T02:00:00', 21.40, 21.40, 17.00, 76.02, 0.00, 64.50, '[rain]', 0.00, 0.00, 18.40, 7.20, 118.20, 1014, 96, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 6, 'VN121', 7280, 3, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (124, 'Bắc Ninh, Việt Nam', '2024-12-06T03:00:00', 21.40, 21.40, 16.80, 75.06, 0.00, 64.50, '[rain]', 0.00, 0.00, 15.80, 5.00, 111.90, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 6, 'VN121', 7280, 4, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (125, 'Bắc Ninh, Việt Nam', '2024-12-06T04:00:00', 21.40, 21.40, 16.60, 74.11, 0.00, 64.50, '[rain]', 0.00, 0.00, 15.10, 5.80, 84.50, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 6, 'VN121', 7280, 5, 1, 1, 1, 3, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (126, 'Bắc Ninh, Việt Nam', '2024-12-06T05:00:00', 21.30, 21.30, 16.50, 74.10, 0.10, 64.50, '[rain]', 0.00, 0.00, 15.80, 9.00, 76.60, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 6, 'VN121', 7280, 6, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (127, 'Bắc Ninh, Việt Nam', '2024-12-06T06:00:00', 21.20, 21.20, 16.40, 74.08, 0.00, 64.50, '[rain]', 0.00, 0.00, 14.80, 8.30, 62.80, 1014, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 6, 'VN121', 7280, 7, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (128, 'Bắc Ninh, Việt Nam', '2024-12-06T07:00:00', 21.00, 21.00, 16.30, 74.52, 0.10, 64.50, '[rain]', 0.00, 0.00, 14.40, 7.60, 64.10, 1015, 100, 24.1, 1, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 6, 'VN121', 7280, 8, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (129, 'Bắc Ninh, Việt Nam', '2024-12-06T08:00:00', 21.20, 21.20, 16.40, 74.08, 0.00, 32.30, 'None', 0.00, 0.00, 16.60, 7.20, 67.50, 1015, 94.7, 24.1, 15, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 6, 'VN121', 7280, 9, 1, 2, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (130, 'Bắc Ninh, Việt Nam', '2024-12-06T09:00:00', 21.90, 21.90, 16.70, 72.34, 0.10, 32.30, '[rain]', 0.00, 0.00, 14.80, 7.60, 81.00, 1016, 100, 24.1, 64, 0.2, 1, 10, 'Overcast', 'cloudy', 'None', 6, 'VN121', 7280, 10, 1, 1, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (131, 'Bắc Ninh, Việt Nam', '2024-12-06T10:00:00', 22.30, 22.30, 17.10, 72.41, 0.00, 32.30, 'None', 0.00, 0.00, 16.60, 7.60, 100.90, 1016, 100, 24.1, 40, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 6, 'VN121', 7280, 11, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (132, 'Bắc Ninh, Việt Nam', '2024-12-06T11:00:00', 22.50, 22.50, 17.30, 72.45, 0.00, 32.30, 'None', 0.00, 0.00, 19.10, 9.40, 98.20, 1015, 100, 24.1, 56, 0.2, 1, 10, 'Overcast', 'cloudy', 'None', 6, 'VN121', 7280, 12, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (133, 'Bắc Ninh, Việt Nam', '2024-12-06T12:00:00', 22.50, 22.50, 17.40, 72.91, 0.00, 32.30, 'None', 0.00, 0.00, 19.80, 10.10, 96.20, 1014, 100, 24.1, 62, 0.2, 1, 10, 'Overcast', 'cloudy', 'None', 6, 'VN121', 7280, 13, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (134, 'Bắc Ninh, Việt Nam', '2024-12-06T13:00:00', 22.80, 22.80, 17.60, 72.50, 0.00, 32.30, 'None', 0.00, 0.00, 16.90, 10.10, 109.20, 1013, 100, 24.1, 82, 0.3, 1, 10, 'Overcast', 'cloudy', 'None', 6, 'VN121', 7280, 14, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (135, 'Bắc Ninh, Việt Nam', '2024-12-06T14:00:00', 22.90, 22.90, 17.70, 72.52, 0.00, 51.60, '[rain]', 0.00, 0.00, 18.00, 9.70, 108.20, 1012, 100, 24.1, 45, 0.2, 0, 10, 'Rain, Overcast', 'rain', 'None', 6, 'VN121', 7280, 15, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (136, 'Bắc Ninh, Việt Nam', '2024-12-06T15:00:00', 23.10, 23.10, 17.90, 72.55, 0.00, 51.60, '[rain]', 0.00, 0.00, 19.40, 10.10, 115.70, 1011, 100, 24.1, 36, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 6, 'VN121', 7280, 16, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (137, 'Bắc Ninh, Việt Nam', '2024-12-06T16:00:00', 23.20, 23.20, 17.80, 71.66, 0.00, 51.60, '[rain]', 0.00, 0.00, 20.50, 9.40, 97.40, 1012, 100, 24.1, 20, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 6, 'VN121', 7280, 17, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (138, 'Bắc Ninh, Việt Nam', '2024-12-06T17:00:00', 23.10, 23.10, 17.70, 71.64, 0.00, 51.60, '[rain]', 0.00, 0.00, 22.70, 12.20, 80.20, 1012, 99.2, 24.1, 18, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 6, 'VN121', 7280, 18, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (139, 'Bắc Ninh, Việt Nam', '2024-12-06T18:00:00', 22.90, 22.90, 17.40, 71.16, 0.10, 51.60, '[rain]', 0.00, 0.00, 23.80, 11.20, 93.20, 1013, 96.6, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 6, 'VN121', 7280, 19, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (140, 'Bắc Ninh, Việt Nam', '2024-12-06T19:00:00', 22.50, 22.50, 17.50, 73.37, 0.00, 51.60, '[rain]', 0.00, 0.00, 18.70, 8.60, 120.40, 1014, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 6, 'VN121', 7280, 20, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (141, 'Bắc Ninh, Việt Nam', '2024-12-06T20:00:00', 22.20, 22.20, 17.50, 74.72, 0.00, 29.00, 'None', 0.00, 0.00, 15.80, 6.50, 134.80, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 6, 'VN121', 7280, 21, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (142, 'Bắc Ninh, Việt Nam', '2024-12-06T21:00:00', 22.00, 22.00, 17.40, 75.16, 0.10, 29.00, '[rain]', 0.00, 0.00, 9.40, 3.60, 94.10, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 6, 'VN121', 7280, 22, 1, 1, 2, 2, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (143, 'Bắc Ninh, Việt Nam', '2024-12-06T22:00:00', 21.60, 21.60, 17.10, 75.57, 0.10, 29.00, '[rain]', 0.00, 0.00, 13.00, 6.50, 21.50, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 6, 'VN121', 7280, 23, 1, 1, 2, 5, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (144, 'Bắc Ninh, Việt Nam', '2024-12-06T23:00:00', 20.10, 20.10, 16.60, 80.29, 0.00, 29.00, '[rain]', 0.00, 0.00, 18.00, 13.30, 336.80, 1015, 100, 23.7, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 6, 'VN121', 7280, 24, 1, 1, 2, 4, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (145, 'Bến Tre, Việt Nam', '2024-12-06T00:00:00', 24.60, 24.60, 23.50, 93.61, 0.00, 9.70, 'None', 0.00, 0.00, 26.60, 6.50, 117.20, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 7, 'VN145', 7280, 1, 1, 2, 2, 2, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (146, 'Bến Tre, Việt Nam', '2024-12-06T01:00:00', 24.60, 24.60, 23.50, 93.61, 0.00, 9.70, 'None', 0.00, 0.00, 21.20, 5.80, 117.00, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 7, 'VN145', 7280, 2, 1, 2, 2, 2, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (147, 'Bến Tre, Việt Nam', '2024-12-06T02:00:00', 24.60, 24.60, 23.50, 93.61, 0.00, 0.00, 'None', 0.00, 0.00, 21.20, 6.10, 104.90, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 7, 'VN145', 7280, 3, 1, 2, 2, 2, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (148, 'Bến Tre, Việt Nam', '2024-12-06T03:00:00', 24.20, 24.20, 23.40, 95.30, 0.00, 0.00, 'None', 0.00, 0.00, 19.40, 6.10, 94.70, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 7, 'VN145', 7280, 4, 1, 2, 2, 2, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (149, 'Bến Tre, Việt Nam', '2024-12-06T04:00:00', 24.00, 24.00, 23.30, 95.87, 0.00, 0.00, 'None', 0.00, 0.00, 14.00, 5.80, 78.30, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 7, 'VN145', 7280, 5, 1, 2, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (150, 'Bến Tre, Việt Nam', '2024-12-06T05:00:00', 23.80, 23.80, 23.20, 96.45, 0.00, 0.00, 'None', 0.00, 0.00, 13.70, 5.80, 68.30, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 7, 'VN145', 7280, 6, 1, 2, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (151, 'Bến Tre, Việt Nam', '2024-12-06T06:00:00', 23.70, 23.70, 23.00, 95.86, 0.00, 0.00, 'None', 0.00, 0.00, 13.00, 5.80, 54.70, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 7, 'VN145', 7280, 7, 1, 2, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (152, 'Bến Tre, Việt Nam', '2024-12-06T07:00:00', 24.40, 24.40, 23.50, 94.73, 0.00, 0.00, 'None', 0.00, 0.00, 12.60, 4.70, 36.70, 1009, 100, 24.1, 35, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 7, 'VN145', 7280, 8, 1, 2, 2, 5, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (153, 'Bến Tre, Việt Nam', '2024-12-06T08:00:00', 25.80, 25.80, 23.80, 88.74, 0.00, 67.70, '[rain]', 0.00, 0.00, 9.70, 5.40, 34.40, 1009, 100, 24.1, 165, 0.6, 2, 10, 'Rain, Overcast', 'rain', 'None', 7, 'VN145', 7280, 9, 1, 1, 1, 5, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (154, 'Bến Tre, Việt Nam', '2024-12-06T09:00:00', 27.20, 30.30, 23.90, 82.20, 0.00, 67.70, '[rain]', 0.00, 0.00, 8.30, 5.40, 30.30, 1010, 100, 24.1, 328, 1.2, 3, 10, 'Rain, Overcast', 'rain', 'None', 7, 'VN145', 7280, 10, 1, 1, 1, 5, 1, 1, 1, 2, 2, 1);
INSERT INTO `staging` VALUES (155, 'Bến Tre, Việt Nam', '2024-12-06T10:00:00', 29.30, 33.70, 23.80, 72.30, 0.10, 67.70, '[rain]', 0.00, 0.00, 10.80, 5.80, 30.00, 1010, 100, 24.1, 569, 2, 6, 10, 'Rain, Overcast', 'rain', 'None', 7, 'VN145', 7280, 11, 1, 1, 1, 5, 1, 1, 1, 2, 3, 1);
INSERT INTO `staging` VALUES (156, 'Bến Tre, Việt Nam', '2024-12-06T11:00:00', 29.50, 34.40, 24.20, 73.21, 0.40, 67.70, '[rain]', 0.00, 0.00, 14.80, 8.30, 50.30, 1009, 100, 24.1, 784, 2.8, 8, 30, 'Rain, Overcast', 'rain', 'None', 7, 'VN145', 7280, 12, 1, 1, 1, 3, 1, 1, 1, 1, 4, 1);
INSERT INTO `staging` VALUES (157, 'Bến Tre, Việt Nam', '2024-12-06T12:00:00', 30.90, 35.40, 23.20, 63.61, 0.10, 67.70, '[rain]', 0.00, 0.00, 18.40, 9.70, 67.30, 1008, 100, 24.1, 850, 3.1, 9, 30, 'Rain, Overcast', 'rain', 'None', 7, 'VN145', 7280, 13, 1, 1, 1, 3, 1, 1, 2, 1, 4, 1);
INSERT INTO `staging` VALUES (158, 'Bến Tre, Việt Nam', '2024-12-06T13:00:00', 30.80, 35.60, 23.50, 65.14, 0.40, 67.70, '[rain]', 0.00, 0.00, 20.20, 10.80, 76.40, 1007, 89.8, 20.3, 822, 3, 8, 30, 'Rain, Partially cloudy', 'rain', 'None', 7, 'VN145', 7280, 14, 1, 1, 3, 3, 1, 1, 2, 1, 4, 1);
INSERT INTO `staging` VALUES (159, 'Bến Tre, Việt Nam', '2024-12-06T14:00:00', 31.00, 35.40, 23.00, 62.49, 0.30, 71.00, '[rain]', 0.00, 0.00, 21.20, 10.80, 79.60, 1006, 13.4, 24.1, 740, 2.7, 7, 10, 'Rain', 'rain', 'None', 7, 'VN145', 7280, 15, 1, 1, 4, 3, 1, 1, 2, 1, 3, 5);
INSERT INTO `staging` VALUES (160, 'Bến Tre, Việt Nam', '2024-12-06T15:00:00', 30.30, 34.30, 22.90, 64.65, 0.20, 71.00, '[rain]', 0.00, 0.00, 17.60, 10.80, 87.20, 1006, 5, 22.1, 587, 2.1, 6, 10, 'Rain', 'rain', 'None', 7, 'VN145', 7280, 16, 1, 1, 4, 3, 1, 1, 2, 1, 3, 5);
INSERT INTO `staging` VALUES (161, 'Bến Tre, Việt Nam', '2024-12-06T16:00:00', 28.90, 32.40, 22.90, 70.08, 0.10, 71.00, '[rain]', 0.00, 0.00, 14.80, 10.10, 97.60, 1006, 4.1, 24.1, 393, 1.4, 4, 10, 'Rain', 'rain', 'None', 7, 'VN145', 7280, 17, 1, 1, 4, 2, 1, 1, 1, 1, 2, 5);
INSERT INTO `staging` VALUES (162, 'Bến Tre, Việt Nam', '2024-12-06T17:00:00', 26.80, 29.20, 23.20, 80.68, 0.10, 71.00, '[rain]', 0.00, 0.00, 19.10, 9.00, 105.10, 1007, 5, 24.1, 169, 0.6, 2, 10, 'Rain', 'rain', 'None', 7, 'VN145', 7280, 18, 1, 1, 4, 2, 1, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (163, 'Bến Tre, Việt Nam', '2024-12-06T18:00:00', 25.20, 25.20, 23.20, 88.69, 0.00, 71.00, '[rain]', 0.00, 0.00, 20.90, 6.50, 108.10, 1007, 5.1, 24.1, 0, 0, 0, 10, 'Rain', 'rain', 'None', 7, 'VN145', 7280, 19, 1, 1, 4, 2, 1, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (164, 'Bến Tre, Việt Nam', '2024-12-06T19:00:00', 25.00, 25.00, 23.50, 91.40, 0.10, 71.00, '[rain]', 0.00, 0.00, 18.70, 6.10, 112.80, 1008, 24, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 7, 'VN145', 7280, 20, 1, 1, 3, 2, 1, 1, 3, 1, 1, 4);
INSERT INTO `staging` VALUES (165, 'Bến Tre, Việt Nam', '2024-12-06T20:00:00', 25.10, 25.10, 23.60, 91.40, 0.00, 12.90, 'None', 0.00, 0.00, 27.00, 7.20, 113.70, 1009, 33.3, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 7, 'VN145', 7280, 21, 1, 2, 6, 2, 4, 1, 3, 1, 1, 4);
INSERT INTO `staging` VALUES (166, 'Bến Tre, Việt Nam', '2024-12-06T21:00:00', 25.40, 25.40, 23.40, 88.71, 0.10, 12.90, '[rain]', 0.00, 0.00, 27.40, 7.60, 115.50, 1009, 5, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 7, 'VN145', 7280, 22, 1, 1, 5, 2, 3, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (167, 'Bến Tre, Việt Nam', '2024-12-06T22:00:00', 25.30, 25.30, 23.10, 87.63, 0.00, 12.90, 'None', 0.00, 0.00, 29.20, 7.90, 114.00, 1009, 4.4, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 7, 'VN145', 7280, 23, 1, 2, 5, 2, 3, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (168, 'Bến Tre, Việt Nam', '2024-12-06T23:00:00', 25.40, 25.40, 23.10, 87.11, 0.00, 12.90, 'None', 0.00, 0.00, 29.20, 8.30, 113.00, 1009, 5, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 7, 'VN145', 7280, 24, 1, 2, 5, 2, 3, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (169, 'Bình Định, Việt Nam', '2024-12-06T00:00:00', 24.00, 24.00, 21.40, 85.40, 0.00, 74.20, '[rain]', 0.00, 0.00, 26.60, 16.90, 329.60, 1011, 95.4, 22.4, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 1, 1, 1, 1, 4, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (170, 'Bình Định, Việt Nam', '2024-12-06T01:00:00', 23.80, 23.80, 21.20, 85.38, 0.10, 74.20, '[rain]', 0.00, 0.00, 25.90, 16.90, 327.80, 1011, 86.2, 23.7, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 8, 'VN169', 7280, 2, 1, 1, 3, 4, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (171, 'Bình Định, Việt Nam', '2024-12-06T02:00:00', 23.70, 23.70, 21.00, 84.85, 0.10, 87.10, '[rain]', 0.00, 0.00, 26.30, 17.60, 327.50, 1010, 95.3, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 3, 1, 1, 1, 4, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (172, 'Bình Định, Việt Nam', '2024-12-06T03:00:00', 23.70, 23.70, 20.90, 84.33, 0.00, 87.10, '[rain]', 0.00, 0.00, 26.30, 16.90, 327.50, 1010, 99.9, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 4, 1, 1, 1, 4, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (173, 'Bình Định, Việt Nam', '2024-12-06T04:00:00', 23.80, 23.80, 21.00, 84.34, 0.00, 87.10, '[rain]', 0.00, 0.00, 28.40, 17.60, 332.20, 1010, 99.1, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 5, 1, 1, 1, 4, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (174, 'Bình Định, Việt Nam', '2024-12-06T05:00:00', 23.70, 23.70, 21.10, 85.37, 0.10, 87.10, '[rain]', 0.00, 0.00, 29.50, 19.10, 337.80, 1011, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 6, 1, 1, 1, 4, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (175, 'Bình Định, Việt Nam', '2024-12-06T06:00:00', 23.80, 23.80, 21.30, 85.91, 0.10, 87.10, '[rain]', 0.00, 0.00, 31.30, 20.50, 342.00, 1011, 100, 22.7, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 7, 1, 1, 1, 4, 1, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (176, 'Bình Định, Việt Nam', '2024-12-06T07:00:00', 23.80, 23.80, 21.50, 86.97, 0.10, 87.10, '[rain]', 0.00, 0.00, 31.70, 21.20, 342.50, 1012, 100, 22.1, 6, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 8, 1, 1, 1, 4, 1, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (177, 'Bình Định, Việt Nam', '2024-12-06T08:00:00', 23.90, 23.90, 21.80, 88.05, 0.10, 96.80, '[rain]', 0.00, 0.00, 33.50, 20.50, 341.50, 1012, 100, 21.3, 28, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 9, 1, 1, 1, 4, 1, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (178, 'Bình Định, Việt Nam', '2024-12-06T09:00:00', 24.10, 24.10, 22.10, 88.60, 0.20, 96.80, '[rain]', 0.00, 0.00, 32.40, 18.70, 338.60, 1013, 100, 20.5, 51, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 10, 1, 1, 1, 4, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (179, 'Bình Định, Việt Nam', '2024-12-06T10:00:00', 24.40, 24.40, 22.40, 88.63, 0.20, 96.80, '[rain]', 0.00, 0.00, 29.90, 17.60, 343.00, 1013, 100, 14.3, 77, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 11, 1, 1, 1, 4, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (180, 'Bình Định, Việt Nam', '2024-12-06T11:00:00', 24.50, 24.50, 22.60, 89.18, 0.40, 96.80, '[rain]', 0.00, 0.00, 29.50, 19.80, 351.50, 1012, 99.9, 13.7, 89, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 12, 1, 1, 1, 4, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (181, 'Bình Định, Việt Nam', '2024-12-06T12:00:00', 24.40, 24.40, 22.80, 90.81, 0.40, 96.80, '[rain]', 0.00, 0.00, 30.60, 20.50, 351.60, 1011, 99.9, 11.9, 120, 0.4, 1, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 13, 1, 1, 1, 4, 1, 1, 3, 7, 1, 1);
INSERT INTO `staging` VALUES (182, 'Bình Định, Việt Nam', '2024-12-06T13:00:00', 24.40, 24.40, 22.90, 91.36, 0.50, 96.80, '[rain]', 0.00, 0.00, 32.40, 22.30, 358.70, 1010, 99.1, 9.1, 133, 0.5, 1, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 14, 1, 1, 1, 4, 1, 1, 3, 7, 1, 1);
INSERT INTO `staging` VALUES (183, 'Bình Định, Việt Nam', '2024-12-06T14:00:00', 24.30, 24.30, 23.00, 92.47, 0.60, 93.50, '[rain]', 0.00, 0.00, 32.80, 23.00, 2.30, 1009, 95.8, 5.7, 112, 0.4, 1, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 15, 1, 1, 1, 5, 1, 1, 3, 7, 1, 1);
INSERT INTO `staging` VALUES (184, 'Bình Định, Việt Nam', '2024-12-06T15:00:00', 24.30, 24.30, 23.00, 92.47, 0.70, 93.50, '[rain]', 0.00, 0.00, 33.10, 23.80, 4.70, 1009, 98.9, 4.3, 102, 0.4, 1, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 16, 1, 1, 1, 5, 1, 1, 3, 7, 1, 1);
INSERT INTO `staging` VALUES (185, 'Bình Định, Việt Nam', '2024-12-06T16:00:00', 24.30, 24.30, 22.90, 91.91, 0.80, 93.50, '[rain]', 0.00, 0.00, 32.00, 23.40, 3.50, 1009, 89.9, 3.3, 47, 0.2, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 8, 'VN169', 7280, 17, 1, 1, 3, 5, 1, 1, 3, 7, 1, 1);
INSERT INTO `staging` VALUES (186, 'Bình Định, Việt Nam', '2024-12-06T17:00:00', 24.20, 24.20, 22.90, 92.46, 0.80, 93.50, '[rain]', 0.00, 0.00, 31.00, 23.40, 3.10, 1010, 85.7, 2.8, 20, 0.1, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 8, 'VN169', 7280, 18, 1, 1, 3, 5, 1, 1, 3, 7, 1, 1);
INSERT INTO `staging` VALUES (187, 'Bình Định, Việt Nam', '2024-12-06T18:00:00', 24.20, 24.20, 22.90, 92.46, 0.80, 93.50, '[rain]', 0.00, 0.00, 30.20, 22.30, 4.80, 1011, 99.8, 3.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 19, 1, 1, 1, 5, 1, 1, 3, 7, 1, 1);
INSERT INTO `staging` VALUES (188, 'Bình Định, Việt Nam', '2024-12-06T19:00:00', 24.30, 24.30, 22.90, 91.91, 0.70, 93.50, '[rain]', 0.00, 0.00, 31.70, 22.00, 7.70, 1011, 100, 3.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 20, 1, 1, 1, 5, 1, 1, 3, 7, 1, 1);
INSERT INTO `staging` VALUES (189, 'Bình Định, Việt Nam', '2024-12-06T20:00:00', 24.30, 24.30, 22.90, 91.91, 0.70, 83.90, '[rain]', 0.00, 0.00, 32.80, 22.00, 8.90, 1012, 100, 2.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 21, 1, 1, 1, 5, 1, 1, 3, 7, 1, 1);
INSERT INTO `staging` VALUES (190, 'Bình Định, Việt Nam', '2024-12-06T21:00:00', 24.30, 24.30, 22.90, 91.91, 0.60, 83.90, '[rain]', 0.00, 0.00, 33.10, 22.00, 11.20, 1012, 100, 4.5, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 22, 1, 1, 1, 5, 1, 1, 3, 7, 1, 1);
INSERT INTO `staging` VALUES (191, 'Bình Định, Việt Nam', '2024-12-06T22:00:00', 24.30, 24.30, 22.90, 91.91, 0.50, 83.90, '[rain]', 0.00, 0.00, 33.10, 23.40, 9.70, 1012, 93.4, 2.8, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 23, 1, 1, 1, 5, 1, 1, 3, 7, 1, 1);
INSERT INTO `staging` VALUES (192, 'Bình Định, Việt Nam', '2024-12-06T23:00:00', 24.20, 24.20, 22.90, 92.46, 0.60, 83.90, '[rain]', 0.00, 0.00, 32.80, 23.00, 6.90, 1012, 96.4, 3.3, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 8, 'VN169', 7280, 24, 1, 1, 1, 5, 1, 1, 3, 7, 1, 1);
INSERT INTO `staging` VALUES (193, 'Bình Dương, Việt Nam', '2024-12-06T00:00:00', 25.00, 25.00, 23.70, 92.50, 0.00, 71.00, '[rain]', 0.00, 0.00, 6.80, 6.10, 218.90, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 9, 'VN193', 7280, 1, 1, 1, 1, 8, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (194, 'Bình Dương, Việt Nam', '2024-12-06T01:00:00', 24.80, 24.80, 23.60, 93.05, 0.00, 71.00, '[rain]', 0.00, 0.00, 10.80, 7.20, 235.80, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 9, 'VN193', 7280, 2, 1, 1, 1, 6, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (195, 'Bình Dương, Việt Nam', '2024-12-06T02:00:00', 24.60, 24.60, 23.40, 93.04, 0.00, 9.70, 'None', 0.00, 0.00, 10.10, 6.10, 244.20, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 9, 'VN193', 7280, 3, 1, 2, 2, 6, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (196, 'Bình Dương, Việt Nam', '2024-12-06T03:00:00', 24.50, 24.50, 23.20, 92.48, 0.00, 9.70, 'None', 0.00, 0.00, 5.00, 4.30, 239.60, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 9, 'VN193', 7280, 4, 1, 2, 2, 6, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (197, 'Bình Dương, Việt Nam', '2024-12-06T04:00:00', 24.40, 24.40, 22.90, 91.36, 0.00, 9.70, 'None', 0.00, 0.00, 3.20, 2.50, 252.50, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 9, 'VN193', 7280, 5, 1, 2, 2, 6, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (198, 'Bình Dương, Việt Nam', '2024-12-06T05:00:00', 24.20, 24.20, 22.50, 90.24, 0.00, 9.70, 'None', 0.00, 0.00, 2.50, 1.80, 235.40, 1007, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 9, 'VN193', 7280, 6, 1, 2, 2, 6, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (199, 'Bình Dương, Việt Nam', '2024-12-06T06:00:00', 24.10, 24.10, 22.40, 90.24, 0.00, 9.70, 'None', 0.00, 0.00, 1.80, 1.10, 89.80, 1008, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 9, 'VN193', 7280, 7, 1, 2, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (200, 'Bình Dương, Việt Nam', '2024-12-06T07:00:00', 24.70, 24.70, 22.70, 88.65, 0.00, 9.70, 'None', 0.00, 0.00, 1.40, 1.10, 87.90, 1009, 100, 24.1, 21, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 9, 'VN193', 7280, 8, 1, 2, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (201, 'Bình Dương, Việt Nam', '2024-12-06T08:00:00', 25.50, 25.50, 22.80, 85.04, 0.00, 25.80, 'None', 0.00, 0.00, 2.50, 2.20, 79.60, 1010, 100, 24.1, 99, 0.4, 1, 10, 'Overcast', 'cloudy', 'None', 9, 'VN193', 7280, 9, 1, 2, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (202, 'Bình Dương, Việt Nam', '2024-12-06T09:00:00', 26.40, 26.40, 22.90, 81.11, 0.00, 25.80, 'None', 0.00, 0.00, 2.50, 2.90, 72.20, 1010, 100, 24.1, 205, 0.7, 2, 10, 'Overcast', 'cloudy', 'None', 9, 'VN193', 7280, 10, 1, 2, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (203, 'Bình Dương, Việt Nam', '2024-12-06T10:00:00', 26.90, 29.40, 23.10, 79.72, 0.00, 25.80, 'None', 0.00, 0.00, 1.80, 1.40, 109.70, 1010, 100, 24.1, 239, 0.9, 2, 10, 'Overcast', 'cloudy', 'None', 9, 'VN193', 7280, 11, 1, 2, 2, 2, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (204, 'Bình Dương, Việt Nam', '2024-12-06T11:00:00', 27.40, 30.20, 23.10, 77.41, 0.00, 25.80, 'None', 0.00, 0.00, 1.10, 1.40, 52.20, 1009, 100, 24.1, 286, 1, 3, 10, 'Overcast', 'cloudy', 'None', 9, 'VN193', 7280, 12, 1, 2, 2, 3, 2, 1, 1, 3, 2, 1);
INSERT INTO `staging` VALUES (205, 'Bình Dương, Việt Nam', '2024-12-06T12:00:00', 28.40, 32.00, 23.30, 73.91, 0.00, 25.80, 'None', 0.00, 0.00, 1.80, 2.20, 38.50, 1008, 100, 24.1, 431, 1.6, 4, 10, 'Overcast', 'cloudy', 'None', 9, 'VN193', 7280, 13, 1, 2, 2, 5, 2, 1, 1, 3, 2, 1);
INSERT INTO `staging` VALUES (206, 'Bình Dương, Việt Nam', '2024-12-06T13:00:00', 29.50, 33.70, 23.40, 69.77, 0.00, 25.80, 'None', 0.00, 0.00, 2.50, 2.20, 17.20, 1007, 100, 24.1, 576, 2.1, 6, 10, 'Overcast', 'cloudy', 'None', 9, 'VN193', 7280, 14, 1, 2, 2, 5, 2, 1, 2, 3, 3, 1);
INSERT INTO `staging` VALUES (207, 'Bình Dương, Việt Nam', '2024-12-06T14:00:00', 30.40, 35.10, 23.50, 66.65, 0.10, 71.00, '[rain]', 0.00, 0.00, 4.00, 3.20, 3.40, 1006, 85.8, 24.1, 659, 2.4, 7, 30, 'Rain, Partially cloudy', 'rain', 'None', 9, 'VN193', 7280, 15, 1, 1, 3, 5, 1, 1, 2, 3, 3, 1);
INSERT INTO `staging` VALUES (208, 'Bình Dương, Việt Nam', '2024-12-06T15:00:00', 30.80, 35.40, 23.30, 64.36, 0.00, 71.00, '[rain]', 0.00, 0.00, 4.30, 2.20, 10.00, 1006, 40, 24.1, 577, 2.1, 6, 30, 'Rain, Partially cloudy', 'rain', 'None', 9, 'VN193', 7280, 16, 1, 1, 3, 5, 1, 1, 2, 3, 3, 4);
INSERT INTO `staging` VALUES (209, 'Bình Dương, Việt Nam', '2024-12-06T16:00:00', 30.60, 34.90, 23.10, 64.32, 0.00, 71.00, '[rain]', 0.00, 0.00, 2.50, 1.10, 275.60, 1005, 29.4, 24.1, 381, 1.4, 4, 30, 'Rain, Partially cloudy', 'rain', 'None', 9, 'VN193', 7280, 17, 1, 1, 3, 7, 1, 1, 2, 3, 2, 4);
INSERT INTO `staging` VALUES (210, 'Bình Dương, Việt Nam', '2024-12-06T17:00:00', 29.00, 33.40, 23.90, 74.01, 0.40, 71.00, '[rain]', 0.00, 0.00, 1.80, 1.10, 319.90, 1006, 5.2, 9, 160, 0.6, 2, 30, 'Rain', 'rain', 'None', 9, 'VN193', 7280, 18, 1, 1, 4, 4, 1, 1, 1, 3, 1, 5);
INSERT INTO `staging` VALUES (211, 'Bình Dương, Việt Nam', '2024-12-06T18:00:00', 26.50, 26.50, 23.20, 82.11, 1.20, 71.00, '[rain]', 0.00, 0.00, 2.20, 1.80, 115.30, 1007, 26.2, 14.2, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 9, 'VN193', 7280, 19, 1, 1, 3, 2, 1, 1, 1, 3, 1, 4);
INSERT INTO `staging` VALUES (212, 'Bình Dương, Việt Nam', '2024-12-06T19:00:00', 25.50, 25.50, 23.20, 87.12, 1.00, 71.00, '[rain]', 0.00, 0.00, 5.80, 6.10, 150.60, 1008, 8.6, 18.5, 0, 0, 0, 10, 'Rain', 'rain', 'None', 9, 'VN193', 7280, 20, 1, 1, 4, 1, 1, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (213, 'Bình Dương, Việt Nam', '2024-12-06T20:00:00', 25.30, 25.30, 23.50, 89.78, 0.50, 51.60, '[rain]', 0.00, 0.00, 7.20, 6.80, 175.90, 1009, 4.9, 24.1, 0, 0, 0, 10, 'Rain', 'rain', 'None', 9, 'VN193', 7280, 21, 1, 1, 4, 1, 1, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (214, 'Bình Dương, Việt Nam', '2024-12-06T21:00:00', 25.30, 25.30, 23.60, 90.32, 0.00, 51.60, '[rain]', 0.00, 0.00, 5.00, 4.70, 190.90, 1009, 66.9, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 9, 'VN193', 7280, 22, 1, 1, 3, 8, 1, 1, 3, 3, 1, 6);
INSERT INTO `staging` VALUES (215, 'Bình Dương, Việt Nam', '2024-12-06T22:00:00', 25.10, 25.10, 23.50, 90.85, 0.00, 51.60, '[rain]', 0.00, 0.00, 2.20, 1.80, 269.60, 1009, 53, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 9, 'VN193', 7280, 23, 1, 1, 3, 6, 1, 1, 3, 3, 1, 3);
INSERT INTO `staging` VALUES (216, 'Bình Dương, Việt Nam', '2024-12-06T23:00:00', 24.90, 24.90, 23.40, 91.39, 0.00, 51.60, '[rain]', 0.00, 0.00, 5.40, 5.00, 346.10, 1009, 67.5, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 9, 'VN193', 7280, 24, 1, 1, 3, 4, 1, 1, 3, 2, 1, 6);
INSERT INTO `staging` VALUES (217, 'Bình Phước, Việt Nam', '2024-12-06T00:00:00', 23.10, 23.10, 21.70, 91.84, 0.10, 51.60, '[rain]', 0.00, 0.00, 6.50, 5.00, 73.10, 1009, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 10, 'VN217', 7280, 1, 1, 1, 1, 3, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (218, 'Bình Phước, Việt Nam', '2024-12-06T01:00:00', 23.00, 23.00, 21.90, 93.53, 0.00, 51.60, '[rain]', 0.00, 0.00, 6.10, 5.00, 86.20, 1008, 100, 24.1, 0, 0, 0, 5, 'Rain, Overcast', 'rain', 'None', 10, 'VN217', 7280, 2, 1, 1, 1, 3, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (219, 'Bình Phước, Việt Nam', '2024-12-06T02:00:00', 23.00, 23.00, 21.90, 93.53, 0.00, 3.20, 'None', 0.00, 0.00, 4.30, 4.70, 78.50, 1008, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 10, 'VN217', 7280, 3, 1, 2, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (220, 'Bình Phước, Việt Nam', '2024-12-06T03:00:00', 22.90, 22.90, 21.80, 93.53, 0.00, 3.20, 'None', 0.00, 0.00, 6.50, 5.40, 74.10, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 10, 'VN217', 7280, 4, 1, 2, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (221, 'Bình Phước, Việt Nam', '2024-12-06T04:00:00', 22.80, 22.80, 21.60, 92.95, 0.00, 3.20, 'None', 0.00, 0.00, 6.50, 5.00, 68.20, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 10, 'VN217', 7280, 5, 1, 2, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (222, 'Bình Phước, Việt Nam', '2024-12-06T05:00:00', 22.60, 22.60, 21.20, 91.81, 0.00, 3.20, 'None', 0.00, 0.00, 6.80, 5.40, 62.10, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 10, 'VN217', 7280, 6, 1, 2, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (223, 'Bình Phước, Việt Nam', '2024-12-06T06:00:00', 22.40, 22.40, 20.80, 90.67, 0.00, 3.20, 'None', 0.00, 0.00, 9.40, 5.80, 60.70, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 10, 'VN217', 7280, 7, 1, 2, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (224, 'Bình Phước, Việt Nam', '2024-12-06T07:00:00', 22.70, 22.70, 20.70, 88.49, 0.00, 3.20, 'None', 0.00, 0.00, 9.00, 5.40, 50.80, 1009, 100, 24.1, 18, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 10, 'VN217', 7280, 8, 1, 2, 2, 3, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (225, 'Bình Phước, Việt Nam', '2024-12-06T08:00:00', 23.60, 23.60, 20.90, 84.84, 0.00, 6.50, 'None', 0.00, 0.00, 9.70, 4.00, 57.90, 1010, 100, 24.1, 67, 0.2, 1, 10, 'Overcast', 'cloudy', 'None', 10, 'VN217', 7280, 9, 1, 2, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (226, 'Bình Phước, Việt Nam', '2024-12-06T09:00:00', 24.60, 24.60, 21.00, 80.39, 0.00, 6.50, 'None', 0.00, 0.00, 6.50, 4.00, 58.50, 1010, 100, 24.1, 125, 0.5, 1, 10, 'Overcast', 'cloudy', 'None', 10, 'VN217', 7280, 10, 1, 2, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (227, 'Bình Phước, Việt Nam', '2024-12-06T10:00:00', 25.50, 25.50, 21.20, 77.13, 0.00, 6.50, 'None', 0.00, 0.00, 4.30, 2.50, 74.40, 1010, 100, 24.1, 173, 0.6, 2, 10, 'Overcast', 'cloudy', 'None', 10, 'VN217', 7280, 11, 1, 2, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (228, 'Bình Phước, Việt Nam', '2024-12-06T11:00:00', 26.30, 26.30, 21.40, 74.47, 0.00, 6.50, 'None', 0.00, 0.00, 1.40, 1.10, 158.00, 1010, 100, 24.1, 233, 0.8, 2, 10, 'Overcast', 'cloudy', 'None', 10, 'VN217', 7280, 12, 1, 2, 2, 1, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (229, 'Bình Phước, Việt Nam', '2024-12-06T12:00:00', 27.30, 29.40, 21.70, 71.51, 0.00, 6.50, 'None', 0.00, 0.00, 1.40, 2.20, 211.80, 1009, 100, 24.1, 321, 1.2, 3, 3, 'Overcast', 'cloudy', 'None', 10, 'VN217', 7280, 13, 1, 2, 2, 8, 2, 1, 1, 3, 2, 1);
INSERT INTO `staging` VALUES (230, 'Bình Phước, Việt Nam', '2024-12-06T13:00:00', 28.70, 31.40, 21.90, 66.71, 0.00, 6.50, 'None', 0.00, 0.00, 1.40, 3.20, 232.70, 1007, 100, 24.1, 454, 1.6, 5, 10, 'Overcast', 'cloudy', 'None', 10, 'VN217', 7280, 14, 1, 2, 2, 6, 2, 1, 2, 3, 2, 1);
INSERT INTO `staging` VALUES (231, 'Bình Phước, Việt Nam', '2024-12-06T14:00:00', 29.20, 32.20, 22.10, 65.61, 0.00, 80.60, '[rain]', 0.00, 0.00, 3.20, 5.40, 226.60, 1006, 100, 24.1, 490, 1.8, 5, 10, 'Rain, Overcast', 'rain', 'None', 10, 'VN217', 7280, 15, 1, 1, 1, 6, 1, 1, 2, 2, 2, 1);
INSERT INTO `staging` VALUES (232, 'Bình Phước, Việt Nam', '2024-12-06T15:00:00', 29.00, 32.10, 22.30, 67.18, 0.00, 80.60, '[rain]', 0.00, 0.00, 4.00, 5.40, 248.70, 1006, 99.5, 24.1, 384, 1.4, 4, 10, 'Rain, Overcast', 'rain', 'None', 10, 'VN217', 7280, 16, 1, 1, 1, 6, 1, 1, 2, 2, 2, 1);
INSERT INTO `staging` VALUES (233, 'Bình Phước, Việt Nam', '2024-12-06T16:00:00', 28.70, 32.10, 22.80, 70.47, 0.10, 80.60, '[rain]', 0.00, 0.00, 2.90, 5.00, 255.70, 1006, 66.3, 24.1, 325, 1.2, 3, 10, 'Rain, Partially cloudy', 'rain', 'None', 10, 'VN217', 7280, 17, 1, 1, 3, 6, 1, 1, 1, 2, 2, 6);
INSERT INTO `staging` VALUES (234, 'Bình Phước, Việt Nam', '2024-12-06T17:00:00', 26.10, 26.10, 23.70, 86.65, 0.30, 80.60, '[rain]', 0.00, 0.00, 2.90, 2.50, 269.10, 1006, 25.3, 24.1, 153, 0.6, 2, 30, 'Rain, Partially cloudy', 'rain', 'None', 10, 'VN217', 7280, 18, 1, 1, 3, 6, 1, 1, 1, 3, 1, 4);
INSERT INTO `staging` VALUES (235, 'Bình Phước, Việt Nam', '2024-12-06T18:00:00', 24.60, 24.60, 22.80, 89.73, 0.10, 80.60, '[rain]', 0.00, 0.00, 1.40, 1.40, 348.10, 1007, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 10, 'VN217', 7280, 19, 1, 1, 1, 4, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (236, 'Bình Phước, Việt Nam', '2024-12-06T19:00:00', 24.20, 24.20, 22.70, 91.35, 0.00, 80.60, '[rain]', 0.00, 0.00, 3.20, 3.60, 26.40, 1008, 91.5, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 10, 'VN217', 7280, 20, 1, 1, 1, 5, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (237, 'Bình Phước, Việt Nam', '2024-12-06T20:00:00', 23.80, 23.80, 22.70, 93.57, 0.00, 54.80, '[rain]', 0.00, 0.00, 4.70, 4.70, 33.20, 1009, 98.8, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 10, 'VN217', 7280, 21, 1, 1, 1, 5, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (238, 'Bình Phước, Việt Nam', '2024-12-06T21:00:00', 23.30, 23.30, 22.40, 94.69, 0.30, 54.80, '[rain]', 0.00, 0.00, 5.00, 5.00, 37.50, 1010, 94, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 10, 'VN217', 7280, 22, 1, 1, 1, 5, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (239, 'Bình Phước, Việt Nam', '2024-12-06T22:00:00', 22.90, 22.90, 22.00, 94.68, 0.00, 54.80, '[rain]', 0.00, 0.00, 9.40, 5.80, 38.20, 1010, 35.9, 24.1, 0, 0, 0, 3, 'Rain, Partially cloudy', 'rain', 'None', 10, 'VN217', 7280, 23, 1, 1, 3, 5, 1, 1, 3, 2, 1, 4);
INSERT INTO `staging` VALUES (240, 'Bình Phước, Việt Nam', '2024-12-06T23:00:00', 22.40, 22.40, 21.70, 95.82, 0.00, 54.80, '[rain]', 0.00, 0.00, 8.60, 5.80, 53.80, 1010, 59.7, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 10, 'VN217', 7280, 24, 1, 1, 3, 3, 1, 1, 3, 2, 1, 3);
INSERT INTO `staging` VALUES (241, 'Bình Thuận, Việt Nam', '2024-12-06T00:00:00', 23.60, 23.60, 22.30, 92.43, 0.00, 9.70, 'None', 0.00, 0.00, 1.40, 1.10, 14.70, 1009, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 11, 'VN241', 7280, 1, 1, 2, 2, 5, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (242, 'Bình Thuận, Việt Nam', '2024-12-06T01:00:00', 23.40, 23.40, 22.20, 92.98, 0.00, 9.70, 'None', 0.00, 0.00, 1.80, 1.80, 30.60, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 11, 'VN241', 7280, 2, 1, 2, 2, 5, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (243, 'Bình Thuận, Việt Nam', '2024-12-06T02:00:00', 23.20, 23.20, 22.10, 93.54, 0.00, 0.00, 'None', 0.00, 0.00, 2.90, 3.20, 1.70, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 11, 'VN241', 7280, 3, 1, 2, 2, 5, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (244, 'Bình Thuận, Việt Nam', '2024-12-06T03:00:00', 23.10, 23.10, 22.00, 93.54, 0.00, 0.00, 'None', 0.00, 0.00, 3.60, 3.60, 3.70, 1008, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 11, 'VN241', 7280, 4, 1, 2, 2, 5, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (245, 'Bình Thuận, Việt Nam', '2024-12-06T04:00:00', 23.00, 23.00, 21.90, 93.53, 0.00, 0.00, 'None', 0.00, 0.00, 3.20, 3.20, 357.70, 1008, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 11, 'VN241', 7280, 5, 1, 2, 2, 4, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (246, 'Bình Thuận, Việt Nam', '2024-12-06T05:00:00', 22.90, 22.90, 21.80, 93.53, 0.00, 0.00, 'None', 0.00, 0.00, 2.90, 2.90, 347.30, 1008, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 11, 'VN241', 7280, 6, 1, 2, 2, 4, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (247, 'Bình Thuận, Việt Nam', '2024-12-06T06:00:00', 22.80, 22.80, 21.60, 92.95, 0.00, 0.00, 'None', 0.00, 0.00, 2.90, 2.90, 25.40, 1008, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 11, 'VN241', 7280, 7, 1, 2, 2, 5, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (248, 'Bình Thuận, Việt Nam', '2024-12-06T07:00:00', 23.80, 23.80, 22.20, 90.77, 0.00, 0.00, 'None', 0.00, 0.00, 5.00, 4.30, 38.10, 1009, 100, 24.1, 37, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 11, 'VN241', 7280, 8, 1, 2, 2, 5, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (249, 'Bình Thuận, Việt Nam', '2024-12-06T08:00:00', 24.90, 24.90, 22.30, 85.50, 0.00, 12.90, 'None', 0.00, 0.00, 5.40, 4.00, 20.10, 1010, 100, 24.1, 139, 0.5, 1, 10, 'Overcast', 'cloudy', 'None', 11, 'VN241', 7280, 9, 1, 2, 2, 5, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (250, 'Bình Thuận, Việt Nam', '2024-12-06T09:00:00', 26.10, 26.10, 22.20, 79.13, 0.00, 12.90, 'None', 0.00, 0.00, 4.30, 2.90, 20.00, 1010, 100, 24.1, 310, 1.1, 3, 10, 'Overcast', 'cloudy', 'None', 11, 'VN241', 7280, 10, 1, 2, 2, 5, 2, 1, 1, 3, 2, 1);
INSERT INTO `staging` VALUES (251, 'Bình Thuận, Việt Nam', '2024-12-06T10:00:00', 28.10, 30.60, 21.90, 69.08, 0.00, 12.90, 'None', 0.00, 0.00, 4.30, 2.20, 62.00, 1010, 94, 24.1, 577, 2.1, 6, 10, 'Overcast', 'cloudy', 'None', 11, 'VN241', 7280, 11, 1, 2, 2, 3, 2, 1, 2, 3, 3, 1);
INSERT INTO `staging` VALUES (252, 'Bình Thuận, Việt Nam', '2024-12-06T11:00:00', 29.30, 32.20, 21.80, 64.04, 0.00, 12.90, 'None', 0.00, 0.00, 8.30, 6.10, 90.80, 1009, 100, 24.1, 743, 2.7, 7, 10, 'Overcast', 'cloudy', 'None', 11, 'VN241', 7280, 12, 1, 2, 2, 2, 2, 1, 2, 1, 3, 1);
INSERT INTO `staging` VALUES (253, 'Bình Thuận, Việt Nam', '2024-12-06T12:00:00', 29.60, 32.50, 21.80, 62.95, 0.00, 12.90, 'None', 0.00, 0.00, 9.00, 7.20, 103.50, 1008, 100, 24.1, 683, 2.5, 7, 10, 'Overcast', 'cloudy', 'None', 11, 'VN241', 7280, 13, 1, 2, 2, 2, 2, 1, 2, 1, 3, 1);
INSERT INTO `staging` VALUES (254, 'Bình Thuận, Việt Nam', '2024-12-06T13:00:00', 29.10, 32.10, 22.10, 65.99, 0.00, 12.90, 'None', 0.00, 0.00, 9.40, 11.50, 125.20, 1007, 100, 24.1, 587, 2.1, 6, 10, 'Overcast', 'cloudy', 'None', 11, 'VN241', 7280, 14, 1, 2, 2, 2, 2, 1, 2, 2, 3, 1);
INSERT INTO `staging` VALUES (255, 'Bình Thuận, Việt Nam', '2024-12-06T14:00:00', 27.90, 30.60, 22.40, 72.06, 0.00, 96.80, '[rain]', 0.00, 0.00, 11.20, 11.20, 122.40, 1006, 100, 24.1, 449, 1.6, 4, 10, 'Rain, Overcast', 'rain', 'None', 11, 'VN241', 7280, 15, 1, 1, 1, 2, 1, 1, 1, 2, 2, 1);
INSERT INTO `staging` VALUES (256, 'Bình Thuận, Việt Nam', '2024-12-06T15:00:00', 27.30, 30.00, 23.00, 77.40, 0.10, 96.80, '[rain]', 0.00, 0.00, 9.70, 7.60, 117.30, 1006, 88, 24.1, 386, 1.4, 4, 10, 'Rain, Partially cloudy', 'rain', 'None', 11, 'VN241', 7280, 16, 1, 1, 3, 2, 1, 1, 1, 1, 2, 1);
INSERT INTO `staging` VALUES (257, 'Bình Thuận, Việt Nam', '2024-12-06T16:00:00', 27.20, 30.00, 23.30, 79.28, 0.00, 96.80, '[rain]', 0.00, 0.00, 7.60, 5.00, 124.60, 1006, 63.9, 24.1, 327, 1.2, 3, 10, 'Rain, Partially cloudy', 'rain', 'None', 11, 'VN241', 7280, 17, 1, 1, 3, 2, 1, 1, 1, 2, 2, 6);
INSERT INTO `staging` VALUES (258, 'Bình Thuận, Việt Nam', '2024-12-06T17:00:00', 26.10, 26.10, 23.60, 86.13, 0.00, 96.80, '[rain]', 0.00, 0.00, 4.30, 2.50, 166.10, 1007, 53.1, 24.1, 129, 0.5, 1, 30, 'Rain, Partially cloudy', 'rain', 'None', 11, 'VN241', 7280, 18, 1, 1, 3, 1, 1, 1, 1, 3, 1, 3);
INSERT INTO `staging` VALUES (259, 'Bình Thuận, Việt Nam', '2024-12-06T18:00:00', 24.40, 24.40, 22.90, 91.36, 0.50, 96.80, '[rain]', 0.00, 0.00, 3.20, 1.10, 244.90, 1007, 94.1, 19.4, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 11, 'VN241', 7280, 19, 1, 1, 1, 6, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (260, 'Bình Thuận, Việt Nam', '2024-12-06T19:00:00', 24.00, 24.00, 22.70, 92.45, 0.60, 96.80, '[rain]', 0.00, 0.00, 3.20, 2.50, 352.30, 1008, 37.5, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 11, 'VN241', 7280, 20, 1, 1, 3, 4, 1, 1, 3, 3, 1, 4);
INSERT INTO `staging` VALUES (261, 'Bình Thuận, Việt Nam', '2024-12-06T20:00:00', 23.80, 23.80, 22.60, 93.00, 0.10, 9.70, '[rain]', 0.00, 0.00, 3.20, 2.90, 351.90, 1009, 96.5, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 11, 'VN241', 7280, 21, 1, 1, 2, 4, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (262, 'Bình Thuận, Việt Nam', '2024-12-06T21:00:00', 23.70, 23.70, 22.30, 91.87, 0.00, 9.70, 'None', 0.00, 0.00, 3.20, 3.20, 22.30, 1009, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 11, 'VN241', 7280, 22, 1, 2, 2, 5, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (263, 'Bình Thuận, Việt Nam', '2024-12-06T22:00:00', 23.50, 23.50, 22.20, 92.42, 0.00, 9.70, 'None', 0.00, 0.00, 3.20, 3.20, 31.70, 1010, 84.1, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 11, 'VN241', 7280, 23, 1, 2, 6, 5, 4, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (264, 'Bình Thuận, Việt Nam', '2024-12-06T23:00:00', 23.30, 23.30, 22.00, 92.41, 0.00, 9.70, 'None', 0.00, 0.00, 2.90, 2.90, 359.00, 1009, 74.3, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 11, 'VN241', 7280, 24, 1, 2, 6, 4, 4, 1, 3, 3, 1, 6);
INSERT INTO `staging` VALUES (265, 'Cà Mau, Việt Nam', '2024-12-06T00:00:00', 24.40, 24.40, 23.00, 91.91, 0.00, 58.10, '[rain]', 0.00, 0.00, 43.20, 10.80, 78.00, 1009, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 12, 'VN265', 7280, 1, 1, 1, 1, 3, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (266, 'Cà Mau, Việt Nam', '2024-12-06T01:00:00', 24.30, 24.30, 23.00, 92.47, 0.00, 58.10, '[rain]', 0.00, 0.00, 43.60, 9.70, 76.90, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 12, 'VN265', 7280, 2, 1, 1, 1, 3, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (267, 'Cà Mau, Việt Nam', '2024-12-06T02:00:00', 24.30, 24.30, 23.00, 92.47, 0.00, 35.50, 'None', 0.00, 0.00, 40.30, 10.40, 74.30, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 12, 'VN265', 7280, 3, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (268, 'Cà Mau, Việt Nam', '2024-12-06T03:00:00', 24.40, 24.40, 22.90, 91.36, 0.00, 35.50, 'None', 0.00, 0.00, 45.70, 11.50, 75.80, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 12, 'VN265', 7280, 4, 1, 2, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (269, 'Cà Mau, Việt Nam', '2024-12-06T04:00:00', 24.40, 24.40, 22.80, 90.81, 0.00, 35.50, 'None', 0.00, 0.00, 46.80, 13.00, 75.10, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 12, 'VN265', 7280, 5, 1, 2, 2, 3, 2, 1, 3, 5, 1, 1);
INSERT INTO `staging` VALUES (270, 'Cà Mau, Việt Nam', '2024-12-06T05:00:00', 24.60, 24.60, 22.70, 89.18, 0.00, 35.50, 'None', 0.00, 0.00, 50.00, 15.50, 78.90, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 12, 'VN265', 7280, 6, 1, 2, 2, 3, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (271, 'Cà Mau, Việt Nam', '2024-12-06T06:00:00', 24.80, 24.80, 22.80, 88.66, 0.00, 35.50, 'None', 0.00, 0.00, 50.40, 16.90, 80.80, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 12, 'VN265', 7280, 7, 1, 2, 2, 3, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (272, 'Cà Mau, Việt Nam', '2024-12-06T07:00:00', 25.50, 25.50, 23.10, 86.60, 0.00, 35.50, 'None', 0.00, 0.00, 48.20, 17.30, 79.30, 1008, 81.8, 24.1, 41, 0.1, 0, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 12, 'VN265', 7280, 8, 1, 2, 6, 3, 5, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (273, 'Cà Mau, Việt Nam', '2024-12-06T08:00:00', 27.20, 30.20, 23.60, 80.73, 0.00, 80.60, '[rain]', 0.00, 0.00, 45.00, 20.20, 76.50, 1009, 5, 24.1, 244, 0.9, 2, 10, 'Rain', 'rain', 'None', 12, 'VN265', 7280, 9, 1, 1, 4, 3, 1, 1, 1, 7, 1, 5);
INSERT INTO `staging` VALUES (274, 'Cà Mau, Việt Nam', '2024-12-06T09:00:00', 28.90, 32.80, 23.40, 72.23, 0.00, 80.60, '[rain]', 0.00, 0.00, 42.50, 24.80, 75.10, 1009, 25.3, 24.1, 486, 1.7, 5, 10, 'Rain, Partially cloudy', 'rain', 'None', 12, 'VN265', 7280, 10, 1, 1, 3, 3, 1, 1, 1, 7, 2, 4);
INSERT INTO `staging` VALUES (275, 'Cà Mau, Việt Nam', '2024-12-06T10:00:00', 30.10, 34.20, 23.00, 65.79, 0.10, 80.60, '[rain]', 0.00, 0.00, 38.20, 26.60, 71.50, 1009, 97, 24.1, 666, 2.4, 7, 10, 'Rain, Overcast', 'rain', 'None', 12, 'VN265', 7280, 11, 1, 1, 1, 3, 1, 1, 2, 7, 3, 1);
INSERT INTO `staging` VALUES (276, 'Cà Mau, Việt Nam', '2024-12-06T11:00:00', 30.20, 34.70, 23.40, 67.02, 0.50, 80.60, '[rain]', 0.00, 0.00, 34.20, 25.60, 79.10, 1009, 91, 9.7, 735, 2.6, 7, 30, 'Rain, Overcast', 'rain', 'None', 12, 'VN265', 7280, 12, 1, 1, 1, 3, 1, 1, 2, 7, 3, 1);
INSERT INTO `staging` VALUES (277, 'Cà Mau, Việt Nam', '2024-12-06T12:00:00', 29.90, 34.60, 23.80, 69.84, 0.80, 80.60, '[rain]', 0.00, 0.00, 33.10, 23.40, 85.30, 1008, 68.2, 9.7, 559, 2, 6, 30, 'Rain, Partially cloudy', 'rain', 'None', 12, 'VN265', 7280, 13, 1, 1, 3, 3, 1, 1, 2, 7, 3, 6);
INSERT INTO `staging` VALUES (278, 'Cà Mau, Việt Nam', '2024-12-06T13:00:00', 30.20, 35.10, 23.80, 68.65, 0.70, 80.60, '[rain]', 0.00, 0.00, 32.80, 23.80, 86.10, 1007, 98.5, 8.6, 700, 2.5, 7, 30, 'Rain, Overcast', 'rain', 'None', 12, 'VN265', 7280, 14, 1, 1, 1, 3, 1, 1, 2, 7, 3, 1);
INSERT INTO `staging` VALUES (279, 'Cà Mau, Việt Nam', '2024-12-06T14:00:00', 29.40, 34.10, 24.00, 72.76, 1.00, 80.60, '[rain]', 0.00, 0.00, 30.60, 21.60, 87.50, 1006, 58, 9.7, 459, 1.7, 5, 30, 'Rain, Partially cloudy', 'rain', 'None', 12, 'VN265', 7280, 15, 1, 1, 3, 3, 1, 1, 1, 7, 2, 3);
INSERT INTO `staging` VALUES (280, 'Cà Mau, Việt Nam', '2024-12-06T15:00:00', 28.80, 33.50, 24.40, 77.16, 1.00, 80.60, '[rain]', 0.00, 0.00, 30.20, 20.20, 91.20, 1006, 57.1, 8.2, 439, 1.6, 4, 30, 'Rain, Partially cloudy', 'rain', 'None', 12, 'VN265', 7280, 16, 1, 1, 3, 2, 1, 1, 1, 7, 2, 3);
INSERT INTO `staging` VALUES (281, 'Cà Mau, Việt Nam', '2024-12-06T16:00:00', 28.30, 32.60, 24.30, 78.95, 0.80, 80.60, '[rain]', 0.00, 0.00, 30.60, 19.40, 92.70, 1006, 83.4, 8.9, 356, 1.3, 4, 30, 'Rain, Partially cloudy', 'rain', 'None', 12, 'VN265', 7280, 17, 1, 1, 3, 2, 1, 1, 1, 2, 2, 1);
INSERT INTO `staging` VALUES (282, 'Cà Mau, Việt Nam', '2024-12-06T17:00:00', 26.80, 29.50, 23.90, 84.15, 0.70, 80.60, '[rain]', 0.00, 0.00, 34.20, 16.90, 93.10, 1006, 100, 24.1, 181, 0.7, 2, 10, 'Rain, Overcast', 'rain', 'None', 12, 'VN265', 7280, 18, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (283, 'Cà Mau, Việt Nam', '2024-12-06T18:00:00', 25.60, 25.60, 23.50, 88.19, 0.10, 80.60, '[rain]', 0.00, 0.00, 38.90, 14.80, 86.50, 1007, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 12, 'VN265', 7280, 19, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (284, 'Cà Mau, Việt Nam', '2024-12-06T19:00:00', 25.10, 25.10, 23.50, 90.85, 0.00, 80.60, '[rain]', 0.00, 0.00, 39.20, 12.20, 80.30, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 12, 'VN265', 7280, 20, 1, 1, 1, 3, 1, 1, 3, 5, 1, 1);
INSERT INTO `staging` VALUES (285, 'Cà Mau, Việt Nam', '2024-12-06T20:00:00', 24.90, 24.90, 23.50, 91.94, 0.00, 19.40, 'None', 0.00, 0.00, 38.20, 10.10, 76.90, 1008, 73.4, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 12, 'VN265', 7280, 21, 1, 2, 6, 3, 4, 1, 3, 1, 1, 6);
INSERT INTO `staging` VALUES (286, 'Cà Mau, Việt Nam', '2024-12-06T21:00:00', 24.70, 24.70, 23.60, 93.61, 0.00, 19.40, 'None', 0.00, 0.00, 30.20, 7.90, 81.50, 1009, 13, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 12, 'VN265', 7280, 22, 1, 2, 5, 3, 3, 1, 3, 1, 1, 5);
INSERT INTO `staging` VALUES (287, 'Cà Mau, Việt Nam', '2024-12-06T22:00:00', 24.60, 24.60, 23.60, 94.17, 0.00, 19.40, 'None', 0.00, 0.00, 20.50, 7.20, 81.70, 1009, 99.5, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 12, 'VN265', 7280, 23, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (288, 'Cà Mau, Việt Nam', '2024-12-06T23:00:00', 24.50, 24.50, 23.60, 94.74, 0.00, 19.40, 'None', 0.00, 0.00, 28.10, 8.30, 78.70, 1009, 98.5, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 12, 'VN265', 7280, 24, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (289, 'Cần Thơ, Việt Nam', '2024-12-06T00:00:00', 24.90, 24.90, 23.10, 89.75, 0.00, 41.90, 'None', 0.00, 0.00, 33.10, 7.90, 108.70, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 13, 'VN289', 7280, 1, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (290, 'Cần Thơ, Việt Nam', '2024-12-06T01:00:00', 24.80, 24.80, 23.00, 89.74, 0.00, 41.90, 'None', 0.00, 0.00, 31.70, 7.60, 106.20, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 13, 'VN289', 7280, 2, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (291, 'Cần Thơ, Việt Nam', '2024-12-06T02:00:00', 24.70, 24.70, 22.80, 89.19, 0.00, 0.00, 'None', 0.00, 0.00, 27.40, 6.80, 107.70, 1007, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 13, 'VN289', 7280, 3, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (292, 'Cần Thơ, Việt Nam', '2024-12-06T03:00:00', 24.60, 24.60, 22.80, 89.73, 0.00, 0.00, 'None', 0.00, 0.00, 25.60, 6.50, 102.30, 1007, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 13, 'VN289', 7280, 4, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (293, 'Cần Thơ, Việt Nam', '2024-12-06T04:00:00', 24.60, 24.60, 22.80, 89.73, 0.00, 0.00, 'None', 0.00, 0.00, 24.10, 6.50, 96.00, 1007, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 13, 'VN289', 7280, 5, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (294, 'Cần Thơ, Việt Nam', '2024-12-06T05:00:00', 24.20, 24.20, 22.70, 91.35, 0.00, 0.00, 'None', 0.00, 0.00, 22.00, 7.20, 90.80, 1007, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 13, 'VN289', 7280, 6, 1, 2, 2, 2, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (295, 'Cần Thơ, Việt Nam', '2024-12-06T06:00:00', 24.00, 24.00, 22.80, 93.01, 0.00, 0.00, 'None', 0.00, 0.00, 20.20, 6.80, 85.70, 1008, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 13, 'VN289', 7280, 7, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (296, 'Cần Thơ, Việt Nam', '2024-12-06T07:00:00', 24.70, 24.70, 23.40, 92.49, 0.00, 0.00, 'None', 0.00, 0.00, 22.30, 6.80, 67.50, 1008, 100, 24.1, 32, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 13, 'VN289', 7280, 8, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (297, 'Cần Thơ, Việt Nam', '2024-12-06T08:00:00', 26.30, 26.30, 23.80, 86.15, 0.00, 80.60, '[rain]', 0.00, 0.00, 15.80, 10.10, 64.40, 1009, 100, 24.1, 217, 0.8, 2, 10, 'Rain, Overcast', 'rain', 'None', 13, 'VN289', 7280, 9, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (298, 'Cần Thơ, Việt Nam', '2024-12-06T09:00:00', 27.80, 31.50, 24.10, 80.32, 0.30, 80.60, '[rain]', 0.00, 0.00, 13.00, 10.10, 54.10, 1010, 100, 7.2, 470, 1.7, 5, 10, 'Rain, Overcast', 'rain', 'None', 13, 'VN289', 7280, 10, 1, 1, 1, 3, 1, 1, 1, 1, 2, 1);
INSERT INTO `staging` VALUES (299, 'Cần Thơ, Việt Nam', '2024-12-06T10:00:00', 28.60, 33.20, 24.40, 78.06, 1.30, 80.60, '[rain]', 0.00, 0.00, 11.50, 8.60, 47.30, 1010, 99.9, 5.7, 643, 2.3, 6, 30, 'Rain, Overcast', 'rain', 'None', 13, 'VN289', 7280, 11, 1, 1, 1, 3, 1, 1, 1, 1, 3, 1);
INSERT INTO `staging` VALUES (300, 'Cần Thơ, Việt Nam', '2024-12-06T11:00:00', 29.40, 34.30, 24.20, 73.63, 1.40, 80.60, '[rain]', 0.00, 0.00, 13.30, 9.00, 62.90, 1009, 100, 8.6, 772, 2.8, 8, 30, 'Rain, Overcast', 'rain', 'None', 13, 'VN289', 7280, 12, 1, 1, 1, 3, 1, 1, 1, 1, 4, 1);
INSERT INTO `staging` VALUES (301, 'Cần Thơ, Việt Nam', '2024-12-06T12:00:00', 29.80, 34.80, 24.10, 71.53, 1.00, 80.60, '[rain]', 0.00, 0.00, 16.90, 11.50, 67.60, 1008, 100, 4.8, 805, 2.9, 8, 30, 'Rain, Overcast', 'rain', 'None', 13, 'VN289', 7280, 13, 1, 1, 1, 3, 1, 1, 1, 2, 4, 1);
INSERT INTO `staging` VALUES (302, 'Cần Thơ, Việt Nam', '2024-12-06T13:00:00', 29.70, 34.80, 24.30, 72.81, 1.40, 80.60, '[rain]', 0.00, 0.00, 16.90, 11.50, 68.40, 1007, 99.1, 12.6, 747, 2.7, 7, 30, 'Rain, Overcast', 'rain', 'None', 13, 'VN289', 7280, 14, 1, 1, 1, 3, 1, 1, 1, 2, 3, 1);
INSERT INTO `staging` VALUES (303, 'Cần Thơ, Việt Nam', '2024-12-06T14:00:00', 29.60, 34.70, 24.30, 73.23, 1.40, 87.10, '[rain]', 0.00, 0.00, 17.60, 11.20, 70.90, 1006, 96.7, 7.6, 636, 2.3, 6, 30, 'Rain, Overcast', 'rain', 'None', 13, 'VN289', 7280, 15, 1, 1, 1, 3, 1, 1, 1, 2, 3, 1);
INSERT INTO `staging` VALUES (304, 'Cần Thơ, Việt Nam', '2024-12-06T15:00:00', 29.60, 34.70, 24.30, 73.23, 0.90, 87.10, '[rain]', 0.00, 0.00, 19.40, 11.20, 75.40, 1006, 36.2, 15.2, 493, 1.8, 5, 30, 'Rain, Partially cloudy', 'rain', 'None', 13, 'VN289', 7280, 16, 1, 1, 3, 3, 1, 1, 1, 2, 2, 4);
INSERT INTO `staging` VALUES (305, 'Cần Thơ, Việt Nam', '2024-12-06T16:00:00', 29.20, 34.10, 24.30, 74.94, 0.70, 87.10, '[rain]', 0.00, 0.00, 20.50, 11.50, 84.00, 1006, 10.5, 11.8, 391, 1.4, 4, 30, 'Rain', 'rain', 'None', 13, 'VN289', 7280, 17, 1, 1, 4, 3, 1, 1, 1, 2, 2, 5);
INSERT INTO `staging` VALUES (306, 'Cần Thơ, Việt Nam', '2024-12-06T17:00:00', 27.50, 31.00, 24.20, 82.23, 0.60, 87.10, '[rain]', 0.00, 0.00, 21.20, 9.70, 92.00, 1006, 25.4, 18, 179, 0.6, 2, 30, 'Rain, Partially cloudy', 'rain', 'None', 13, 'VN289', 7280, 18, 1, 1, 3, 2, 1, 1, 1, 1, 1, 4);
INSERT INTO `staging` VALUES (307, 'Cần Thơ, Việt Nam', '2024-12-06T18:00:00', 25.90, 25.90, 23.70, 87.69, 0.20, 87.10, '[rain]', 0.00, 0.00, 15.50, 8.60, 103.20, 1007, 93.5, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 13, 'VN289', 7280, 19, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (308, 'Cần Thơ, Việt Nam', '2024-12-06T19:00:00', 25.20, 25.20, 23.50, 90.31, 0.00, 87.10, '[rain]', 0.00, 0.00, 21.60, 9.00, 116.50, 1008, 58.5, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 13, 'VN289', 7280, 20, 1, 1, 3, 2, 1, 1, 3, 1, 1, 3);
INSERT INTO `staging` VALUES (309, 'Cần Thơ, Việt Nam', '2024-12-06T20:00:00', 24.80, 24.80, 23.30, 91.38, 0.00, 6.50, 'None', 0.00, 0.00, 24.50, 8.60, 105.30, 1009, 85.7, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 13, 'VN289', 7280, 21, 1, 2, 6, 2, 4, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (310, 'Cần Thơ, Việt Nam', '2024-12-06T21:00:00', 24.60, 24.60, 23.30, 92.48, 0.00, 6.50, 'None', 0.00, 0.00, 35.60, 9.00, 96.70, 1009, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 13, 'VN289', 7280, 22, 1, 2, 2, 2, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (311, 'Cần Thơ, Việt Nam', '2024-12-06T22:00:00', 24.50, 24.50, 23.30, 93.04, 0.00, 6.50, 'None', 0.00, 0.00, 38.90, 9.00, 90.80, 1009, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 13, 'VN289', 7280, 23, 1, 2, 2, 2, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (312, 'Cần Thơ, Việt Nam', '2024-12-06T23:00:00', 24.40, 24.40, 23.30, 93.60, 0.00, 6.50, 'None', 0.00, 0.00, 37.40, 8.60, 95.40, 1009, 94.9, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 13, 'VN289', 7280, 24, 1, 2, 2, 2, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (313, 'Cao Bằng, Việt Nam', '2024-12-06T00:00:00', 17.80, 17.80, 14.30, 79.98, 0.10, 0.00, '[rain]', 0.00, 0.00, 2.90, 2.20, 101.20, 1015, 100, 21, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 14, 'VN313', 7280, 1, 1, 1, 2, 2, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (314, 'Cao Bằng, Việt Nam', '2024-12-06T01:00:00', 17.30, 17.30, 14.40, 83.08, 0.20, 0.00, '[rain]', 0.00, 0.00, 2.20, 2.20, 19.00, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 14, 'VN313', 7280, 2, 1, 1, 2, 5, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (315, 'Cao Bằng, Việt Nam', '2024-12-06T02:00:00', 16.80, 16.80, 14.10, 84.10, 0.00, 12.90, 'None', 0.00, 0.00, 3.60, 3.20, 53.40, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 14, 'VN313', 7280, 3, 1, 2, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (316, 'Cao Bằng, Việt Nam', '2024-12-06T03:00:00', 16.60, 16.60, 13.70, 82.99, 0.00, 12.90, 'None', 0.00, 0.00, 4.70, 4.00, 68.40, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 14, 'VN313', 7280, 4, 1, 2, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (317, 'Cao Bằng, Việt Nam', '2024-12-06T04:00:00', 16.40, 16.40, 13.40, 82.43, 0.00, 12.90, 'None', 0.00, 0.00, 4.00, 4.00, 66.30, 1015, 98.4, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 14, 'VN313', 7280, 5, 1, 2, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (318, 'Cao Bằng, Việt Nam', '2024-12-06T05:00:00', 16.30, 16.30, 13.30, 82.42, 0.00, 12.90, 'None', 0.00, 0.00, 3.60, 3.60, 74.10, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 14, 'VN313', 7280, 6, 1, 2, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (319, 'Cao Bằng, Việt Nam', '2024-12-06T06:00:00', 16.30, 16.30, 13.20, 81.88, 0.00, 12.90, 'None', 0.00, 0.00, 5.00, 4.00, 71.30, 1015, 72.1, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 14, 'VN313', 7280, 7, 1, 2, 6, 3, 4, 1, 1, 3, 1, 6);
INSERT INTO `staging` VALUES (320, 'Cao Bằng, Việt Nam', '2024-12-06T07:00:00', 16.20, 16.20, 13.30, 82.94, 0.00, 12.90, 'None', 0.00, 0.00, 6.50, 3.60, 79.80, 1016, 68.9, 24.1, 12, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 14, 'VN313', 7280, 8, 1, 2, 6, 3, 5, 1, 1, 3, 1, 6);
INSERT INTO `staging` VALUES (321, 'Cao Bằng, Việt Nam', '2024-12-06T08:00:00', 17.80, 17.80, 13.40, 75.44, 0.00, 0.00, 'None', 0.00, 0.00, 10.80, 5.40, 93.80, 1017, 97.6, 24.1, 103, 0.4, 1, 10, 'Overcast', 'cloudy', 'None', 14, 'VN313', 7280, 9, 1, 2, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (322, 'Cao Bằng, Việt Nam', '2024-12-06T09:00:00', 18.00, 18.00, 13.40, 74.49, 0.00, 0.00, 'None', 0.00, 0.00, 10.80, 5.80, 106.70, 1017, 100, 24.1, 71, 0.3, 1, 10, 'Overcast', 'cloudy', 'None', 14, 'VN313', 7280, 10, 1, 2, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (323, 'Cao Bằng, Việt Nam', '2024-12-06T10:00:00', 17.70, 17.70, 13.30, 75.42, 0.00, 0.00, 'None', 0.00, 0.00, 12.60, 5.80, 118.00, 1017, 100, 24.1, 39, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 14, 'VN313', 7280, 11, 1, 2, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (324, 'Cao Bằng, Việt Nam', '2024-12-06T11:00:00', 16.80, 16.80, 13.70, 81.94, 0.20, 0.00, '[rain]', 0.00, 0.00, 13.70, 5.80, 118.50, 1016, 100, 23.6, 27, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 14, 'VN313', 7280, 12, 1, 1, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (325, 'Cao Bằng, Việt Nam', '2024-12-06T12:00:00', 16.30, 16.30, 14.00, 86.26, 0.20, 0.00, '[rain]', 0.00, 0.00, 9.70, 3.20, 111.90, 1016, 100, 24.1, 27, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 14, 'VN313', 7280, 13, 1, 1, 2, 2, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (326, 'Cao Bằng, Việt Nam', '2024-12-06T13:00:00', 16.10, 16.10, 13.90, 86.80, 0.10, 0.00, '[rain]', 0.00, 0.00, 9.00, 2.90, 101.20, 1014, 100, 24.1, 29, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 14, 'VN313', 7280, 14, 1, 1, 2, 2, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (327, 'Cao Bằng, Việt Nam', '2024-12-06T14:00:00', 15.90, 15.90, 14.10, 89.06, 0.00, 38.70, '[rain]', 0.00, 0.00, 5.80, 2.20, 103.50, 1014, 100, 24.1, 20, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 14, 'VN313', 7280, 15, 1, 1, 2, 2, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (328, 'Cao Bằng, Việt Nam', '2024-12-06T15:00:00', 15.70, 15.70, 14.10, 90.21, 0.10, 38.70, '[rain]', 0.00, 0.00, 7.60, 2.90, 95.70, 1014, 100, 24.1, 16, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 14, 'VN313', 7280, 16, 1, 1, 2, 2, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (329, 'Cao Bằng, Việt Nam', '2024-12-06T16:00:00', 15.50, 15.50, 14.20, 91.96, 0.30, 38.70, '[rain]', 0.00, 0.00, 9.40, 3.60, 85.60, 1014, 100, 19.5, 10, 0, 0, 10, 'Overcast', 'cloudy', 'None', 14, 'VN313', 7280, 17, 1, 1, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (330, 'Cao Bằng, Việt Nam', '2024-12-06T17:00:00', 15.10, 15.10, 14.30, 94.97, 0.60, 38.70, '[rain]', 0.00, 0.00, 8.60, 3.20, 89.50, 1015, 100, 12.7, 3, 0, 0, 10, 'Overcast', 'cloudy', 'None', 14, 'VN313', 7280, 18, 1, 1, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (331, 'Cao Bằng, Việt Nam', '2024-12-06T18:00:00', 15.00, 15.00, 14.20, 94.97, 0.40, 38.70, '[rain]', 0.00, 0.00, 8.30, 3.60, 91.30, 1015, 100, 23, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 14, 'VN313', 7280, 19, 1, 1, 2, 2, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (332, 'Cao Bằng, Việt Nam', '2024-12-06T19:00:00', 14.90, 14.90, 14.00, 94.35, 0.10, 38.70, '[rain]', 0.00, 0.00, 5.80, 2.90, 96.70, 1016, 100, 20.4, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 14, 'VN313', 7280, 20, 1, 1, 2, 2, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (333, 'Cao Bằng, Việt Nam', '2024-12-06T20:00:00', 14.70, 14.70, 13.80, 94.34, 0.20, 58.10, '[rain]', 0.00, 0.00, 7.20, 3.60, 80.90, 1017, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 14, 'VN313', 7280, 21, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (334, 'Cao Bằng, Việt Nam', '2024-12-06T21:00:00', 14.70, 14.70, 13.60, 93.12, 0.10, 58.10, '[rain]', 0.00, 0.00, 4.30, 3.20, 34.70, 1017, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 14, 'VN313', 7280, 22, 1, 1, 1, 5, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (335, 'Cao Bằng, Việt Nam', '2024-12-06T22:00:00', 14.60, 14.60, 13.40, 92.51, 0.10, 58.10, '[rain]', 0.00, 0.00, 3.60, 2.50, 48.10, 1017, 100, 21.2, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 14, 'VN313', 7280, 23, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (336, 'Cao Bằng, Việt Nam', '2024-12-06T23:00:00', 14.40, 14.40, 13.30, 93.11, 0.30, 58.10, '[rain]', 0.00, 0.00, 4.30, 3.20, 48.10, 1018, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 14, 'VN313', 7280, 24, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (337, 'Đà Nẵng, Việt Nam', '2024-12-06T00:00:00', 23.80, 23.80, 21.10, 84.86, 0.50, 96.80, '[rain]', 0.00, 0.00, 9.40, 6.80, 68.50, 1013, 100, 18.3, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 1, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (338, 'Đà Nẵng, Việt Nam', '2024-12-06T01:00:00', 23.80, 23.80, 21.10, 84.86, 0.40, 96.80, '[rain]', 0.00, 0.00, 10.10, 7.90, 60.40, 1013, 98.6, 18, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 2, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (339, 'Đà Nẵng, Việt Nam', '2024-12-06T02:00:00', 23.80, 23.80, 21.10, 84.86, 0.40, 100.00, '[rain]', 0.00, 0.00, 11.50, 8.60, 51.60, 1012, 82.2, 18.8, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 15, 'VN337', 7280, 3, 1, 1, 3, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (340, 'Đà Nẵng, Việt Nam', '2024-12-06T03:00:00', 23.70, 23.70, 21.10, 85.37, 0.30, 100.00, '[rain]', 0.00, 0.00, 13.00, 10.10, 50.50, 1012, 85.5, 17.7, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 15, 'VN337', 7280, 4, 1, 1, 3, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (341, 'Đà Nẵng, Việt Nam', '2024-12-06T04:00:00', 23.60, 23.60, 21.30, 86.95, 0.50, 100.00, '[rain]', 0.00, 0.00, 14.80, 11.90, 56.50, 1012, 91.7, 12.9, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 5, 1, 1, 1, 3, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (342, 'Đà Nẵng, Việt Nam', '2024-12-06T05:00:00', 23.60, 23.60, 21.30, 86.95, 0.70, 100.00, '[rain]', 0.00, 0.00, 18.00, 14.80, 56.80, 1012, 84.8, 11.3, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 15, 'VN337', 7280, 6, 1, 1, 3, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (343, 'Đà Nẵng, Việt Nam', '2024-12-06T06:00:00', 23.60, 23.60, 21.30, 86.95, 0.70, 100.00, '[rain]', 0.00, 0.00, 22.70, 18.40, 55.30, 1013, 85.8, 13.3, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 15, 'VN337', 7280, 7, 1, 1, 3, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (344, 'Đà Nẵng, Việt Nam', '2024-12-06T07:00:00', 23.80, 23.80, 21.30, 85.91, 0.40, 100.00, '[rain]', 0.00, 0.00, 25.60, 18.70, 57.10, 1014, 99.7, 19.1, 11, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 8, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (345, 'Đà Nẵng, Việt Nam', '2024-12-06T08:00:00', 23.90, 23.90, 21.40, 85.92, 0.40, 100.00, '[rain]', 0.00, 0.00, 24.80, 15.80, 55.10, 1014, 100, 21.8, 47, 0.2, 0, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 9, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (346, 'Đà Nẵng, Việt Nam', '2024-12-06T09:00:00', 24.30, 24.30, 21.50, 84.40, 0.10, 100.00, '[rain]', 0.00, 0.00, 23.00, 12.60, 52.90, 1015, 99.4, 23.1, 83, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 10, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (347, 'Đà Nẵng, Việt Nam', '2024-12-06T10:00:00', 24.40, 24.40, 21.50, 83.89, 0.20, 100.00, '[rain]', 0.00, 0.00, 19.80, 11.20, 52.60, 1014, 99.3, 24.1, 126, 0.5, 1, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 11, 1, 1, 1, 3, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (348, 'Đà Nẵng, Việt Nam', '2024-12-06T11:00:00', 24.40, 24.40, 21.50, 83.89, 0.20, 100.00, '[rain]', 0.00, 0.00, 19.80, 13.70, 54.90, 1014, 97, 24.1, 171, 0.6, 2, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 12, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (349, 'Đà Nẵng, Việt Nam', '2024-12-06T12:00:00', 24.30, 24.30, 21.40, 83.88, 0.10, 100.00, '[rain]', 0.00, 0.00, 18.70, 15.50, 63.30, 1013, 94.7, 23.2, 196, 0.7, 2, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 13, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (350, 'Đà Nẵng, Việt Nam', '2024-12-06T13:00:00', 24.20, 24.20, 21.20, 83.36, 0.20, 100.00, '[rain]', 0.00, 0.00, 18.40, 15.10, 69.50, 1012, 98.7, 23.8, 215, 0.8, 2, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 14, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (351, 'Đà Nẵng, Việt Nam', '2024-12-06T14:00:00', 24.20, 24.20, 21.20, 83.36, 0.20, 96.80, '[rain]', 0.00, 0.00, 17.60, 14.40, 70.40, 1011, 99.4, 23.4, 151, 0.5, 2, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 15, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (352, 'Đà Nẵng, Việt Nam', '2024-12-06T15:00:00', 24.00, 24.00, 21.10, 83.85, 0.10, 96.80, '[rain]', 0.00, 0.00, 18.00, 14.40, 66.40, 1011, 100, 21.1, 86, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 16, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (353, 'Đà Nẵng, Việt Nam', '2024-12-06T16:00:00', 23.70, 23.70, 21.00, 84.85, 0.40, 96.80, '[rain]', 0.00, 0.00, 19.80, 15.80, 67.00, 1011, 100, 14.9, 40, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 17, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (354, 'Đà Nẵng, Việt Nam', '2024-12-06T17:00:00', 23.50, 23.50, 21.00, 85.88, 0.50, 96.80, '[rain]', 0.00, 0.00, 21.60, 16.90, 61.30, 1012, 100, 15.7, 9, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 18, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (355, 'Đà Nẵng, Việt Nam', '2024-12-06T18:00:00', 23.50, 23.50, 20.80, 84.83, 0.30, 96.80, '[rain]', 0.00, 0.00, 23.40, 17.60, 60.40, 1012, 100, 17.9, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 19, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (356, 'Đà Nẵng, Việt Nam', '2024-12-06T19:00:00', 23.60, 23.60, 20.80, 84.32, 0.20, 96.80, '[rain]', 0.00, 0.00, 22.30, 15.80, 60.90, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 20, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (357, 'Đà Nẵng, Việt Nam', '2024-12-06T20:00:00', 23.80, 23.80, 21.00, 84.34, 0.10, 71.00, '[rain]', 0.00, 0.00, 17.30, 11.20, 65.50, 1014, 99.8, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 21, 1, 1, 1, 3, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (358, 'Đà Nẵng, Việt Nam', '2024-12-06T21:00:00', 23.90, 23.90, 21.00, 83.84, 0.00, 71.00, '[rain]', 0.00, 0.00, 12.20, 6.50, 63.70, 1014, 98.8, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 22, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (359, 'Đà Nẵng, Việt Nam', '2024-12-06T22:00:00', 23.90, 23.90, 21.00, 83.84, 0.10, 71.00, '[rain]', 0.00, 0.00, 8.60, 3.60, 52.50, 1014, 98, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 23, 1, 1, 1, 3, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (360, 'Đà Nẵng, Việt Nam', '2024-12-06T23:00:00', 23.70, 23.70, 20.90, 84.33, 0.10, 71.00, '[rain]', 0.00, 0.00, 7.60, 4.00, 58.70, 1014, 98.8, 22.4, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 15, 'VN337', 7280, 24, 1, 1, 1, 3, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (361, 'Đắk Lắk, Việt Nam', '2024-12-06T00:00:00', 21.80, 21.80, 18.70, 82.56, 0.00, 0.00, 'None', 0.00, 0.00, 43.90, 12.60, 82.60, 1011, 99.4, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 16, 'VN361', 7280, 1, 1, 2, 2, 3, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (362, 'Đắk Lắk, Việt Nam', '2024-12-06T01:00:00', 21.70, 21.70, 18.70, 83.07, 0.00, 0.00, 'None', 0.00, 0.00, 42.10, 11.90, 83.30, 1010, 96.5, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 16, 'VN361', 7280, 2, 1, 2, 2, 3, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (363, 'Đắk Lắk, Việt Nam', '2024-12-06T02:00:00', 21.60, 21.60, 18.70, 83.58, 0.00, 0.00, 'None', 0.00, 0.00, 39.60, 11.20, 79.60, 1010, 67.1, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 16, 'VN361', 7280, 3, 1, 2, 6, 3, 4, 1, 1, 2, 1, 6);
INSERT INTO `staging` VALUES (364, 'Đắk Lắk, Việt Nam', '2024-12-06T03:00:00', 21.40, 21.40, 18.80, 85.14, 0.00, 0.00, 'None', 0.00, 0.00, 38.20, 10.80, 78.20, 1010, 47.7, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 16, 'VN361', 7280, 4, 1, 2, 6, 3, 4, 1, 1, 1, 1, 3);
INSERT INTO `staging` VALUES (365, 'Đắk Lắk, Việt Nam', '2024-12-06T04:00:00', 21.30, 21.30, 18.90, 86.20, 0.00, 0.00, 'None', 0.00, 0.00, 37.80, 10.80, 81.80, 1010, 9.6, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 16, 'VN361', 7280, 5, 1, 2, 5, 3, 3, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (366, 'Đắk Lắk, Việt Nam', '2024-12-06T05:00:00', 21.20, 21.20, 18.90, 86.73, 0.00, 0.00, 'None', 0.00, 0.00, 37.80, 10.40, 77.70, 1010, 5.1, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 16, 'VN361', 7280, 6, 1, 2, 5, 3, 3, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (367, 'Đắk Lắk, Việt Nam', '2024-12-06T06:00:00', 21.30, 21.30, 19.00, 86.74, 0.00, 0.00, 'None', 0.00, 0.00, 38.50, 10.80, 75.80, 1011, 96.7, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 16, 'VN361', 7280, 7, 1, 2, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (368, 'Đắk Lắk, Việt Nam', '2024-12-06T07:00:00', 22.70, 22.70, 19.40, 81.65, 0.00, 0.00, 'None', 0.00, 0.00, 42.10, 10.80, 78.70, 1011, 100, 24.1, 64, 0.2, 1, 10, 'Overcast', 'cloudy', 'None', 16, 'VN361', 7280, 8, 1, 2, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (369, 'Đắk Lắk, Việt Nam', '2024-12-06T08:00:00', 24.90, 24.90, 19.70, 72.87, 0.00, 9.70, 'None', 0.00, 0.00, 38.50, 13.70, 76.40, 1011, 83.6, 24.1, 244, 0.9, 2, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 16, 'VN361', 7280, 9, 1, 2, 6, 3, 5, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (370, 'Đắk Lắk, Việt Nam', '2024-12-06T09:00:00', 27.00, 28.40, 19.90, 65.15, 0.00, 9.70, 'None', 0.00, 0.00, 32.80, 15.80, 78.40, 1012, 64.1, 24.1, 466, 1.7, 5, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 16, 'VN361', 7280, 10, 1, 2, 6, 3, 5, 1, 2, 5, 2, 6);
INSERT INTO `staging` VALUES (371, 'Đắk Lắk, Việt Nam', '2024-12-06T10:00:00', 27.40, 29.00, 20.20, 64.83, 0.00, 9.70, 'None', 0.00, 0.00, 32.80, 17.30, 77.30, 1011, 98.5, 24.1, 563, 2, 6, 10, 'Overcast', 'cloudy', 'None', 16, 'VN361', 7280, 11, 1, 2, 2, 3, 2, 1, 2, 5, 3, 1);
INSERT INTO `staging` VALUES (372, 'Đắk Lắk, Việt Nam', '2024-12-06T11:00:00', 27.70, 29.30, 20.10, 63.31, 0.00, 9.70, 'None', 0.00, 0.00, 31.00, 16.60, 79.30, 1011, 74.6, 24.1, 649, 2.3, 6, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 16, 'VN361', 7280, 12, 1, 2, 6, 3, 5, 1, 2, 5, 3, 6);
INSERT INTO `staging` VALUES (373, 'Đắk Lắk, Việt Nam', '2024-12-06T12:00:00', 27.40, 29.00, 20.20, 64.83, 0.00, 9.70, 'None', 0.00, 0.00, 30.20, 16.20, 84.60, 1010, 72.5, 24.1, 597, 2.1, 6, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 16, 'VN361', 7280, 13, 1, 2, 6, 3, 5, 1, 2, 5, 3, 6);
INSERT INTO `staging` VALUES (374, 'Đắk Lắk, Việt Nam', '2024-12-06T13:00:00', 26.90, 28.40, 20.30, 67.18, 0.10, 9.70, '[rain]', 0.00, 0.00, 29.50, 15.80, 86.30, 1009, 91.7, 24.1, 491, 1.8, 5, 10, 'Overcast', 'cloudy', 'None', 16, 'VN361', 7280, 14, 1, 1, 2, 3, 2, 1, 2, 5, 2, 1);
INSERT INTO `staging` VALUES (375, 'Đắk Lắk, Việt Nam', '2024-12-06T14:00:00', 26.40, 26.40, 20.20, 68.76, 0.00, 22.60, 'None', 0.00, 0.00, 29.50, 15.50, 86.20, 1008, 100, 24.1, 390, 1.4, 4, 10, 'Overcast', 'cloudy', 'None', 16, 'VN361', 7280, 15, 1, 2, 2, 3, 2, 1, 2, 5, 2, 1);
INSERT INTO `staging` VALUES (376, 'Đắk Lắk, Việt Nam', '2024-12-06T15:00:00', 25.90, 25.90, 20.30, 71.26, 0.00, 22.60, 'None', 0.00, 0.00, 31.70, 15.10, 82.20, 1008, 100, 24.1, 307, 1.1, 3, 10, 'Overcast', 'cloudy', 'None', 16, 'VN361', 7280, 16, 1, 2, 2, 3, 2, 1, 1, 5, 2, 1);
INSERT INTO `staging` VALUES (377, 'Đắk Lắk, Việt Nam', '2024-12-06T16:00:00', 25.10, 25.10, 20.40, 75.19, 0.00, 22.60, 'None', 0.00, 0.00, 33.50, 13.70, 79.30, 1009, 100, 24.1, 226, 0.8, 2, 10, 'Overcast', 'cloudy', 'None', 16, 'VN361', 7280, 17, 1, 2, 2, 3, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (378, 'Đắk Lắk, Việt Nam', '2024-12-06T17:00:00', 23.70, 23.70, 20.30, 81.27, 0.00, 22.60, 'None', 0.00, 0.00, 35.30, 11.50, 76.90, 1009, 100, 24.1, 82, 0.3, 1, 10, 'Overcast', 'cloudy', 'None', 16, 'VN361', 7280, 18, 1, 2, 2, 3, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (379, 'Đắk Lắk, Việt Nam', '2024-12-06T18:00:00', 22.90, 22.90, 20.30, 85.29, 0.00, 22.60, 'None', 0.00, 0.00, 34.60, 10.80, 78.20, 1010, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 16, 'VN361', 7280, 19, 1, 2, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (380, 'Đắk Lắk, Việt Nam', '2024-12-06T19:00:00', 22.80, 22.80, 20.40, 86.34, 0.00, 22.60, 'None', 0.00, 0.00, 34.60, 10.40, 81.00, 1011, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 16, 'VN361', 7280, 20, 1, 2, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (381, 'Đắk Lắk, Việt Nam', '2024-12-06T20:00:00', 23.10, 23.10, 20.50, 85.31, 0.00, 0.00, 'None', 0.00, 0.00, 36.40, 10.10, 79.30, 1011, 93.8, 19.7, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 16, 'VN361', 7280, 21, 1, 2, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (382, 'Đắk Lắk, Việt Nam', '2024-12-06T21:00:00', 23.10, 23.10, 20.60, 85.84, 0.00, 0.00, 'None', 0.00, 0.00, 35.30, 10.40, 78.80, 1012, 98.6, 15.4, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 16, 'VN361', 7280, 22, 1, 2, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (383, 'Đắk Lắk, Việt Nam', '2024-12-06T22:00:00', 22.90, 22.90, 20.60, 86.89, 0.10, 0.00, '[rain]', 0.00, 0.00, 34.90, 10.10, 79.10, 1012, 97.6, 17, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 16, 'VN361', 7280, 23, 1, 1, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (384, 'Đắk Lắk, Việt Nam', '2024-12-06T23:00:00', 22.90, 22.90, 20.60, 86.89, 0.00, 0.00, 'None', 0.00, 0.00, 33.50, 9.70, 81.50, 1012, 92.1, 17.2, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 16, 'VN361', 7280, 24, 1, 2, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (385, 'Đắk Nông, Việt Nam', '2024-12-06T00:00:00', 18.10, 18.10, 17.90, 98.75, 0.00, 9.70, 'None', 0.00, 0.00, 16.60, 4.70, 54.20, 1011, 99.4, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 17, 'VN385', 7280, 1, 1, 2, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (386, 'Đắk Nông, Việt Nam', '2024-12-06T01:00:00', 17.80, 17.80, 17.70, 99.37, 0.00, 9.70, 'None', 0.00, 0.00, 17.30, 5.00, 58.20, 1011, 96.2, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 17, 'VN385', 7280, 2, 1, 2, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (387, 'Đắk Nông, Việt Nam', '2024-12-06T02:00:00', 17.70, 17.70, 17.60, 99.37, 0.00, 0.00, 'None', 0.00, 0.00, 15.50, 4.70, 60.00, 1010, 92.1, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 17, 'VN385', 7280, 3, 1, 2, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (388, 'Đắk Nông, Việt Nam', '2024-12-06T03:00:00', 17.60, 17.60, 17.50, 99.37, 0.00, 0.00, 'None', 0.00, 0.00, 15.50, 4.70, 61.20, 1010, 100, 14, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 17, 'VN385', 7280, 4, 1, 2, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (389, 'Đắk Nông, Việt Nam', '2024-12-06T04:00:00', 17.60, 17.60, 17.50, 99.37, 0.00, 0.00, 'None', 0.00, 0.00, 17.30, 5.00, 53.30, 1010, 100, 3.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 17, 'VN385', 7280, 5, 1, 2, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (390, 'Đắk Nông, Việt Nam', '2024-12-06T05:00:00', 17.70, 17.70, 17.60, 99.37, 0.00, 0.00, 'None', 0.00, 0.00, 17.60, 5.40, 53.10, 1010, 100, 2.7, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 17, 'VN385', 7280, 6, 1, 2, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (391, 'Đắk Nông, Việt Nam', '2024-12-06T06:00:00', 17.90, 17.90, 17.70, 98.75, 0.00, 0.00, 'None', 0.00, 0.00, 17.60, 5.40, 60.10, 1011, 100, 2.6, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 17, 'VN385', 7280, 7, 1, 2, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (392, 'Đắk Nông, Việt Nam', '2024-12-06T07:00:00', 19.00, 19.00, 18.20, 95.12, 0.00, 0.00, 'None', 0.00, 0.00, 20.20, 6.10, 55.30, 1011, 100, 14, 42, 0.2, 0, 10, 'Overcast', 'cloudy', 'None', 17, 'VN385', 7280, 8, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (393, 'Đắk Nông, Việt Nam', '2024-12-06T08:00:00', 21.00, 21.00, 18.50, 85.63, 0.00, 19.40, 'None', 0.00, 0.00, 18.40, 7.20, 56.20, 1012, 100, 24.1, 183, 0.7, 2, 10, 'Overcast', 'cloudy', 'None', 17, 'VN385', 7280, 9, 1, 2, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (394, 'Đắk Nông, Việt Nam', '2024-12-06T09:00:00', 23.70, 23.70, 18.60, 73.11, 0.00, 19.40, 'None', 0.00, 0.00, 17.30, 7.90, 51.70, 1012, 95.1, 24.1, 421, 1.5, 4, 10, 'Overcast', 'cloudy', 'None', 17, 'VN385', 7280, 10, 1, 2, 2, 3, 2, 1, 1, 1, 2, 1);
INSERT INTO `staging` VALUES (395, 'Đắk Nông, Việt Nam', '2024-12-06T10:00:00', 25.90, 25.90, 18.70, 64.51, 0.00, 19.40, 'None', 0.00, 0.00, 15.10, 7.90, 44.50, 1011, 74, 24.1, 608, 2.2, 6, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 17, 'VN385', 7280, 11, 1, 2, 6, 5, 5, 1, 2, 1, 3, 6);
INSERT INTO `staging` VALUES (396, 'Đắk Nông, Việt Nam', '2024-12-06T11:00:00', 27.90, 29.00, 18.80, 57.71, 0.00, 19.40, 'None', 0.00, 0.00, 12.20, 8.30, 38.70, 1010, 58, 24.1, 779, 2.8, 8, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 17, 'VN385', 7280, 12, 1, 2, 6, 5, 5, 1, 2, 1, 4, 3);
INSERT INTO `staging` VALUES (397, 'Đắk Nông, Việt Nam', '2024-12-06T12:00:00', 28.70, 29.80, 18.80, 55.09, 0.00, 19.40, 'None', 0.00, 0.00, 10.10, 8.30, 33.20, 1009, 100, 24.1, 773, 2.8, 8, 10, 'Overcast', 'cloudy', 'None', 17, 'VN385', 7280, 13, 1, 2, 2, 5, 2, 1, 2, 1, 4, 1);
INSERT INTO `staging` VALUES (398, 'Đắk Nông, Việt Nam', '2024-12-06T13:00:00', 27.80, 29.00, 19.10, 59.15, 0.10, 19.40, '[rain]', 0.00, 0.00, 9.70, 9.70, 27.00, 1008, 100, 24.1, 552, 2, 6, 10, 'Overcast', 'cloudy', 'None', 17, 'VN385', 7280, 14, 1, 1, 2, 5, 2, 1, 2, 1, 3, 1);
INSERT INTO `staging` VALUES (399, 'Đắk Nông, Việt Nam', '2024-12-06T14:00:00', 26.10, 26.10, 19.80, 68.27, 0.00, 87.10, '[rain]', 0.00, 0.00, 12.20, 9.70, 31.00, 1008, 100, 23.5, 362, 1.3, 4, 10, 'Rain, Overcast', 'rain', 'None', 17, 'VN385', 7280, 15, 1, 1, 1, 5, 1, 1, 2, 1, 2, 1);
INSERT INTO `staging` VALUES (400, 'Đắk Nông, Việt Nam', '2024-12-06T15:00:00', 25.00, 25.00, 19.80, 72.88, 0.10, 87.10, '[rain]', 0.00, 0.00, 15.80, 8.60, 32.30, 1008, 100, 23.4, 248, 0.9, 2, 10, 'Rain, Overcast', 'rain', 'None', 17, 'VN385', 7280, 16, 1, 1, 1, 5, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (401, 'Đắk Nông, Việt Nam', '2024-12-06T16:00:00', 24.10, 24.10, 19.80, 76.92, 0.00, 87.10, '[rain]', 0.00, 0.00, 19.40, 8.30, 32.00, 1008, 100, 24.1, 188, 0.7, 2, 10, 'Rain, Overcast', 'rain', 'None', 17, 'VN385', 7280, 17, 1, 1, 1, 5, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (402, 'Đắk Nông, Việt Nam', '2024-12-06T17:00:00', 22.50, 22.50, 19.70, 84.20, 0.10, 87.10, '[rain]', 0.00, 0.00, 23.40, 7.60, 31.70, 1009, 100, 24.1, 85, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 17, 'VN385', 7280, 18, 1, 1, 1, 5, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (403, 'Đắk Nông, Việt Nam', '2024-12-06T18:00:00', 20.70, 20.70, 19.50, 92.84, 0.00, 87.10, '[rain]', 0.00, 0.00, 21.60, 6.10, 39.60, 1010, 79.8, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 17, 'VN385', 7280, 19, 1, 1, 3, 5, 1, 1, 3, 1, 1, 6);
INSERT INTO `staging` VALUES (404, 'Đắk Nông, Việt Nam', '2024-12-06T19:00:00', 19.80, 19.80, 19.40, 97.55, 0.00, 87.10, '[rain]', 0.00, 0.00, 18.70, 5.40, 49.40, 1011, 74, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 17, 'VN385', 7280, 20, 1, 1, 3, 3, 1, 1, 3, 2, 1, 6);
INSERT INTO `staging` VALUES (405, 'Đắk Nông, Việt Nam', '2024-12-06T20:00:00', 19.50, 19.50, 19.20, 98.15, 0.00, 19.40, 'None', 0.00, 0.00, 20.20, 5.40, 48.80, 1011, 66.6, 15.4, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 17, 'VN385', 7280, 21, 1, 2, 6, 3, 4, 1, 3, 2, 1, 6);
INSERT INTO `staging` VALUES (406, 'Đắk Nông, Việt Nam', '2024-12-06T21:00:00', 19.60, 19.60, 19.20, 97.54, 0.00, 19.40, 'None', 0.00, 0.00, 19.10, 5.40, 48.80, 1012, 76.5, 23.3, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 17, 'VN385', 7280, 22, 1, 2, 6, 3, 4, 1, 3, 2, 1, 6);
INSERT INTO `staging` VALUES (407, 'Đắk Nông, Việt Nam', '2024-12-06T22:00:00', 20.00, 20.00, 19.20, 95.15, 0.00, 19.40, 'None', 0.00, 0.00, 18.70, 5.40, 49.60, 1012, 62, 13.7, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 17, 'VN385', 7280, 23, 1, 2, 6, 3, 4, 1, 3, 2, 1, 6);
INSERT INTO `staging` VALUES (408, 'Đắk Nông, Việt Nam', '2024-12-06T23:00:00', 19.90, 19.90, 19.20, 95.74, 0.00, 19.40, 'None', 0.00, 0.00, 19.10, 5.40, 54.40, 1012, 67.7, 12.7, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 17, 'VN385', 7280, 24, 1, 2, 6, 3, 4, 1, 3, 2, 1, 6);
INSERT INTO `staging` VALUES (409, 'Điện Biên, Việt Nam', '2024-12-06T00:00:00', 17.40, 17.40, 17.00, 97.50, 0.10, 3.20, '[rain]', 0.00, 0.00, 4.70, 4.00, 104.30, 1013, 99.5, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 18, 'VN409', 7280, 1, 1, 1, 2, 2, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (410, 'Điện Biên, Việt Nam', '2024-12-06T01:00:00', 17.30, 17.30, 16.80, 96.88, 0.00, 3.20, 'None', 0.00, 0.00, 4.70, 3.60, 102.60, 1013, 96.9, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 18, 'VN409', 7280, 2, 1, 2, 2, 2, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (411, 'Điện Biên, Việt Nam', '2024-12-06T02:00:00', 17.20, 17.20, 16.70, 96.88, 0.00, 6.50, 'None', 0.00, 0.00, 4.70, 4.00, 97.10, 1012, 93.5, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 18, 'VN409', 7280, 3, 1, 2, 2, 2, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (412, 'Điện Biên, Việt Nam', '2024-12-06T03:00:00', 16.90, 16.90, 16.50, 97.49, 0.10, 6.50, '[rain]', 0.00, 0.00, 3.20, 3.20, 90.80, 1012, 76.9, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 18, 'VN409', 7280, 4, 1, 1, 6, 2, 4, 1, 3, 3, 1, 6);
INSERT INTO `staging` VALUES (413, 'Điện Biên, Việt Nam', '2024-12-06T04:00:00', 16.40, 16.40, 16.30, 99.37, 0.00, 6.50, 'None', 0.00, 0.00, 4.70, 3.60, 91.60, 1012, 33.2, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 18, 'VN409', 7280, 5, 1, 2, 6, 2, 4, 1, 3, 3, 1, 4);
INSERT INTO `staging` VALUES (414, 'Điện Biên, Việt Nam', '2024-12-06T05:00:00', 16.10, 16.10, 16.00, 99.36, 0.40, 6.50, '[rain]', 0.00, 0.00, 0.70, 0.70, 79.20, 1012, 68.7, 12.9, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 18, 'VN409', 7280, 6, 1, 1, 6, 3, 4, 1, 3, 4, 1, 6);
INSERT INTO `staging` VALUES (415, 'Điện Biên, Việt Nam', '2024-12-06T06:00:00', 16.00, 16.00, 15.90, 99.36, 0.00, 6.50, 'None', 0.00, 0.00, 3.60, 4.00, 86.70, 1013, 71.1, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 18, 'VN409', 7280, 7, 1, 2, 6, 3, 4, 1, 3, 3, 1, 6);
INSERT INTO `staging` VALUES (416, 'Điện Biên, Việt Nam', '2024-12-06T07:00:00', 16.20, 16.20, 16.00, 98.73, 0.10, 6.50, '[rain]', 0.00, 0.00, 2.20, 2.20, 97.10, 1013, 96.6, 24.1, 5, 0, 0, 10, 'Overcast', 'cloudy', 'None', 18, 'VN409', 7280, 8, 1, 1, 2, 2, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (417, 'Điện Biên, Việt Nam', '2024-12-06T08:00:00', 17.00, 17.00, 16.70, 98.11, 0.10, 12.90, '[rain]', 0.00, 0.00, 4.30, 2.20, 102.70, 1014, 90.3, 23.8, 35, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 18, 'VN409', 7280, 9, 1, 1, 2, 2, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (418, 'Điện Biên, Việt Nam', '2024-12-06T09:00:00', 17.60, 17.60, 17.10, 96.89, 0.10, 12.90, '[rain]', 0.00, 0.00, 6.50, 3.20, 101.00, 1014, 100, 24.1, 88, 0.3, 1, 10, 'Overcast', 'cloudy', 'None', 18, 'VN409', 7280, 10, 1, 1, 2, 2, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (419, 'Điện Biên, Việt Nam', '2024-12-06T10:00:00', 17.70, 17.70, 17.30, 97.51, 0.20, 12.90, '[rain]', 0.00, 0.00, 4.70, 2.50, 132.40, 1015, 96.7, 24.1, 68, 0.2, 1, 10, 'Overcast', 'cloudy', 'None', 18, 'VN409', 7280, 11, 1, 1, 2, 2, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (420, 'Điện Biên, Việt Nam', '2024-12-06T11:00:00', 18.10, 18.10, 17.30, 95.08, 0.00, 12.90, 'None', 0.00, 0.00, 5.00, 2.90, 114.40, 1014, 39.2, 24.1, 134, 0.5, 1, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 18, 'VN409', 7280, 12, 1, 2, 6, 2, 5, 1, 3, 3, 1, 4);
INSERT INTO `staging` VALUES (421, 'Điện Biên, Việt Nam', '2024-12-06T12:00:00', 21.90, 21.90, 17.30, 75.14, 0.00, 12.90, 'None', 0.00, 0.00, 5.00, 3.60, 118.20, 1012, 69.8, 24.1, 608, 2.2, 6, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 18, 'VN409', 7280, 13, 1, 2, 6, 2, 5, 1, 1, 3, 3, 6);
INSERT INTO `staging` VALUES (422, 'Điện Biên, Việt Nam', '2024-12-06T13:00:00', 23.30, 23.30, 16.70, 66.44, 0.00, 12.90, 'None', 0.00, 0.00, 5.00, 4.00, 132.10, 1010, 72.4, 24.1, 482, 1.7, 5, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 18, 'VN409', 7280, 14, 1, 2, 6, 2, 5, 1, 2, 3, 2, 6);
INSERT INTO `staging` VALUES (423, 'Điện Biên, Việt Nam', '2024-12-06T14:00:00', 23.10, 23.10, 17.10, 68.98, 0.20, 16.10, '[rain]', 0.00, 0.00, 5.80, 3.60, 138.90, 1009, 90.6, 19.1, 430, 1.5, 4, 10, 'Overcast', 'cloudy', 'None', 18, 'VN409', 7280, 15, 1, 1, 2, 1, 2, 1, 2, 3, 2, 1);
INSERT INTO `staging` VALUES (424, 'Điện Biên, Việt Nam', '2024-12-06T15:00:00', 21.80, 21.80, 18.30, 80.52, 0.30, 16.10, '[rain]', 0.00, 0.00, 5.00, 3.20, 81.90, 1009, 77.7, 23.3, 214, 0.8, 2, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 18, 'VN409', 7280, 16, 1, 1, 6, 3, 5, 1, 1, 3, 1, 6);
INSERT INTO `staging` VALUES (425, 'Điện Biên, Việt Nam', '2024-12-06T16:00:00', 20.80, 20.80, 18.70, 87.78, 0.30, 16.10, '[rain]', 0.00, 0.00, 7.60, 4.30, 64.90, 1009, 71.9, 24.1, 176, 0.6, 2, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 18, 'VN409', 7280, 17, 1, 1, 6, 3, 5, 1, 1, 3, 1, 6);
INSERT INTO `staging` VALUES (426, 'Điện Biên, Việt Nam', '2024-12-06T17:00:00', 19.50, 19.50, 18.20, 92.20, 0.00, 16.10, 'None', 0.00, 0.00, 8.30, 4.70, 64.70, 1010, 96, 24.1, 75, 0.3, 1, 10, 'Overcast', 'cloudy', 'None', 18, 'VN409', 7280, 18, 1, 2, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (427, 'Điện Biên, Việt Nam', '2024-12-06T18:00:00', 18.80, 18.80, 17.70, 93.33, 0.00, 16.10, 'None', 0.00, 0.00, 6.50, 4.70, 65.10, 1011, 99, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 18, 'VN409', 7280, 19, 1, 2, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (428, 'Điện Biên, Việt Nam', '2024-12-06T19:00:00', 18.60, 18.60, 17.50, 93.32, 0.00, 16.10, 'None', 0.00, 0.00, 6.10, 4.30, 70.30, 1012, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 18, 'VN409', 7280, 20, 1, 2, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (429, 'Điện Biên, Việt Nam', '2024-12-06T20:00:00', 18.40, 18.40, 17.40, 93.90, 0.00, 0.00, 'None', 0.00, 0.00, 6.50, 4.70, 65.30, 1012, 99.5, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 18, 'VN409', 7280, 21, 1, 2, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (430, 'Điện Biên, Việt Nam', '2024-12-06T21:00:00', 18.10, 18.10, 17.30, 95.08, 0.00, 0.00, 'None', 0.00, 0.00, 8.30, 4.70, 66.30, 1013, 84.6, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 18, 'VN409', 7280, 22, 1, 2, 6, 3, 4, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (431, 'Điện Biên, Việt Nam', '2024-12-06T22:00:00', 17.50, 17.50, 17.10, 97.50, 0.20, 0.00, '[rain]', 0.00, 0.00, 3.60, 4.00, 89.10, 1013, 99.8, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 18, 'VN409', 7280, 23, 1, 1, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (432, 'Điện Biên, Việt Nam', '2024-12-06T23:00:00', 17.60, 17.60, 17.20, 97.50, 0.00, 0.00, 'None', 0.00, 0.00, 6.50, 4.70, 80.90, 1013, 99.6, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 18, 'VN409', 7280, 24, 1, 2, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (433, 'Đồng Tháp, Việt Nam', '2024-12-06T00:00:00', 25.80, 25.80, 23.70, 88.21, 0.00, 80.60, '[rain]', 0.00, 0.00, 10.40, 7.20, 165.50, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 19, 'VN433', 7280, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (434, 'Đồng Tháp, Việt Nam', '2024-12-06T01:00:00', 25.70, 25.70, 23.70, 88.73, 0.00, 80.60, '[rain]', 0.00, 0.00, 8.60, 6.50, 175.40, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 19, 'VN433', 7280, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (435, 'Đồng Tháp, Việt Nam', '2024-12-06T02:00:00', 25.60, 25.60, 23.60, 88.72, 0.00, 16.10, 'None', 0.00, 0.00, 4.70, 4.30, 184.00, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 19, 'VN433', 7280, 3, 1, 2, 2, 8, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (436, 'Đồng Tháp, Việt Nam', '2024-12-06T03:00:00', 25.50, 25.50, 23.40, 88.18, 0.00, 16.10, 'None', 0.00, 0.00, 5.40, 5.00, 164.40, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 19, 'VN433', 7280, 4, 1, 2, 2, 1, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (437, 'Đồng Tháp, Việt Nam', '2024-12-06T04:00:00', 25.30, 25.30, 23.30, 88.70, 0.00, 16.10, 'None', 0.00, 0.00, 4.00, 3.60, 158.30, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 19, 'VN433', 7280, 5, 1, 2, 2, 1, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (438, 'Đồng Tháp, Việt Nam', '2024-12-06T05:00:00', 25.10, 25.10, 23.20, 89.22, 0.00, 16.10, 'None', 0.00, 0.00, 2.20, 1.80, 136.20, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 19, 'VN433', 7280, 6, 1, 2, 2, 1, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (439, 'Đồng Tháp, Việt Nam', '2024-12-06T06:00:00', 25.00, 25.00, 23.10, 89.21, 0.00, 16.10, 'None', 0.00, 0.00, 1.80, 1.80, 262.70, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 19, 'VN433', 7280, 7, 1, 2, 2, 6, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (440, 'Đồng Tháp, Việt Nam', '2024-12-06T07:00:00', 25.60, 25.60, 23.40, 87.66, 0.00, 16.10, 'None', 0.00, 0.00, 2.50, 1.40, 251.50, 1009, 100, 24.1, 27, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 19, 'VN433', 7280, 8, 1, 2, 2, 6, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (441, 'Đồng Tháp, Việt Nam', '2024-12-06T08:00:00', 26.40, 26.40, 23.40, 83.60, 0.00, 64.50, '[rain]', 0.00, 0.00, 8.30, 5.40, 287.40, 1009, 100, 24.1, 115, 0.4, 1, 10, 'Rain, Overcast', 'rain', 'None', 19, 'VN433', 7280, 9, 1, 1, 1, 7, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (442, 'Đồng Tháp, Việt Nam', '2024-12-06T09:00:00', 27.40, 30.50, 23.50, 79.31, 0.00, 64.50, '[rain]', 0.00, 0.00, 8.30, 6.80, 284.90, 1010, 99.8, 18.2, 267, 1, 3, 10, 'Rain, Overcast', 'rain', 'None', 19, 'VN433', 7280, 10, 1, 1, 1, 7, 1, 1, 1, 1, 2, 1);
INSERT INTO `staging` VALUES (443, 'Đồng Tháp, Việt Nam', '2024-12-06T10:00:00', 28.10, 31.60, 23.50, 76.13, 0.30, 64.50, '[rain]', 0.00, 0.00, 5.00, 5.00, 280.70, 1010, 100, 8.1, 392, 1.4, 4, 10, 'Rain, Overcast', 'rain', 'None', 19, 'VN433', 7280, 11, 1, 1, 1, 7, 1, 1, 1, 2, 2, 1);
INSERT INTO `staging` VALUES (444, 'Đồng Tháp, Việt Nam', '2024-12-06T11:00:00', 28.40, 32.30, 23.80, 76.17, 1.50, 64.50, '[rain]', 0.00, 0.00, 2.90, 2.50, 276.90, 1009, 100, 5.4, 459, 1.7, 5, 10, 'Rain, Overcast', 'rain', 'None', 19, 'VN433', 7280, 12, 1, 1, 1, 7, 1, 1, 1, 3, 2, 1);
INSERT INTO `staging` VALUES (445, 'Đồng Tháp, Việt Nam', '2024-12-06T12:00:00', 29.10, 33.30, 23.60, 72.27, 1.50, 64.50, '[rain]', 0.00, 0.00, 2.90, 1.10, 64.80, 1008, 100, 13.5, 479, 1.7, 5, 10, 'Rain, Overcast', 'rain', 'None', 19, 'VN433', 7280, 13, 1, 1, 1, 3, 1, 1, 1, 3, 2, 1);
INSERT INTO `staging` VALUES (446, 'Đồng Tháp, Việt Nam', '2024-12-06T13:00:00', 29.80, 33.80, 23.10, 67.34, 0.40, 64.50, '[rain]', 0.00, 0.00, 7.20, 5.40, 82.90, 1007, 100, 23.2, 575, 2.1, 6, 10, 'Rain, Overcast', 'rain', 'None', 19, 'VN433', 7280, 14, 1, 1, 1, 3, 1, 1, 2, 2, 3, 1);
INSERT INTO `staging` VALUES (447, 'Đồng Tháp, Việt Nam', '2024-12-06T14:00:00', 30.30, 34.80, 23.40, 66.63, 0.10, 83.90, '[rain]', 0.00, 0.00, 9.70, 7.60, 81.40, 1006, 100, 24.1, 664, 2.4, 7, 30, 'Rain, Overcast', 'rain', 'None', 19, 'VN433', 7280, 15, 1, 1, 1, 3, 1, 1, 2, 1, 3, 1);
INSERT INTO `staging` VALUES (448, 'Đồng Tháp, Việt Nam', '2024-12-06T15:00:00', 30.50, 35.20, 23.50, 66.27, 0.20, 83.90, '[rain]', 0.00, 0.00, 10.80, 8.30, 88.60, 1006, 86.4, 17.9, 577, 2.1, 6, 30, 'Rain, Partially cloudy', 'rain', 'None', 19, 'VN433', 7280, 16, 1, 1, 3, 3, 1, 1, 2, 1, 3, 1);
INSERT INTO `staging` VALUES (449, 'Đồng Tháp, Việt Nam', '2024-12-06T16:00:00', 30.20, 34.90, 23.60, 67.83, 0.30, 83.90, '[rain]', 0.00, 0.00, 11.20, 9.00, 98.20, 1006, 68.5, 23.3, 379, 1.4, 4, 30, 'Rain, Partially cloudy', 'rain', 'None', 19, 'VN433', 7280, 17, 1, 1, 3, 2, 1, 1, 2, 1, 2, 6);
INSERT INTO `staging` VALUES (450, 'Đồng Tháp, Việt Nam', '2024-12-06T17:00:00', 29.00, 33.80, 24.40, 76.27, 0.30, 83.90, '[rain]', 0.00, 0.00, 9.40, 7.20, 107.10, 1006, 5, 7.7, 175, 0.6, 2, 30, 'Rain', 'rain', 'None', 19, 'VN433', 7280, 18, 1, 1, 4, 2, 1, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (451, 'Đồng Tháp, Việt Nam', '2024-12-06T18:00:00', 26.50, 26.50, 23.70, 84.63, 1.20, 83.90, '[rain]', 0.00, 0.00, 9.40, 9.40, 130.30, 1007, 16.1, 12.9, 0, 0, 0, 10, 'Rain', 'rain', 'None', 19, 'VN433', 7280, 19, 1, 1, 4, 2, 1, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (452, 'Đồng Tháp, Việt Nam', '2024-12-06T19:00:00', 26.10, 26.10, 23.70, 86.65, 1.00, 83.90, '[rain]', 0.00, 0.00, 10.80, 9.00, 144.10, 1008, 64.2, 21.5, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 19, 'VN433', 7280, 20, 1, 1, 3, 1, 1, 1, 1, 1, 1, 6);
INSERT INTO `staging` VALUES (453, 'Đồng Tháp, Việt Nam', '2024-12-06T20:00:00', 25.80, 25.80, 23.70, 88.21, 0.50, 41.90, '[rain]', 0.00, 0.00, 15.50, 9.70, 146.30, 1009, 31.3, 23.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 19, 'VN433', 7280, 21, 1, 1, 6, 1, 4, 1, 1, 1, 1, 4);
INSERT INTO `staging` VALUES (454, 'Đồng Tháp, Việt Nam', '2024-12-06T21:00:00', 25.40, 25.40, 23.60, 89.78, 0.10, 41.90, '[rain]', 0.00, 0.00, 16.20, 9.70, 133.10, 1009, 32.4, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 19, 'VN433', 7280, 22, 1, 1, 6, 2, 4, 1, 1, 1, 1, 4);
INSERT INTO `staging` VALUES (455, 'Đồng Tháp, Việt Nam', '2024-12-06T22:00:00', 25.00, 25.00, 23.30, 90.30, 0.00, 41.90, 'None', 0.00, 0.00, 15.80, 9.00, 127.20, 1009, 92.2, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 19, 'VN433', 7280, 23, 1, 2, 2, 2, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (456, 'Đồng Tháp, Việt Nam', '2024-12-06T23:00:00', 24.80, 24.80, 23.20, 90.83, 0.00, 41.90, 'None', 0.00, 0.00, 15.10, 9.00, 129.80, 1009, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 19, 'VN433', 7280, 24, 1, 2, 2, 2, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (457, 'Gia Lai, Việt Nam', '2024-12-06T00:00:00', 17.80, 17.80, 17.00, 95.07, 0.00, 0.00, 'None', 0.00, 0.00, 23.40, 7.60, 50.40, 1012, 6.8, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 20, 'VN457', 7280, 1, 1, 2, 5, 3, 3, 1, 3, 1, 1, 5);
INSERT INTO `staging` VALUES (458, 'Gia Lai, Việt Nam', '2024-12-06T01:00:00', 17.60, 17.60, 16.90, 95.67, 0.00, 0.00, 'None', 0.00, 0.00, 23.40, 7.90, 41.90, 1012, 9.5, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 20, 'VN457', 7280, 2, 1, 2, 5, 5, 3, 1, 3, 1, 1, 5);
INSERT INTO `staging` VALUES (459, 'Gia Lai, Việt Nam', '2024-12-06T02:00:00', 17.60, 17.60, 16.80, 95.06, 0.00, 0.00, 'None', 0.00, 0.00, 24.50, 7.90, 36.80, 1012, 8.7, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 20, 'VN457', 7280, 3, 1, 2, 5, 5, 3, 1, 3, 1, 1, 5);
INSERT INTO `staging` VALUES (460, 'Gia Lai, Việt Nam', '2024-12-06T03:00:00', 17.60, 17.60, 16.70, 94.46, 0.00, 0.00, 'None', 0.00, 0.00, 23.80, 7.90, 31.60, 1011, 6.4, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 20, 'VN457', 7280, 4, 1, 2, 5, 5, 3, 1, 3, 1, 1, 5);
INSERT INTO `staging` VALUES (461, 'Gia Lai, Việt Nam', '2024-12-06T04:00:00', 17.60, 17.60, 16.70, 94.46, 0.00, 0.00, 'None', 0.00, 0.00, 24.10, 7.60, 38.20, 1011, 7.7, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 20, 'VN457', 7280, 5, 1, 2, 5, 5, 3, 1, 3, 1, 1, 5);
INSERT INTO `staging` VALUES (462, 'Gia Lai, Việt Nam', '2024-12-06T05:00:00', 17.60, 17.60, 16.70, 94.46, 0.00, 0.00, 'None', 0.00, 0.00, 24.50, 7.90, 43.80, 1012, 10.5, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 20, 'VN457', 7280, 6, 1, 2, 5, 5, 3, 1, 3, 1, 1, 5);
INSERT INTO `staging` VALUES (463, 'Gia Lai, Việt Nam', '2024-12-06T06:00:00', 17.60, 17.60, 16.90, 95.67, 0.00, 0.00, 'None', 0.00, 0.00, 25.20, 8.30, 39.50, 1012, 13.4, 24.1, 0, 0, 0, 10, 'Clear', 'clear-day', 'None', 20, 'VN457', 7280, 7, 1, 2, 5, 5, 6, 1, 3, 1, 1, 5);
INSERT INTO `staging` VALUES (464, 'Gia Lai, Việt Nam', '2024-12-06T07:00:00', 19.30, 19.30, 17.40, 88.77, 0.00, 0.00, 'None', 0.00, 0.00, 32.40, 9.40, 36.20, 1012, 20, 24.1, 61, 0.2, 1, 10, 'Clear', 'clear-day', 'None', 20, 'VN457', 7280, 8, 1, 2, 5, 5, 6, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (465, 'Gia Lai, Việt Nam', '2024-12-06T08:00:00', 22.50, 22.50, 17.70, 74.30, 0.00, 3.20, 'None', 0.00, 0.00, 35.30, 15.50, 44.50, 1013, 64.5, 24.1, 273, 1, 3, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 20, 'VN457', 7280, 9, 1, 2, 6, 5, 5, 1, 1, 5, 2, 6);
INSERT INTO `staging` VALUES (466, 'Gia Lai, Việt Nam', '2024-12-06T09:00:00', 24.30, 24.30, 17.90, 67.49, 0.00, 3.20, 'None', 0.00, 0.00, 29.90, 16.90, 46.40, 1013, 90.2, 24.1, 462, 1.7, 5, 10, 'Overcast', 'cloudy', 'None', 20, 'VN457', 7280, 10, 1, 2, 2, 3, 2, 1, 2, 5, 2, 1);
INSERT INTO `staging` VALUES (467, 'Gia Lai, Việt Nam', '2024-12-06T10:00:00', 25.00, 25.00, 18.10, 65.55, 0.00, 3.20, 'None', 0.00, 0.00, 28.80, 16.90, 51.20, 1013, 95.7, 24.1, 558, 2, 6, 10, 'Overcast', 'cloudy', 'None', 20, 'VN457', 7280, 11, 1, 2, 2, 3, 2, 1, 2, 5, 3, 1);
INSERT INTO `staging` VALUES (468, 'Gia Lai, Việt Nam', '2024-12-06T11:00:00', 25.20, 25.20, 18.40, 66.00, 0.00, 3.20, 'None', 0.00, 0.00, 28.10, 16.60, 53.40, 1012, 100, 24.1, 616, 2.2, 6, 10, 'Overcast', 'cloudy', 'None', 20, 'VN457', 7280, 12, 1, 2, 2, 3, 2, 1, 2, 5, 3, 1);
INSERT INTO `staging` VALUES (469, 'Gia Lai, Việt Nam', '2024-12-06T12:00:00', 24.50, 24.50, 18.60, 69.68, 0.10, 3.20, '[rain]', 0.00, 0.00, 27.70, 14.80, 51.20, 1011, 100, 24.1, 529, 1.9, 5, 10, 'Overcast', 'cloudy', 'None', 20, 'VN457', 7280, 13, 1, 1, 2, 3, 2, 1, 2, 5, 2, 1);
INSERT INTO `staging` VALUES (470, 'Gia Lai, Việt Nam', '2024-12-06T13:00:00', 23.90, 23.90, 18.50, 71.79, 0.00, 3.20, '[rain]', 0.00, 0.00, 28.80, 14.40, 53.90, 1011, 77.9, 24.1, 441, 1.6, 4, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 20, 'VN457', 7280, 14, 1, 1, 6, 3, 5, 1, 1, 5, 2, 6);
INSERT INTO `staging` VALUES (471, 'Gia Lai, Việt Nam', '2024-12-06T14:00:00', 23.30, 23.30, 18.40, 73.97, 0.00, 6.50, 'None', 0.00, 0.00, 30.20, 14.40, 50.40, 1010, 69.1, 24.1, 339, 1.2, 3, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 20, 'VN457', 7280, 15, 1, 2, 6, 3, 5, 1, 1, 5, 2, 6);
INSERT INTO `staging` VALUES (472, 'Gia Lai, Việt Nam', '2024-12-06T15:00:00', 22.90, 22.90, 18.30, 75.31, 0.00, 6.50, 'None', 0.00, 0.00, 31.70, 14.80, 53.20, 1010, 67, 24.1, 297, 1.1, 3, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 20, 'VN457', 7280, 16, 1, 2, 6, 3, 5, 1, 1, 5, 2, 6);
INSERT INTO `staging` VALUES (473, 'Gia Lai, Việt Nam', '2024-12-06T16:00:00', 22.20, 22.20, 18.40, 79.07, 0.00, 6.50, 'None', 0.00, 0.00, 34.20, 14.00, 52.50, 1010, 55.7, 24.1, 203, 0.7, 2, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 20, 'VN457', 7280, 17, 1, 2, 6, 3, 5, 1, 1, 5, 1, 3);
INSERT INTO `staging` VALUES (474, 'Gia Lai, Việt Nam', '2024-12-06T17:00:00', 21.20, 21.20, 18.30, 83.53, 0.00, 6.50, 'None', 0.00, 0.00, 36.40, 12.60, 51.90, 1011, 45.7, 24.1, 81, 0.3, 1, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 20, 'VN457', 7280, 18, 1, 2, 6, 3, 5, 1, 1, 5, 1, 3);
INSERT INTO `staging` VALUES (475, 'Gia Lai, Việt Nam', '2024-12-06T18:00:00', 20.40, 20.40, 18.20, 87.20, 0.00, 6.50, 'None', 0.00, 0.00, 38.90, 13.00, 50.60, 1011, 33.8, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 20, 'VN457', 7280, 19, 1, 2, 6, 3, 4, 1, 1, 5, 1, 4);
INSERT INTO `staging` VALUES (476, 'Gia Lai, Việt Nam', '2024-12-06T19:00:00', 20.20, 20.20, 18.10, 87.73, 0.00, 6.50, 'None', 0.00, 0.00, 37.80, 12.60, 46.90, 1012, 36.9, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 20, 'VN457', 7280, 20, 1, 2, 6, 3, 4, 1, 1, 5, 1, 4);
INSERT INTO `staging` VALUES (477, 'Gia Lai, Việt Nam', '2024-12-06T20:00:00', 20.20, 20.20, 18.10, 87.73, 0.00, 0.00, 'None', 0.00, 0.00, 34.90, 11.50, 47.80, 1012, 88.1, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 20, 'VN457', 7280, 21, 1, 2, 6, 3, 4, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (478, 'Gia Lai, Việt Nam', '2024-12-06T21:00:00', 20.60, 20.60, 18.10, 85.59, 0.00, 0.00, 'None', 0.00, 0.00, 35.30, 13.00, 50.20, 1013, 99.9, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 20, 'VN457', 7280, 22, 1, 2, 2, 3, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (479, 'Gia Lai, Việt Nam', '2024-12-06T22:00:00', 20.80, 20.80, 18.10, 84.54, 0.00, 0.00, 'None', 0.00, 0.00, 33.50, 11.90, 46.70, 1013, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 20, 'VN457', 7280, 23, 1, 2, 2, 3, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (480, 'Gia Lai, Việt Nam', '2024-12-06T23:00:00', 21.10, 21.10, 18.00, 82.48, 0.00, 0.00, 'None', 0.00, 0.00, 32.00, 10.80, 44.50, 1013, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 20, 'VN457', 7280, 24, 1, 2, 2, 5, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (481, 'Hà Giang, Việt Nam', '2024-12-06T00:00:00', 17.00, 17.00, 16.70, 98.11, 0.30, 93.50, '[rain]', 0.00, 0.00, 5.00, 2.90, 142.10, 1015, 100, 23.2, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 1, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (482, 'Hà Giang, Việt Nam', '2024-12-06T01:00:00', 16.90, 16.90, 16.70, 98.74, 0.20, 93.50, '[rain]', 0.00, 0.00, 7.20, 2.90, 158.50, 1015, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 2, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (483, 'Hà Giang, Việt Nam', '2024-12-06T02:00:00', 16.80, 16.80, 16.70, 99.37, 0.10, 96.80, '[rain]', 0.00, 0.00, 5.00, 2.20, 109.60, 1014, 100, 7.3, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 3, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (484, 'Hà Giang, Việt Nam', '2024-12-06T03:00:00', 16.70, 16.70, 16.60, 99.37, 0.10, 96.80, '[rain]', 0.00, 0.00, 4.70, 2.20, 150.20, 1014, 100, 3.2, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 4, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (485, 'Hà Giang, Việt Nam', '2024-12-06T04:00:00', 16.70, 16.70, 16.60, 99.37, 0.10, 96.80, '[rain]', 0.00, 0.00, 5.40, 2.50, 179.70, 1014, 97.8, 7, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 5, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (486, 'Hà Giang, Việt Nam', '2024-12-06T05:00:00', 16.70, 16.70, 16.50, 98.74, 0.00, 96.80, '[rain]', 0.00, 0.00, 0.70, 0.70, 301.00, 1014, 100, 8.9, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 6, 1, 1, 1, 7, 1, 1, 3, 4, 1, 1);
INSERT INTO `staging` VALUES (487, 'Hà Giang, Việt Nam', '2024-12-06T06:00:00', 16.70, 16.70, 16.40, 98.11, 0.20, 96.80, '[rain]', 0.00, 0.00, 1.40, 1.10, 257.90, 1014, 100, 10.5, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 7, 1, 1, 1, 6, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (488, 'Hà Giang, Việt Nam', '2024-12-06T07:00:00', 16.70, 16.70, 16.30, 97.49, 0.10, 96.80, '[rain]', 0.00, 0.00, 1.10, 1.10, 294.40, 1015, 100, 24.1, 1, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 8, 1, 1, 1, 7, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (489, 'Hà Giang, Việt Nam', '2024-12-06T08:00:00', 16.80, 16.80, 16.30, 96.87, 0.20, 96.80, '[rain]', 0.00, 0.00, 1.40, 1.80, 260.60, 1016, 100, 18.3, 6, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 9, 1, 1, 1, 6, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (490, 'Hà Giang, Việt Nam', '2024-12-06T09:00:00', 16.80, 16.80, 16.40, 97.49, 0.70, 96.80, '[rain]', 0.00, 0.00, 1.40, 0.70, 200.30, 1016, 100, 11.3, 11, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 10, 1, 1, 1, 8, 1, 1, 3, 4, 1, 1);
INSERT INTO `staging` VALUES (491, 'Hà Giang, Việt Nam', '2024-12-06T10:00:00', 16.70, 16.70, 16.50, 98.74, 0.80, 96.80, '[rain]', 0.00, 0.00, 2.20, 0.70, 148.30, 1016, 100, 9.1, 14, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 11, 1, 1, 1, 1, 1, 1, 3, 4, 1, 1);
INSERT INTO `staging` VALUES (492, 'Hà Giang, Việt Nam', '2024-12-06T11:00:00', 16.70, 16.70, 16.50, 98.74, 1.30, 96.80, '[rain]', 0.00, 0.00, 1.80, 0.40, 66.00, 1016, 100, 8.4, 14, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 12, 1, 1, 1, 3, 1, 1, 3, 4, 1, 1);
INSERT INTO `staging` VALUES (493, 'Hà Giang, Việt Nam', '2024-12-06T12:00:00', 16.70, 16.70, 16.60, 99.37, 1.10, 96.80, '[rain]', 0.00, 0.00, 1.80, 0.70, 64.10, 1014, 100, 9.7, 16, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 13, 1, 1, 1, 3, 1, 1, 3, 4, 1, 1);
INSERT INTO `staging` VALUES (494, 'Hà Giang, Việt Nam', '2024-12-06T13:00:00', 16.70, 16.70, 16.50, 98.74, 1.30, 96.80, '[rain]', 0.00, 0.00, 3.20, 1.80, 85.40, 1013, 100, 12, 16, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 14, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (495, 'Hà Giang, Việt Nam', '2024-12-06T14:00:00', 16.60, 16.60, 16.50, 99.37, 1.50, 96.80, '[rain]', 0.00, 0.00, 2.90, 1.40, 90.00, 1013, 100, 9.3, 13, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 15, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (496, 'Hà Giang, Việt Nam', '2024-12-06T15:00:00', 16.50, 16.50, 16.40, 99.37, 1.10, 96.80, '[rain]', 0.00, 0.00, 4.70, 2.50, 103.50, 1012, 100, 14.1, 10, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 16, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (497, 'Hà Giang, Việt Nam', '2024-12-06T16:00:00', 16.50, 16.50, 16.40, 99.37, 0.20, 96.80, '[rain]', 0.00, 0.00, 4.70, 2.50, 105.90, 1013, 100, 2.3, 8, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 17, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (498, 'Hà Giang, Việt Nam', '2024-12-06T17:00:00', 16.40, 16.40, 16.30, 99.37, 0.10, 96.80, '[rain]', 0.00, 0.00, 3.20, 1.40, 97.10, 1013, 100, 1.4, 2, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 18, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (499, 'Hà Giang, Việt Nam', '2024-12-06T18:00:00', 16.40, 16.40, 16.30, 99.37, 0.20, 96.80, '[rain]', 0.00, 0.00, 2.90, 1.40, 102.80, 1014, 100, 2.4, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 19, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (500, 'Hà Giang, Việt Nam', '2024-12-06T19:00:00', 16.40, 16.40, 16.30, 99.37, 0.50, 96.80, '[rain]', 0.00, 0.00, 3.20, 1.80, 117.90, 1014, 100, 1.3, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 20, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (501, 'Hà Giang, Việt Nam', '2024-12-06T20:00:00', 16.40, 16.40, 16.40, 100.00, 0.70, 100.00, '[rain]', 0.00, 0.00, 3.60, 1.80, 114.60, 1015, 100, 0.5, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 21, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (502, 'Hà Giang, Việt Nam', '2024-12-06T21:00:00', 16.40, 16.40, 16.40, 100.00, 0.80, 100.00, '[rain]', 0.00, 0.00, 3.60, 1.80, 97.10, 1015, 100, 0.5, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 22, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (503, 'Hà Giang, Việt Nam', '2024-12-06T22:00:00', 16.40, 16.40, 16.30, 99.37, 1.50, 100.00, '[rain]', 0.00, 0.00, 4.70, 2.50, 105.30, 1016, 100, 0.5, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 23, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (504, 'Hà Giang, Việt Nam', '2024-12-06T23:00:00', 16.30, 16.30, 16.30, 100.00, 1.40, 100.00, '[rain]', 0.00, 0.00, 4.30, 2.50, 84.70, 1016, 100, 0.8, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 21, 'VN481', 7280, 24, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (505, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T00:00:00', 22.40, 22.40, 18.90, 80.60, 0.00, 0.00, 'None', 0.00, 0.00, 22.70, 11.20, 135.70, 1014, 90.7, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 22, 'VN505', 7280, 1, 1, 2, 2, 1, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (506, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T01:00:00', 22.20, 22.20, 18.90, 81.58, 0.10, 0.00, '[rain]', 0.00, 0.00, 21.20, 10.10, 131.00, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 22, 'VN505', 7280, 2, 1, 1, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (507, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T02:00:00', 22.10, 22.10, 18.90, 82.08, 0.00, 64.50, '[rain]', 0.00, 0.00, 21.60, 10.10, 119.00, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 22, 'VN505', 7280, 3, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (508, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T03:00:00', 22.00, 22.00, 18.80, 82.07, 0.20, 64.50, '[rain]', 0.00, 0.00, 23.40, 10.80, 107.10, 1013, 100, 23.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 22, 'VN505', 7280, 4, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (509, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T04:00:00', 21.90, 21.90, 18.60, 81.55, 0.10, 64.50, '[rain]', 0.00, 0.00, 23.40, 11.50, 99.00, 1013, 100, 24, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 22, 'VN505', 7280, 5, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (510, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T05:00:00', 21.70, 21.70, 18.30, 81.01, 0.20, 64.50, '[rain]', 0.00, 0.00, 25.60, 11.90, 105.10, 1013, 100, 23.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 22, 'VN505', 7280, 6, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (511, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T06:00:00', 21.50, 21.50, 18.10, 80.99, 0.20, 64.50, '[rain]', 0.00, 0.00, 23.80, 10.10, 95.60, 1014, 100, 20.2, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 22, 'VN505', 7280, 7, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (512, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T07:00:00', 21.30, 21.30, 18.00, 81.47, 0.30, 64.50, '[rain]', 0.00, 0.00, 25.90, 11.20, 91.30, 1014, 100, 22, 1, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 22, 'VN505', 7280, 8, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (513, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T08:00:00', 21.40, 21.40, 18.10, 81.48, 0.20, 32.30, '[rain]', 0.00, 0.00, 26.30, 8.60, 93.80, 1015, 100, 16.6, 9, 0, 0, 10, 'Overcast', 'cloudy', 'None', 22, 'VN505', 7280, 9, 1, 1, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (514, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T09:00:00', 21.30, 21.30, 18.30, 83.02, 0.30, 32.30, '[rain]', 0.00, 0.00, 27.00, 9.70, 91.10, 1016, 100, 23.6, 11, 0, 0, 10, 'Overcast', 'cloudy', 'None', 22, 'VN505', 7280, 10, 1, 1, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (515, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T10:00:00', 21.40, 21.40, 18.50, 83.55, 0.40, 32.30, '[rain]', 0.00, 0.00, 26.60, 11.50, 89.50, 1016, 100, 21.7, 22, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 22, 'VN505', 7280, 11, 1, 1, 2, 3, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (516, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T11:00:00', 21.60, 21.60, 18.70, 83.58, 0.10, 32.30, '[rain]', 0.00, 0.00, 28.40, 12.20, 92.60, 1015, 100, 24, 30, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 22, 'VN505', 7280, 12, 1, 1, 2, 2, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (517, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T12:00:00', 22.10, 22.10, 18.80, 81.57, 0.10, 32.30, '[rain]', 0.00, 0.00, 24.50, 11.90, 92.50, 1014, 100, 22.3, 61, 0.2, 1, 10, 'Overcast', 'cloudy', 'None', 22, 'VN505', 7280, 13, 1, 1, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (518, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T13:00:00', 22.40, 22.40, 18.80, 80.09, 0.10, 32.30, '[rain]', 0.00, 0.00, 24.50, 12.60, 93.40, 1012, 100, 24.1, 49, 0.2, 0, 10, 'Overcast', 'cloudy', 'None', 22, 'VN505', 7280, 14, 1, 1, 2, 2, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (519, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T14:00:00', 22.80, 22.80, 18.80, 78.17, 0.00, 51.60, '[rain]', 0.00, 0.00, 24.50, 12.20, 102.40, 1011, 99.1, 24.1, 39, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 22, 'VN505', 7280, 15, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (520, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T15:00:00', 23.40, 23.40, 18.80, 75.39, 0.10, 51.60, '[rain]', 0.00, 0.00, 20.90, 11.50, 100.30, 1011, 99.5, 23.2, 61, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 22, 'VN505', 7280, 16, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (521, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T16:00:00', 23.50, 23.50, 18.80, 74.93, 0.10, 51.60, '[rain]', 0.00, 0.00, 20.90, 10.80, 88.00, 1011, 100, 24.1, 46, 0.2, 0, 10, 'Rain, Overcast', 'rain', 'None', 22, 'VN505', 7280, 17, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (522, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T17:00:00', 23.20, 23.20, 18.70, 75.83, 0.10, 51.60, '[rain]', 0.00, 0.00, 20.50, 9.40, 100.20, 1012, 100, 22.7, 7, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 22, 'VN505', 7280, 18, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (523, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T18:00:00', 22.80, 22.80, 18.70, 77.69, 0.30, 51.60, '[rain]', 0.00, 0.00, 21.20, 9.70, 115.80, 1013, 100, 18.8, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 22, 'VN505', 7280, 19, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (524, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T19:00:00', 22.40, 22.40, 18.70, 79.60, 0.40, 51.60, '[rain]', 0.00, 0.00, 25.20, 10.80, 114.30, 1013, 99.3, 21.3, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 22, 'VN505', 7280, 20, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (525, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T20:00:00', 22.30, 22.30, 18.50, 79.09, 0.20, 29.00, '[rain]', 0.00, 0.00, 25.90, 11.50, 112.20, 1014, 99.9, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 22, 'VN505', 7280, 21, 1, 1, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (526, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T21:00:00', 22.20, 22.20, 18.30, 78.58, 0.00, 29.00, 'None', 0.00, 0.00, 27.70, 11.50, 111.80, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 22, 'VN505', 7280, 22, 1, 2, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (527, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T22:00:00', 22.20, 22.20, 18.20, 78.08, 0.10, 29.00, '[rain]', 0.00, 0.00, 25.60, 10.40, 115.00, 1015, 100, 22.9, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 22, 'VN505', 7280, 23, 1, 1, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (528, 'Quận Hoàn Kiếm, Hà Nội, Việt Nam', '2024-12-06T23:00:00', 22.00, 22.00, 18.10, 78.55, 0.20, 29.00, '[rain]', 0.00, 0.00, 23.80, 10.10, 98.00, 1015, 100, 24, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 22, 'VN505', 7280, 24, 1, 1, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (529, 'Hà Tĩnh, Việt Nam', '2024-12-06T00:00:00', 20.20, 20.20, 19.30, 94.57, 0.00, 58.10, '[rain]', 0.00, 0.00, 4.00, 4.00, 229.00, 1014, 91.3, 23.8, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 23, 'VN529', 7280, 1, 1, 1, 1, 6, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (530, 'Hà Tĩnh, Việt Nam', '2024-12-06T01:00:00', 20.00, 20.00, 19.20, 95.15, 0.10, 58.10, '[rain]', 0.00, 0.00, 4.70, 4.70, 237.50, 1014, 35.9, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 23, 'VN529', 7280, 2, 1, 1, 3, 6, 1, 1, 3, 3, 1, 4);
INSERT INTO `staging` VALUES (531, 'Hà Tĩnh, Việt Nam', '2024-12-06T02:00:00', 19.80, 19.80, 19.10, 95.74, 0.00, 80.60, '[rain]', 0.00, 0.00, 5.40, 5.40, 240.90, 1013, 82.3, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 23, 'VN529', 7280, 3, 1, 1, 3, 6, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (532, 'Hà Tĩnh, Việt Nam', '2024-12-06T03:00:00', 19.70, 19.70, 19.00, 95.74, 0.00, 80.60, '[rain]', 0.00, 0.00, 5.00, 5.00, 242.70, 1013, 9.8, 24.1, 0, 0, 0, 10, 'Rain', 'rain', 'None', 23, 'VN529', 7280, 4, 1, 1, 4, 6, 1, 1, 3, 2, 1, 5);
INSERT INTO `staging` VALUES (533, 'Hà Tĩnh, Việt Nam', '2024-12-06T04:00:00', 19.60, 19.60, 18.90, 95.73, 0.00, 80.60, '[rain]', 0.00, 0.00, 4.30, 4.30, 233.80, 1013, 7.7, 24.1, 0, 0, 0, 10, 'Rain', 'rain', 'None', 23, 'VN529', 7280, 5, 1, 1, 4, 6, 1, 1, 3, 3, 1, 5);
INSERT INTO `staging` VALUES (534, 'Hà Tĩnh, Việt Nam', '2024-12-06T05:00:00', 19.50, 19.50, 18.70, 95.13, 0.00, 80.60, '[rain]', 0.00, 0.00, 4.00, 4.30, 223.80, 1013, 19.5, 24.1, 0, 0, 0, 10, 'Rain', 'rain', 'None', 23, 'VN529', 7280, 6, 1, 1, 4, 8, 1, 1, 3, 3, 1, 5);
INSERT INTO `staging` VALUES (535, 'Hà Tĩnh, Việt Nam', '2024-12-06T06:00:00', 19.50, 19.50, 18.70, 95.13, 0.00, 80.60, '[rain]', 0.00, 0.00, 4.70, 4.70, 237.50, 1013, 58.5, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 23, 'VN529', 7280, 7, 1, 1, 3, 6, 1, 1, 3, 3, 1, 3);
INSERT INTO `staging` VALUES (536, 'Hà Tĩnh, Việt Nam', '2024-12-06T07:00:00', 20.40, 20.40, 19.10, 92.25, 0.00, 80.60, '[rain]', 0.00, 0.00, 5.00, 4.00, 254.80, 1014, 97.9, 24.1, 19, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 23, 'VN529', 7280, 8, 1, 1, 1, 6, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (537, 'Hà Tĩnh, Việt Nam', '2024-12-06T08:00:00', 21.10, 21.10, 19.30, 89.47, 0.00, 80.60, '[rain]', 0.00, 0.00, 3.20, 2.50, 255.30, 1015, 100, 24.1, 53, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 23, 'VN529', 7280, 9, 1, 1, 1, 6, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (538, 'Hà Tĩnh, Việt Nam', '2024-12-06T09:00:00', 21.60, 21.60, 19.40, 87.31, 0.00, 80.60, '[rain]', 0.00, 0.00, 4.00, 3.20, 283.60, 1015, 100, 24.1, 77, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 23, 'VN529', 7280, 10, 1, 1, 1, 7, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (539, 'Hà Tĩnh, Việt Nam', '2024-12-06T10:00:00', 21.60, 21.60, 19.70, 88.95, 0.10, 80.60, '[rain]', 0.00, 0.00, 4.70, 3.60, 266.30, 1015, 100, 24.1, 81, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 23, 'VN529', 7280, 11, 1, 1, 1, 6, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (540, 'Hà Tĩnh, Việt Nam', '2024-12-06T11:00:00', 21.50, 21.50, 19.80, 90.05, 0.10, 80.60, '[rain]', 0.00, 0.00, 2.90, 2.20, 236.90, 1014, 100, 24.1, 71, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 23, 'VN529', 7280, 12, 1, 1, 1, 6, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (541, 'Hà Tĩnh, Việt Nam', '2024-12-06T12:00:00', 21.40, 21.40, 20.00, 91.74, 0.10, 80.60, '[rain]', 0.00, 0.00, 1.40, 1.40, 143.90, 1013, 100, 24.1, 58, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 23, 'VN529', 7280, 13, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (542, 'Hà Tĩnh, Việt Nam', '2024-12-06T13:00:00', 21.30, 21.30, 20.00, 92.30, 0.10, 80.60, '[rain]', 0.00, 0.00, 2.20, 1.80, 148.30, 1012, 100, 24.1, 45, 0.2, 0, 10, 'Rain, Overcast', 'rain', 'None', 23, 'VN529', 7280, 14, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (543, 'Hà Tĩnh, Việt Nam', '2024-12-06T14:00:00', 21.30, 21.30, 20.10, 92.87, 0.10, 22.60, '[rain]', 0.00, 0.00, 2.50, 1.80, 152.60, 1011, 98.5, 24.1, 41, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 23, 'VN529', 7280, 15, 1, 1, 2, 1, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (544, 'Hà Tĩnh, Việt Nam', '2024-12-06T15:00:00', 21.60, 21.60, 20.10, 91.18, 0.00, 22.60, 'None', 0.00, 0.00, 2.90, 1.80, 167.20, 1011, 87.3, 24.1, 70, 0.3, 1, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 23, 'VN529', 7280, 16, 1, 2, 6, 1, 5, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (545, 'Hà Tĩnh, Việt Nam', '2024-12-06T16:00:00', 21.90, 21.90, 20.30, 90.64, 0.00, 22.60, 'None', 0.00, 0.00, 2.20, 0.70, 188.00, 1011, 91.4, 24.1, 99, 0.4, 1, 10, 'Overcast', 'cloudy', 'None', 23, 'VN529', 7280, 17, 1, 2, 2, 8, 2, 1, 3, 4, 1, 1);
INSERT INTO `staging` VALUES (546, 'Hà Tĩnh, Việt Nam', '2024-12-06T17:00:00', 21.70, 21.70, 20.30, 91.75, 0.00, 22.60, 'None', 0.00, 0.00, 1.40, 0.40, 230.80, 1012, 95.2, 24.1, 35, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 23, 'VN529', 7280, 18, 1, 2, 2, 6, 2, 1, 3, 4, 1, 1);
INSERT INTO `staging` VALUES (547, 'Hà Tĩnh, Việt Nam', '2024-12-06T18:00:00', 21.60, 21.60, 20.20, 91.75, 0.00, 22.60, 'None', 0.00, 0.00, 2.20, 1.10, 208.60, 1012, 91.8, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 23, 'VN529', 7280, 19, 1, 2, 2, 8, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (548, 'Hà Tĩnh, Việt Nam', '2024-12-06T19:00:00', 21.60, 21.60, 20.20, 91.75, 0.10, 22.60, '[rain]', 0.00, 0.00, 4.70, 2.90, 178.30, 1013, 75.8, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 23, 'VN529', 7280, 20, 1, 1, 6, 1, 4, 1, 3, 3, 1, 6);
INSERT INTO `staging` VALUES (549, 'Hà Tĩnh, Việt Nam', '2024-12-06T20:00:00', 21.30, 21.30, 20.10, 92.87, 0.00, 51.60, '[rain]', 0.00, 0.00, 6.80, 5.00, 175.00, 1014, 59.1, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 23, 'VN529', 7280, 21, 1, 1, 3, 1, 1, 1, 3, 2, 1, 3);
INSERT INTO `staging` VALUES (550, 'Hà Tĩnh, Việt Nam', '2024-12-06T21:00:00', 21.00, 21.00, 20.00, 94.02, 0.00, 51.60, '[rain]', 0.00, 0.00, 5.00, 3.60, 182.50, 1014, 22, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 23, 'VN529', 7280, 22, 1, 1, 3, 8, 1, 1, 3, 3, 1, 4);
INSERT INTO `staging` VALUES (551, 'Hà Tĩnh, Việt Nam', '2024-12-06T22:00:00', 20.60, 20.60, 19.80, 95.17, 0.00, 51.60, '[rain]', 0.00, 0.00, 4.00, 2.90, 195.00, 1014, 29.4, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 23, 'VN529', 7280, 23, 1, 1, 3, 8, 1, 1, 3, 3, 1, 4);
INSERT INTO `staging` VALUES (552, 'Hà Tĩnh, Việt Nam', '2024-12-06T23:00:00', 20.50, 20.50, 19.70, 95.17, 0.10, 51.60, '[rain]', 0.00, 0.00, 3.60, 2.20, 208.00, 1014, 21.1, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 23, 'VN529', 7280, 24, 1, 1, 3, 8, 1, 1, 3, 3, 1, 4);
INSERT INTO `staging` VALUES (553, 'Hải Dương, Việt Nam', '2024-12-06T00:00:00', 21.30, 21.30, 17.80, 80.45, 0.00, 0.00, 'None', 0.00, 0.00, 28.80, 12.20, 117.50, 1014, 99.8, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 1, 1, 2, 2, 2, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (554, 'Hải Dương, Việt Nam', '2024-12-06T01:00:00', 21.50, 21.50, 17.40, 77.49, 0.00, 0.00, 'None', 0.00, 0.00, 29.90, 11.90, 113.90, 1014, 95.4, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 2, 1, 2, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (555, 'Hải Dương, Việt Nam', '2024-12-06T02:00:00', 21.50, 21.50, 17.20, 76.52, 0.00, 12.90, 'None', 0.00, 0.00, 27.40, 8.60, 113.90, 1013, 96.8, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 3, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (556, 'Hải Dương, Việt Nam', '2024-12-06T03:00:00', 21.30, 21.30, 17.00, 76.49, 0.00, 12.90, 'None', 0.00, 0.00, 28.10, 9.40, 113.90, 1013, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 4, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (557, 'Hải Dương, Việt Nam', '2024-12-06T04:00:00', 21.30, 21.30, 17.10, 76.97, 0.00, 12.90, 'None', 0.00, 0.00, 25.90, 8.30, 103.70, 1013, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 5, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (558, 'Hải Dương, Việt Nam', '2024-12-06T05:00:00', 21.10, 21.10, 17.10, 77.92, 0.10, 12.90, '[rain]', 0.00, 0.00, 28.40, 9.00, 89.50, 1013, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 6, 1, 1, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (559, 'Hải Dương, Việt Nam', '2024-12-06T06:00:00', 21.10, 21.10, 17.10, 77.92, 0.00, 12.90, '[rain]', 0.00, 0.00, 31.00, 9.70, 79.20, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 7, 1, 1, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (560, 'Hải Dương, Việt Nam', '2024-12-06T07:00:00', 21.20, 21.20, 17.10, 77.45, 0.10, 12.90, '[rain]', 0.00, 0.00, 33.50, 10.80, 82.50, 1015, 100, 24.1, 3, 0, 0, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 8, 1, 1, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (561, 'Hải Dương, Việt Nam', '2024-12-06T08:00:00', 21.40, 21.40, 17.30, 77.48, 0.10, 0.00, '[rain]', 0.00, 0.00, 36.00, 14.40, 90.50, 1015, 100, 24.1, 12, 0, 0, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 9, 1, 1, 2, 2, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (562, 'Hải Dương, Việt Nam', '2024-12-06T09:00:00', 21.70, 21.70, 17.90, 79.00, 0.00, 0.00, 'None', 0.00, 0.00, 33.80, 13.70, 99.40, 1016, 100, 24.1, 28, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 10, 1, 2, 2, 2, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (563, 'Hải Dương, Việt Nam', '2024-12-06T10:00:00', 21.90, 21.90, 18.30, 80.03, 0.00, 0.00, 'None', 0.00, 0.00, 32.00, 15.10, 94.80, 1016, 100, 24.1, 29, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 11, 1, 2, 2, 2, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (564, 'Hải Dương, Việt Nam', '2024-12-06T11:00:00', 22.70, 22.70, 18.40, 76.70, 0.10, 0.00, '[rain]', 0.00, 0.00, 29.90, 18.40, 93.20, 1015, 100, 24.1, 76, 0.3, 1, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 12, 1, 1, 2, 2, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (565, 'Hải Dương, Việt Nam', '2024-12-06T12:00:00', 22.50, 22.50, 18.50, 78.13, 0.00, 0.00, 'None', 0.00, 0.00, 33.50, 19.10, 104.60, 1014, 100, 24.1, 57, 0.2, 1, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 13, 1, 2, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (566, 'Hải Dương, Việt Nam', '2024-12-06T13:00:00', 23.20, 23.20, 18.50, 74.88, 0.00, 0.00, 'None', 0.00, 0.00, 32.00, 22.70, 109.20, 1013, 99, 24.1, 102, 0.4, 1, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 14, 1, 2, 2, 2, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (567, 'Hải Dương, Việt Nam', '2024-12-06T14:00:00', 23.10, 23.10, 18.40, 74.87, 0.00, 3.20, 'None', 0.00, 0.00, 31.00, 24.50, 108.90, 1012, 90.4, 24.1, 132, 0.5, 1, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 15, 1, 2, 2, 2, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (568, 'Hải Dương, Việt Nam', '2024-12-06T15:00:00', 24.20, 24.20, 18.20, 69.19, 0.00, 3.20, 'None', 0.00, 0.00, 27.00, 22.70, 107.30, 1011, 94.2, 24.1, 187, 0.7, 2, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 16, 1, 2, 2, 2, 2, 1, 2, 7, 1, 1);
INSERT INTO `staging` VALUES (569, 'Hải Dương, Việt Nam', '2024-12-06T16:00:00', 24.20, 24.20, 18.10, 68.76, 0.10, 3.20, '[rain]', 0.00, 0.00, 26.60, 22.30, 110.70, 1012, 87, 24.1, 102, 0.4, 1, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 24, 'VN553', 7280, 17, 1, 1, 6, 2, 5, 1, 2, 7, 1, 1);
INSERT INTO `staging` VALUES (570, 'Hải Dương, Việt Nam', '2024-12-06T17:00:00', 23.30, 23.30, 18.10, 72.59, 0.00, 3.20, 'None', 0.00, 0.00, 31.70, 23.40, 111.10, 1012, 62.7, 24.1, 39, 0.1, 0, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 24, 'VN553', 7280, 18, 1, 2, 6, 2, 5, 1, 1, 7, 1, 6);
INSERT INTO `staging` VALUES (571, 'Hải Dương, Việt Nam', '2024-12-06T18:00:00', 22.20, 22.20, 18.10, 77.60, 0.00, 3.20, 'None', 0.00, 0.00, 37.10, 22.00, 110.50, 1013, 86.6, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 24, 'VN553', 7280, 19, 1, 2, 6, 2, 4, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (572, 'Hải Dương, Việt Nam', '2024-12-06T19:00:00', 22.30, 22.30, 17.90, 76.16, 0.00, 3.20, 'None', 0.00, 0.00, 36.70, 20.50, 112.40, 1014, 99.4, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 20, 1, 2, 2, 2, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (573, 'Hải Dương, Việt Nam', '2024-12-06T20:00:00', 22.40, 22.40, 17.40, 73.35, 0.00, 3.20, 'None', 0.00, 0.00, 37.80, 18.70, 114.80, 1014, 98.7, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 21, 1, 2, 2, 2, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (574, 'Hải Dương, Việt Nam', '2024-12-06T21:00:00', 22.40, 22.40, 17.30, 72.89, 0.00, 3.20, 'None', 0.00, 0.00, 39.20, 19.10, 114.80, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 22, 1, 2, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (575, 'Hải Dương, Việt Nam', '2024-12-06T22:00:00', 22.30, 22.30, 17.10, 72.41, 0.00, 3.20, 'None', 0.00, 0.00, 38.50, 19.40, 112.50, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 23, 1, 2, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (576, 'Hải Dương, Việt Nam', '2024-12-06T23:00:00', 22.20, 22.20, 16.60, 70.58, 0.00, 3.20, 'None', 0.00, 0.00, 37.80, 18.70, 109.00, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 24, 'VN553', 7280, 24, 1, 2, 2, 2, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (577, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T00:00:00', 21.30, 21.30, 18.40, 83.54, 0.00, 0.00, 'None', 0.00, 0.00, 27.40, 14.80, 82.20, 1014, 23.3, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 25, 'VN577', 7280, 1, 1, 2, 6, 3, 4, 1, 1, 5, 1, 4);
INSERT INTO `staging` VALUES (578, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T01:00:00', 21.20, 21.20, 18.20, 83.01, 0.00, 0.00, 'None', 0.00, 0.00, 29.90, 16.20, 80.00, 1014, 86.5, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 25, 'VN577', 7280, 2, 1, 2, 6, 3, 4, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (579, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T02:00:00', 21.70, 21.70, 18.40, 81.52, 0.00, 12.90, 'None', 0.00, 0.00, 31.70, 19.10, 83.20, 1013, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 25, 'VN577', 7280, 3, 1, 2, 2, 3, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (580, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T03:00:00', 21.90, 21.90, 18.80, 82.57, 0.00, 12.90, 'None', 0.00, 0.00, 32.00, 19.10, 86.70, 1013, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 25, 'VN577', 7280, 4, 1, 2, 2, 3, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (581, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T04:00:00', 22.20, 22.20, 19.20, 83.13, 0.00, 12.90, 'None', 0.00, 0.00, 31.70, 19.10, 83.60, 1013, 98.1, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 25, 'VN577', 7280, 5, 1, 2, 2, 3, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (582, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T05:00:00', 22.20, 22.20, 19.20, 83.13, 0.10, 12.90, '[rain]', 0.00, 0.00, 32.80, 20.50, 83.30, 1013, 99.4, 24, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 25, 'VN577', 7280, 6, 1, 1, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (583, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T06:00:00', 22.20, 22.20, 19.20, 83.13, 0.10, 12.90, '[rain]', 0.00, 0.00, 33.10, 20.90, 84.80, 1014, 100, 23.6, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 25, 'VN577', 7280, 7, 1, 1, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (584, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T07:00:00', 22.30, 22.30, 19.30, 83.14, 0.20, 12.90, '[rain]', 0.00, 0.00, 33.50, 22.30, 87.70, 1015, 100, 23.4, 3, 0, 0, 10, 'Overcast', 'cloudy', 'None', 25, 'VN577', 7280, 8, 1, 1, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (585, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T08:00:00', 22.50, 22.50, 19.30, 82.13, 0.20, 0.00, '[rain]', 0.00, 0.00, 32.40, 22.00, 86.10, 1015, 100, 20.8, 29, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 25, 'VN577', 7280, 9, 1, 1, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (586, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T09:00:00', 22.60, 22.60, 19.40, 82.14, 0.20, 0.00, '[rain]', 0.00, 0.00, 34.20, 23.40, 87.60, 1016, 93.2, 24.1, 54, 0.2, 1, 10, 'Overcast', 'cloudy', 'None', 25, 'VN577', 7280, 10, 1, 1, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (587, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T10:00:00', 22.90, 22.90, 19.40, 80.66, 0.10, 0.00, '[rain]', 0.00, 0.00, 33.10, 23.80, 86.40, 1016, 100, 21.4, 122, 0.4, 1, 10, 'Overcast', 'cloudy', 'None', 25, 'VN577', 7280, 11, 1, 1, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (588, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T11:00:00', 23.10, 23.10, 19.30, 79.20, 0.20, 0.00, '[rain]', 0.00, 0.00, 32.40, 24.10, 90.40, 1015, 100, 23, 122, 0.4, 1, 10, 'Overcast', 'cloudy', 'None', 25, 'VN577', 7280, 12, 1, 1, 2, 2, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (589, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T12:00:00', 22.90, 22.90, 19.30, 80.16, 0.10, 0.00, '[rain]', 0.00, 0.00, 32.40, 24.10, 91.10, 1014, 100, 24, 110, 0.4, 1, 10, 'Overcast', 'cloudy', 'None', 25, 'VN577', 7280, 13, 1, 1, 2, 2, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (590, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T13:00:00', 22.80, 22.80, 19.20, 80.15, 0.10, 0.00, '[rain]', 0.00, 0.00, 32.00, 24.10, 89.90, 1013, 87.2, 24.1, 88, 0.3, 1, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 25, 'VN577', 7280, 14, 1, 1, 6, 3, 5, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (591, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T14:00:00', 23.20, 23.20, 19.00, 77.26, 0.00, 3.20, 'None', 0.00, 0.00, 31.70, 26.30, 92.10, 1012, 28.8, 24.1, 258, 0.9, 3, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 25, 'VN577', 7280, 15, 1, 2, 6, 2, 5, 1, 1, 7, 2, 4);
INSERT INTO `staging` VALUES (592, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T15:00:00', 23.90, 23.90, 18.80, 73.15, 0.00, 3.20, '[rain]', 0.00, 0.00, 28.80, 27.00, 95.60, 1012, 52.8, 24.1, 440, 1.6, 4, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 25, 'VN577', 7280, 16, 1, 1, 6, 2, 5, 1, 1, 7, 2, 3);
INSERT INTO `staging` VALUES (593, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T16:00:00', 23.40, 23.40, 18.80, 75.39, 0.00, 3.20, '[rain]', 0.00, 0.00, 28.40, 24.80, 93.40, 1012, 60.9, 24.1, 218, 0.8, 2, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 25, 'VN577', 7280, 17, 1, 1, 6, 2, 5, 1, 1, 7, 1, 2);
INSERT INTO `staging` VALUES (594, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T17:00:00', 22.60, 22.60, 18.80, 79.13, 0.00, 3.20, 'None', 0.00, 0.00, 29.90, 23.40, 87.40, 1013, 53.6, 24.1, 59, 0.2, 1, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 25, 'VN577', 7280, 18, 1, 2, 6, 3, 5, 1, 1, 7, 1, 3);
INSERT INTO `staging` VALUES (595, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T18:00:00', 22.20, 22.20, 18.60, 80.07, 0.00, 3.20, 'None', 0.00, 0.00, 32.80, 22.70, 83.30, 1013, 90, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 25, 'VN577', 7280, 19, 1, 2, 6, 3, 4, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (596, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T19:00:00', 22.20, 22.20, 18.70, 80.57, 0.00, 3.20, 'None', 0.00, 0.00, 34.90, 21.60, 83.50, 1014, 99.6, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 25, 'VN577', 7280, 20, 1, 2, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (597, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T20:00:00', 22.30, 22.30, 18.50, 79.09, 0.00, 3.20, 'None', 0.00, 0.00, 36.70, 21.60, 84.60, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 25, 'VN577', 7280, 21, 1, 2, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (598, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T21:00:00', 22.40, 22.40, 18.10, 76.66, 0.00, 3.20, '[rain]', 0.00, 0.00, 38.20, 23.40, 84.40, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 25, 'VN577', 7280, 22, 1, 1, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (599, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T22:00:00', 22.30, 22.30, 17.30, 73.33, 0.10, 3.20, '[rain]', 0.00, 0.00, 39.60, 27.70, 82.80, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 25, 'VN577', 7280, 23, 1, 1, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (600, 'Quận Ngô Quyền, Hải Phòng, Việt Nam', '2024-12-06T23:00:00', 21.80, 21.80, 17.20, 75.13, 0.00, 3.20, 'None', 0.00, 0.00, 42.50, 29.50, 81.30, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 25, 'VN577', 7280, 24, 1, 2, 2, 3, 2, 1, 1, 6, 1, 1);
INSERT INTO `staging` VALUES (601, 'Hậu Giang, Việt Nam', '2024-12-06T00:00:00', 24.80, 24.80, 22.90, 89.20, 0.00, 61.30, '[rain]', 0.00, 0.00, 42.10, 11.50, 86.30, 1009, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 26, 'VN601', 7280, 1, 1, 1, 1, 3, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (602, 'Hậu Giang, Việt Nam', '2024-12-06T01:00:00', 24.70, 24.70, 22.80, 89.19, 0.00, 61.30, '[rain]', 0.00, 0.00, 40.70, 9.70, 85.50, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 26, 'VN601', 7280, 2, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (603, 'Hậu Giang, Việt Nam', '2024-12-06T02:00:00', 24.40, 24.40, 22.60, 89.71, 0.00, 6.50, 'None', 0.00, 0.00, 29.50, 8.30, 91.80, 1007, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 26, 'VN601', 7280, 3, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (604, 'Hậu Giang, Việt Nam', '2024-12-06T03:00:00', 24.40, 24.40, 22.60, 89.71, 0.00, 6.50, 'None', 0.00, 0.00, 27.40, 7.60, 93.40, 1007, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 26, 'VN601', 7280, 4, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (605, 'Hậu Giang, Việt Nam', '2024-12-06T04:00:00', 24.30, 24.30, 22.60, 90.25, 0.00, 6.50, 'None', 0.00, 0.00, 29.90, 7.60, 88.50, 1007, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 26, 'VN601', 7280, 5, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (606, 'Hậu Giang, Việt Nam', '2024-12-06T05:00:00', 24.00, 24.00, 22.40, 90.78, 0.00, 6.50, 'None', 0.00, 0.00, 28.80, 8.30, 84.80, 1007, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 26, 'VN601', 7280, 6, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (607, 'Hậu Giang, Việt Nam', '2024-12-06T06:00:00', 23.60, 23.60, 22.30, 92.43, 0.00, 6.50, 'None', 0.00, 0.00, 17.30, 8.30, 77.50, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 26, 'VN601', 7280, 7, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (608, 'Hậu Giang, Việt Nam', '2024-12-06T07:00:00', 24.50, 24.50, 23.00, 91.36, 0.00, 6.50, 'None', 0.00, 0.00, 32.40, 7.60, 64.70, 1008, 100, 24.1, 48, 0.2, 0, 3, 'Overcast', 'cloudy', 'None', 26, 'VN601', 7280, 8, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (609, 'Hậu Giang, Việt Nam', '2024-12-06T08:00:00', 26.30, 26.30, 23.60, 85.12, 0.00, 83.90, '[rain]', 0.00, 0.00, 28.40, 14.00, 72.90, 1009, 89.1, 24.1, 248, 0.9, 2, 10, 'Rain, Partially cloudy', 'rain', 'None', 26, 'VN601', 7280, 9, 1, 1, 3, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (610, 'Hậu Giang, Việt Nam', '2024-12-06T09:00:00', 27.80, 31.50, 24.10, 80.32, 0.00, 83.90, '[rain]', 0.00, 0.00, 20.50, 14.80, 69.30, 1010, 99.7, 23.8, 483, 1.7, 5, 10, 'Rain, Overcast', 'rain', 'None', 26, 'VN601', 7280, 10, 1, 1, 1, 3, 1, 1, 1, 5, 2, 1);
INSERT INTO `staging` VALUES (611, 'Hậu Giang, Việt Nam', '2024-12-06T10:00:00', 29.00, 33.70, 24.30, 75.81, 0.60, 83.90, '[rain]', 0.00, 0.00, 19.80, 14.00, 62.20, 1010, 99.5, 10.2, 663, 2.4, 7, 30, 'Rain, Overcast', 'rain', 'None', 26, 'VN601', 7280, 11, 1, 1, 1, 3, 1, 1, 1, 5, 3, 1);
INSERT INTO `staging` VALUES (612, 'Hậu Giang, Việt Nam', '2024-12-06T11:00:00', 30.00, 35.10, 24.10, 70.71, 0.90, 83.90, '[rain]', 0.00, 0.00, 22.30, 15.50, 59.40, 1009, 100, 24.1, 787, 2.8, 8, 30, 'Rain, Overcast', 'rain', 'None', 26, 'VN601', 7280, 12, 1, 1, 1, 3, 1, 1, 1, 5, 4, 1);
INSERT INTO `staging` VALUES (613, 'Hậu Giang, Việt Nam', '2024-12-06T12:00:00', 30.00, 35.10, 24.10, 70.71, 0.90, 83.90, '[rain]', 0.00, 0.00, 21.60, 16.20, 62.00, 1008, 99, 12.5, 728, 2.6, 7, 30, 'Rain, Overcast', 'rain', 'None', 26, 'VN601', 7280, 13, 1, 1, 1, 3, 1, 1, 1, 5, 3, 1);
INSERT INTO `staging` VALUES (614, 'Hậu Giang, Việt Nam', '2024-12-06T13:00:00', 29.60, 34.70, 24.30, 73.23, 1.20, 83.90, '[rain]', 0.00, 0.00, 22.30, 15.80, 63.70, 1007, 95.2, 7.9, 590, 2.1, 6, 30, 'Rain, Overcast', 'rain', 'None', 26, 'VN601', 7280, 14, 1, 1, 1, 3, 1, 1, 1, 5, 3, 1);
INSERT INTO `staging` VALUES (615, 'Hậu Giang, Việt Nam', '2024-12-06T14:00:00', 29.60, 34.60, 24.20, 72.79, 0.90, 90.30, '[rain]', 0.00, 0.00, 23.00, 15.50, 63.70, 1006, 62.7, 17.3, 550, 2, 6, 30, 'Rain, Partially cloudy', 'rain', 'None', 26, 'VN601', 7280, 15, 1, 1, 3, 3, 1, 1, 1, 5, 3, 6);
INSERT INTO `staging` VALUES (616, 'Hậu Giang, Việt Nam', '2024-12-06T15:00:00', 29.30, 34.20, 24.30, 74.51, 1.10, 90.30, '[rain]', 0.00, 0.00, 23.80, 15.10, 69.10, 1006, 56.7, 8.4, 462, 1.7, 5, 30, 'Rain, Partially cloudy', 'rain', 'None', 26, 'VN601', 7280, 16, 1, 1, 3, 3, 1, 1, 1, 5, 2, 3);
INSERT INTO `staging` VALUES (617, 'Hậu Giang, Việt Nam', '2024-12-06T16:00:00', 28.80, 33.60, 24.50, 77.62, 1.00, 90.30, '[rain]', 0.00, 0.00, 25.20, 14.80, 79.80, 1006, 81.9, 9.4, 336, 1.2, 3, 30, 'Rain, Partially cloudy', 'rain', 'None', 26, 'VN601', 7280, 17, 1, 1, 3, 3, 1, 1, 1, 5, 2, 1);
INSERT INTO `staging` VALUES (618, 'Hậu Giang, Việt Nam', '2024-12-06T17:00:00', 27.20, 30.40, 24.10, 83.19, 0.90, 90.30, '[rain]', 0.00, 0.00, 25.60, 12.60, 88.10, 1006, 100, 12.7, 155, 0.6, 2, 30, 'Rain, Overcast', 'rain', 'None', 26, 'VN601', 7280, 18, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (619, 'Hậu Giang, Việt Nam', '2024-12-06T18:00:00', 25.90, 25.90, 23.60, 87.16, 0.20, 90.30, '[rain]', 0.00, 0.00, 22.00, 10.80, 103.90, 1007, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 26, 'VN601', 7280, 19, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (620, 'Hậu Giang, Việt Nam', '2024-12-06T19:00:00', 25.30, 25.30, 23.50, 89.78, 0.10, 90.30, '[rain]', 0.00, 0.00, 26.60, 10.40, 102.30, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 26, 'VN601', 7280, 20, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (621, 'Hậu Giang, Việt Nam', '2024-12-06T20:00:00', 25.00, 25.00, 23.40, 90.85, 0.00, 19.40, 'None', 0.00, 0.00, 32.00, 10.80, 87.90, 1009, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 26, 'VN601', 7280, 21, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (622, 'Hậu Giang, Việt Nam', '2024-12-06T21:00:00', 24.60, 24.60, 23.30, 92.48, 0.00, 19.40, 'None', 0.00, 0.00, 43.20, 10.80, 81.20, 1009, 67.7, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 26, 'VN601', 7280, 22, 1, 2, 6, 3, 4, 1, 3, 1, 1, 6);
INSERT INTO `staging` VALUES (623, 'Hậu Giang, Việt Nam', '2024-12-06T22:00:00', 24.50, 24.50, 23.30, 93.04, 0.00, 19.40, 'None', 0.00, 0.00, 44.60, 10.10, 83.90, 1009, 22.1, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 26, 'VN601', 7280, 23, 1, 2, 6, 3, 4, 1, 3, 1, 1, 4);
INSERT INTO `staging` VALUES (624, 'Hậu Giang, Việt Nam', '2024-12-06T23:00:00', 24.30, 24.30, 23.20, 93.59, 0.00, 19.40, 'None', 0.00, 0.00, 22.30, 8.30, 98.10, 1009, 97.5, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 26, 'VN601', 7280, 24, 1, 2, 2, 2, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (625, 'Hòa Bình, Việt Nam', '2024-12-06T00:00:00', 19.50, 19.50, 17.70, 89.34, 0.00, 0.00, 'None', 0.00, 0.00, 8.60, 4.30, 160.60, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 27, 'VN625', 7280, 1, 1, 2, 2, 1, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (626, 'Hòa Bình, Việt Nam', '2024-12-06T01:00:00', 19.40, 19.40, 17.80, 90.47, 0.00, 0.00, 'None', 0.00, 0.00, 5.80, 3.60, 151.00, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 27, 'VN625', 7280, 2, 1, 2, 2, 1, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (627, 'Hòa Bình, Việt Nam', '2024-12-06T02:00:00', 19.20, 19.20, 18.00, 92.76, 0.10, 100.00, '[rain]', 0.00, 0.00, 5.80, 3.60, 155.80, 1014, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 3, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (628, 'Hòa Bình, Việt Nam', '2024-12-06T03:00:00', 19.30, 19.30, 18.10, 92.77, 0.00, 100.00, '[rain]', 0.00, 0.00, 5.80, 3.20, 151.00, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 4, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (629, 'Hòa Bình, Việt Nam', '2024-12-06T04:00:00', 19.40, 19.40, 18.10, 92.19, 0.10, 100.00, '[rain]', 0.00, 0.00, 4.30, 3.20, 151.40, 1013, 99.9, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 5, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (630, 'Hòa Bình, Việt Nam', '2024-12-06T05:00:00', 19.40, 19.40, 18.00, 91.62, 0.10, 100.00, '[rain]', 0.00, 0.00, 4.70, 3.20, 142.50, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 6, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (631, 'Hòa Bình, Việt Nam', '2024-12-06T06:00:00', 19.30, 19.30, 17.90, 91.61, 0.10, 100.00, '[rain]', 0.00, 0.00, 4.70, 3.60, 138.30, 1014, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 7, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (632, 'Hòa Bình, Việt Nam', '2024-12-06T07:00:00', 19.30, 19.30, 18.00, 92.19, 0.10, 100.00, '[rain]', 0.00, 0.00, 3.60, 2.50, 149.40, 1015, 100, 23.8, 3, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 8, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (633, 'Hòa Bình, Việt Nam', '2024-12-06T08:00:00', 19.80, 19.80, 18.20, 90.50, 0.10, 100.00, '[rain]', 0.00, 0.00, 4.70, 2.50, 135.40, 1015, 99.5, 22.5, 24, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 9, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (634, 'Hòa Bình, Việt Nam', '2024-12-06T09:00:00', 20.20, 20.20, 18.40, 89.40, 0.30, 100.00, '[rain]', 0.00, 0.00, 5.40, 2.90, 115.30, 1016, 96.5, 22.3, 54, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 10, 1, 1, 1, 2, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (635, 'Hòa Bình, Việt Nam', '2024-12-06T10:00:00', 20.80, 20.80, 18.60, 87.23, 0.10, 100.00, '[rain]', 0.00, 0.00, 6.80, 4.30, 99.60, 1016, 100, 21.4, 119, 0.4, 1, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 11, 1, 1, 1, 2, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (636, 'Hòa Bình, Việt Nam', '2024-12-06T11:00:00', 20.20, 20.20, 18.80, 91.66, 0.20, 100.00, '[rain]', 0.00, 0.00, 6.50, 4.00, 81.50, 1015, 100, 22.4, 53, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 12, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (637, 'Hòa Bình, Việt Nam', '2024-12-06T12:00:00', 20.40, 20.40, 18.80, 90.54, 0.20, 100.00, '[rain]', 0.00, 0.00, 6.10, 3.60, 80.30, 1014, 99.1, 22.4, 86, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 13, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (638, 'Hòa Bình, Việt Nam', '2024-12-06T13:00:00', 20.60, 20.60, 18.90, 89.99, 0.20, 100.00, '[rain]', 0.00, 0.00, 6.80, 4.00, 73.80, 1013, 89, 23.3, 113, 0.4, 1, 10, 'Rain, Partially cloudy', 'rain', 'None', 27, 'VN625', 7280, 14, 1, 1, 3, 3, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (639, 'Hòa Bình, Việt Nam', '2024-12-06T14:00:00', 21.30, 21.30, 19.00, 86.74, 0.20, 93.50, '[rain]', 0.00, 0.00, 7.90, 5.40, 67.70, 1012, 99.9, 21.1, 234, 0.8, 2, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 15, 1, 1, 1, 3, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (640, 'Hòa Bình, Việt Nam', '2024-12-06T15:00:00', 20.90, 20.90, 19.20, 90.01, 0.20, 93.50, '[rain]', 0.00, 0.00, 7.60, 5.00, 57.80, 1011, 86.8, 21.8, 119, 0.4, 1, 10, 'Rain, Partially cloudy', 'rain', 'None', 27, 'VN625', 7280, 16, 1, 1, 3, 3, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (641, 'Hòa Bình, Việt Nam', '2024-12-06T16:00:00', 20.80, 20.80, 19.30, 91.13, 0.10, 93.50, '[rain]', 0.00, 0.00, 7.60, 5.00, 50.80, 1012, 99.6, 23.3, 128, 0.5, 1, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 17, 1, 1, 1, 3, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (642, 'Hòa Bình, Việt Nam', '2024-12-06T17:00:00', 20.10, 20.10, 19.20, 94.56, 0.10, 93.50, '[rain]', 0.00, 0.00, 7.20, 5.00, 35.80, 1012, 97.7, 24.1, 40, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 18, 1, 1, 1, 5, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (643, 'Hòa Bình, Việt Nam', '2024-12-06T18:00:00', 19.50, 19.50, 19.00, 96.93, 0.00, 93.50, '[rain]', 0.00, 0.00, 5.00, 4.00, 32.00, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 19, 1, 1, 1, 5, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (644, 'Hòa Bình, Việt Nam', '2024-12-06T19:00:00', 19.50, 19.50, 19.00, 96.93, 0.00, 93.50, '[rain]', 0.00, 0.00, 4.00, 3.20, 54.90, 1014, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 20, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (645, 'Hòa Bình, Việt Nam', '2024-12-06T20:00:00', 19.50, 19.50, 19.10, 97.54, 0.20, 83.90, '[rain]', 0.00, 0.00, 5.80, 2.90, 89.40, 1014, 100, 17.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 21, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (646, 'Hòa Bình, Việt Nam', '2024-12-06T21:00:00', 19.60, 19.60, 19.20, 97.54, 0.60, 83.90, '[rain]', 0.00, 0.00, 8.30, 3.60, 108.00, 1014, 100, 8.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 22, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (647, 'Hòa Bình, Việt Nam', '2024-12-06T22:00:00', 19.50, 19.50, 19.20, 98.15, 0.40, 83.90, '[rain]', 0.00, 0.00, 7.20, 3.60, 75.70, 1015, 100, 10.7, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 23, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (648, 'Hòa Bình, Việt Nam', '2024-12-06T23:00:00', 19.40, 19.40, 19.20, 98.76, 0.60, 83.90, '[rain]', 0.00, 0.00, 6.80, 3.20, 58.20, 1015, 100, 2.2, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 27, 'VN625', 7280, 24, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (649, 'Hưng Yên, Việt Nam', '2024-12-06T00:00:00', 22.00, 22.00, 19.20, 84.14, 0.00, 0.00, 'None', 0.00, 0.00, 24.10, 8.60, 123.00, 1014, 94, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 28, 'VN649', 7280, 1, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (650, 'Hưng Yên, Việt Nam', '2024-12-06T01:00:00', 22.00, 22.00, 19.10, 83.62, 0.00, 0.00, 'None', 0.00, 0.00, 23.80, 7.90, 116.20, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 28, 'VN649', 7280, 2, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (651, 'Hưng Yên, Việt Nam', '2024-12-06T02:00:00', 22.00, 22.00, 19.00, 83.10, 0.00, 96.80, '[rain]', 0.00, 0.00, 23.40, 7.90, 107.80, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 3, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (652, 'Hưng Yên, Việt Nam', '2024-12-06T03:00:00', 21.90, 21.90, 18.90, 83.09, 0.00, 96.80, '[rain]', 0.00, 0.00, 24.10, 9.00, 94.40, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 4, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (653, 'Hưng Yên, Việt Nam', '2024-12-06T04:00:00', 21.80, 21.80, 18.80, 83.08, 0.20, 96.80, '[rain]', 0.00, 0.00, 26.30, 10.10, 91.40, 1013, 100, 23.8, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 5, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (654, 'Hưng Yên, Việt Nam', '2024-12-06T05:00:00', 21.60, 21.60, 18.80, 84.10, 0.10, 96.80, '[rain]', 0.00, 0.00, 28.80, 10.80, 90.40, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 6, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (655, 'Hưng Yên, Việt Nam', '2024-12-06T06:00:00', 21.60, 21.60, 18.90, 84.63, 0.20, 96.80, '[rain]', 0.00, 0.00, 30.20, 10.40, 88.20, 1014, 100, 22.5, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 7, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (656, 'Hưng Yên, Việt Nam', '2024-12-06T07:00:00', 21.70, 21.70, 19.20, 85.70, 0.20, 96.80, '[rain]', 0.00, 0.00, 29.90, 10.40, 83.80, 1014, 100, 17.7, 3, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 8, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (657, 'Hưng Yên, Việt Nam', '2024-12-06T08:00:00', 21.90, 21.90, 19.20, 84.66, 0.30, 77.40, '[rain]', 0.00, 0.00, 31.30, 12.20, 88.30, 1015, 100, 22.7, 12, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 9, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (658, 'Hưng Yên, Việt Nam', '2024-12-06T09:00:00', 22.40, 22.40, 19.20, 82.12, 0.20, 77.40, '[rain]', 0.00, 0.00, 30.60, 13.00, 88.90, 1015, 100, 24.1, 39, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 10, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (659, 'Hưng Yên, Việt Nam', '2024-12-06T10:00:00', 22.90, 22.90, 19.20, 79.66, 0.10, 77.40, '[rain]', 0.00, 0.00, 26.60, 12.60, 88.10, 1015, 100, 22.6, 59, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 11, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (660, 'Hưng Yên, Việt Nam', '2024-12-06T11:00:00', 23.30, 23.30, 19.10, 77.28, 0.20, 77.40, '[rain]', 0.00, 0.00, 24.50, 11.90, 91.50, 1014, 100, 19.4, 56, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 12, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (661, 'Hưng Yên, Việt Nam', '2024-12-06T12:00:00', 23.80, 23.80, 19.10, 74.98, 0.30, 77.40, '[rain]', 0.00, 0.00, 23.40, 14.00, 98.40, 1013, 100, 19.7, 90, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 13, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (662, 'Hưng Yên, Việt Nam', '2024-12-06T13:00:00', 23.60, 23.60, 19.00, 75.42, 0.20, 77.40, '[rain]', 0.00, 0.00, 23.80, 14.80, 98.40, 1012, 98.3, 22.8, 80, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 14, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (663, 'Hưng Yên, Việt Nam', '2024-12-06T14:00:00', 24.40, 24.40, 18.90, 71.43, 0.20, 45.20, '[rain]', 0.00, 0.00, 22.70, 15.10, 103.60, 1011, 98.8, 23.6, 135, 0.5, 1, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 15, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (664, 'Hưng Yên, Việt Nam', '2024-12-06T15:00:00', 24.80, 24.80, 18.70, 68.88, 0.10, 45.20, '[rain]', 0.00, 0.00, 22.30, 15.80, 106.70, 1011, 99.3, 24.1, 142, 0.5, 1, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 16, 1, 1, 1, 2, 1, 1, 2, 5, 1, 1);
INSERT INTO `staging` VALUES (665, 'Hưng Yên, Việt Nam', '2024-12-06T16:00:00', 24.30, 24.30, 18.60, 70.52, 0.00, 45.20, '[rain]', 0.00, 0.00, 25.20, 16.60, 111.10, 1011, 95.2, 24.1, 70, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 17, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (666, 'Hưng Yên, Việt Nam', '2024-12-06T17:00:00', 23.60, 23.60, 18.60, 73.56, 0.00, 45.20, '[rain]', 0.00, 0.00, 29.20, 18.40, 109.20, 1012, 95.3, 24.1, 26, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 18, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (667, 'Hưng Yên, Việt Nam', '2024-12-06T18:00:00', 22.80, 22.80, 18.60, 77.20, 0.00, 45.20, '[rain]', 0.00, 0.00, 31.70, 17.60, 105.80, 1013, 71.4, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 28, 'VN649', 7280, 19, 1, 1, 3, 2, 1, 1, 1, 5, 1, 6);
INSERT INTO `staging` VALUES (668, 'Hưng Yên, Việt Nam', '2024-12-06T19:00:00', 22.40, 22.40, 18.60, 79.10, 0.00, 45.20, '[rain]', 0.00, 0.00, 32.80, 17.30, 108.00, 1013, 47.3, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 28, 'VN649', 7280, 20, 1, 1, 3, 2, 1, 1, 1, 5, 1, 3);
INSERT INTO `staging` VALUES (669, 'Hưng Yên, Việt Nam', '2024-12-06T20:00:00', 22.20, 22.20, 18.50, 79.57, 0.00, 51.60, '[rain]', 0.00, 0.00, 34.20, 16.20, 107.20, 1014, 83.9, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 28, 'VN649', 7280, 21, 1, 1, 3, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (670, 'Hưng Yên, Việt Nam', '2024-12-06T21:00:00', 22.40, 22.40, 18.30, 77.63, 0.00, 51.60, '[rain]', 0.00, 0.00, 34.20, 16.20, 108.60, 1014, 99, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 22, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (671, 'Hưng Yên, Việt Nam', '2024-12-06T22:00:00', 22.40, 22.40, 18.40, 78.11, 0.00, 51.60, '[rain]', 0.00, 0.00, 34.20, 16.20, 108.90, 1014, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 23, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (672, 'Hưng Yên, Việt Nam', '2024-12-06T23:00:00', 22.30, 22.30, 18.30, 78.10, 0.00, 51.60, '[rain]', 0.00, 0.00, 35.30, 16.60, 108.60, 1015, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 28, 'VN649', 7280, 24, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (673, 'Khánh Hòa, Việt Nam', '2024-12-06T00:00:00', 23.80, 23.80, 21.60, 87.50, 0.00, 0.00, 'None', 0.00, 0.00, 19.40, 13.30, 318.30, 1010, 99.3, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 29, 'VN673', 7280, 1, 1, 2, 2, 4, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (674, 'Khánh Hòa, Việt Nam', '2024-12-06T01:00:00', 23.60, 23.60, 21.40, 87.48, 0.00, 0.00, 'None', 0.00, 0.00, 18.40, 13.30, 315.60, 1010, 95.5, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 29, 'VN673', 7280, 2, 1, 2, 2, 4, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (675, 'Khánh Hòa, Việt Nam', '2024-12-06T02:00:00', 23.30, 23.30, 21.20, 88.00, 0.00, 9.70, 'None', 0.00, 0.00, 18.40, 13.00, 315.90, 1009, 97.6, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 29, 'VN673', 7280, 3, 1, 2, 2, 4, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (676, 'Khánh Hòa, Việt Nam', '2024-12-06T03:00:00', 23.10, 23.10, 21.10, 88.52, 0.00, 9.70, 'None', 0.00, 0.00, 17.60, 13.00, 313.80, 1009, 98.7, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 29, 'VN673', 7280, 4, 1, 2, 2, 7, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (677, 'Khánh Hòa, Việt Nam', '2024-12-06T04:00:00', 22.90, 22.90, 21.00, 89.05, 0.00, 9.70, 'None', 0.00, 0.00, 18.40, 13.30, 313.80, 1010, 99.8, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 29, 'VN673', 7280, 5, 1, 2, 2, 7, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (678, 'Khánh Hòa, Việt Nam', '2024-12-06T05:00:00', 22.80, 22.80, 20.90, 89.04, 0.00, 9.70, 'None', 0.00, 0.00, 18.40, 13.30, 315.10, 1010, 84.2, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 29, 'VN673', 7280, 6, 1, 2, 6, 4, 4, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (679, 'Khánh Hòa, Việt Nam', '2024-12-06T06:00:00', 22.80, 22.80, 20.90, 89.04, 0.00, 9.70, 'None', 0.00, 0.00, 18.70, 13.70, 319.00, 1010, 84.2, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 29, 'VN673', 7280, 7, 1, 2, 6, 4, 5, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (680, 'Khánh Hòa, Việt Nam', '2024-12-06T07:00:00', 23.50, 23.50, 21.20, 86.94, 0.00, 9.70, 'None', 0.00, 0.00, 17.30, 12.60, 320.40, 1011, 49.1, 24.1, 71, 0.3, 1, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 29, 'VN673', 7280, 8, 1, 2, 6, 4, 5, 1, 1, 5, 1, 3);
INSERT INTO `staging` VALUES (681, 'Khánh Hòa, Việt Nam', '2024-12-06T08:00:00', 24.80, 24.80, 21.50, 81.91, 0.00, 80.60, '[rain]', 0.00, 0.00, 19.40, 12.60, 327.20, 1011, 63, 24.1, 248, 0.9, 2, 10, 'Rain, Partially cloudy', 'rain', 'None', 29, 'VN673', 7280, 9, 1, 1, 3, 4, 1, 1, 1, 5, 1, 6);
INSERT INTO `staging` VALUES (682, 'Khánh Hòa, Việt Nam', '2024-12-06T09:00:00', 25.60, 25.60, 22.00, 80.52, 0.00, 80.60, '[rain]', 0.00, 0.00, 24.50, 12.20, 334.50, 1012, 90.3, 24.1, 313, 1.1, 3, 10, 'Rain, Overcast', 'rain', 'None', 29, 'VN673', 7280, 10, 1, 1, 1, 4, 1, 1, 1, 5, 2, 1);
INSERT INTO `staging` VALUES (683, 'Khánh Hòa, Việt Nam', '2024-12-06T10:00:00', 25.70, 25.70, 22.40, 82.02, 0.00, 80.60, '[rain]', 0.00, 0.00, 23.00, 12.20, 340.00, 1012, 96, 24.1, 231, 0.8, 2, 10, 'Rain, Overcast', 'rain', 'None', 29, 'VN673', 7280, 11, 1, 1, 1, 4, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (684, 'Khánh Hòa, Việt Nam', '2024-12-06T11:00:00', 25.70, 25.70, 22.40, 82.02, 0.00, 80.60, '[rain]', 0.00, 0.00, 24.50, 13.70, 346.40, 1011, 89.8, 24.1, 245, 0.9, 2, 10, 'Rain, Partially cloudy', 'rain', 'None', 29, 'VN673', 7280, 12, 1, 1, 3, 4, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (685, 'Khánh Hòa, Việt Nam', '2024-12-06T12:00:00', 25.70, 25.70, 22.50, 82.52, 0.00, 80.60, '[rain]', 0.00, 0.00, 26.60, 14.00, 344.30, 1010, 86.3, 24.1, 280, 1, 3, 10, 'Rain, Partially cloudy', 'rain', 'None', 29, 'VN673', 7280, 13, 1, 1, 3, 4, 1, 1, 1, 5, 2, 1);
INSERT INTO `staging` VALUES (686, 'Khánh Hòa, Việt Nam', '2024-12-06T13:00:00', 26.00, 26.00, 22.50, 81.06, 0.00, 80.60, '[rain]', 0.00, 0.00, 29.50, 14.80, 349.10, 1009, 100, 24.1, 323, 1.2, 3, 10, 'Rain, Overcast', 'rain', 'None', 29, 'VN673', 7280, 14, 1, 1, 1, 4, 1, 1, 1, 5, 2, 1);
INSERT INTO `staging` VALUES (687, 'Khánh Hòa, Việt Nam', '2024-12-06T14:00:00', 25.90, 25.90, 22.70, 82.54, 0.00, 80.60, '[rain]', 0.00, 0.00, 27.70, 14.40, 351.60, 1008, 100, 24.1, 173, 0.6, 2, 10, 'Rain, Overcast', 'rain', 'None', 29, 'VN673', 7280, 15, 1, 1, 1, 4, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (688, 'Khánh Hòa, Việt Nam', '2024-12-06T15:00:00', 25.60, 25.60, 22.90, 85.05, 0.00, 80.60, '[rain]', 0.00, 0.00, 24.10, 13.30, 348.40, 1008, 99.6, 24.1, 73, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 29, 'VN673', 7280, 16, 1, 1, 1, 4, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (689, 'Khánh Hòa, Việt Nam', '2024-12-06T16:00:00', 25.20, 25.20, 22.80, 86.57, 0.20, 80.60, '[rain]', 0.00, 0.00, 22.00, 11.90, 349.00, 1008, 100, 19.1, 29, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 29, 'VN673', 7280, 17, 1, 1, 1, 4, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (690, 'Khánh Hòa, Việt Nam', '2024-12-06T17:00:00', 24.80, 24.80, 22.70, 88.12, 0.30, 80.60, '[rain]', 0.00, 0.00, 19.10, 11.50, 343.30, 1009, 100, 24.1, 8, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 29, 'VN673', 7280, 18, 1, 1, 1, 4, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (691, 'Khánh Hòa, Việt Nam', '2024-12-06T18:00:00', 24.90, 24.90, 22.70, 87.60, 0.00, 80.60, '[rain]', 0.00, 0.00, 20.20, 11.90, 345.20, 1009, 97.7, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 29, 'VN673', 7280, 19, 1, 1, 1, 4, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (692, 'Khánh Hòa, Việt Nam', '2024-12-06T19:00:00', 24.70, 24.70, 22.70, 88.65, 0.20, 80.60, '[rain]', 0.00, 0.00, 20.90, 12.60, 352.40, 1010, 100, 21.9, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 29, 'VN673', 7280, 20, 1, 1, 1, 4, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (693, 'Khánh Hòa, Việt Nam', '2024-12-06T20:00:00', 24.60, 24.60, 22.70, 89.18, 0.10, 19.40, '[rain]', 0.00, 0.00, 21.20, 12.20, 350.60, 1011, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 29, 'VN673', 7280, 21, 1, 1, 2, 4, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (694, 'Khánh Hòa, Việt Nam', '2024-12-06T21:00:00', 24.50, 24.50, 22.70, 89.72, 0.20, 19.40, '[rain]', 0.00, 0.00, 20.90, 11.50, 338.10, 1011, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 29, 'VN673', 7280, 22, 1, 1, 2, 4, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (695, 'Khánh Hòa, Việt Nam', '2024-12-06T22:00:00', 24.60, 24.60, 22.70, 89.18, 0.00, 19.40, 'None', 0.00, 0.00, 23.00, 13.00, 339.10, 1011, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 29, 'VN673', 7280, 23, 1, 2, 2, 4, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (696, 'Khánh Hòa, Việt Nam', '2024-12-06T23:00:00', 24.50, 24.50, 22.70, 89.72, 0.10, 19.40, '[rain]', 0.00, 0.00, 24.10, 14.00, 341.90, 1011, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 29, 'VN673', 7280, 24, 1, 1, 2, 4, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (697, 'Kiên Giang, Việt Nam', '2024-12-06T00:00:00', 26.30, 26.30, 23.70, 85.63, 0.40, 90.30, '[rain]', 0.00, 0.00, 23.00, 16.90, 97.00, 1009, 100, 21, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 30, 'VN697', 7280, 1, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (698, 'Kiên Giang, Việt Nam', '2024-12-06T01:00:00', 26.00, 26.00, 23.40, 85.60, 0.50, 90.30, '[rain]', 0.00, 0.00, 25.60, 16.90, 88.30, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 30, 'VN697', 7280, 2, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (699, 'Kiên Giang, Việt Nam', '2024-12-06T02:00:00', 25.90, 25.90, 23.10, 84.57, 0.40, 38.70, '[rain]', 0.00, 0.00, 23.40, 14.40, 87.60, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 30, 'VN697', 7280, 3, 1, 1, 2, 3, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (700, 'Kiên Giang, Việt Nam', '2024-12-06T03:00:00', 26.20, 26.20, 22.90, 82.08, 0.00, 38.70, 'None', 0.00, 0.00, 21.20, 13.30, 91.00, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 30, 'VN697', 7280, 4, 1, 2, 2, 2, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (701, 'Kiên Giang, Việt Nam', '2024-12-06T04:00:00', 26.00, 26.00, 22.80, 82.55, 0.00, 38.70, 'None', 0.00, 0.00, 21.60, 13.70, 81.90, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 30, 'VN697', 7280, 5, 1, 2, 2, 3, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (702, 'Kiên Giang, Việt Nam', '2024-12-06T05:00:00', 25.80, 25.80, 22.80, 83.54, 0.00, 38.70, 'None', 0.00, 0.00, 21.20, 13.70, 80.80, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 30, 'VN697', 7280, 6, 1, 2, 2, 3, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (703, 'Kiên Giang, Việt Nam', '2024-12-06T06:00:00', 25.80, 25.80, 22.80, 83.54, 0.00, 38.70, 'None', 0.00, 0.00, 18.00, 12.60, 73.80, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 30, 'VN697', 7280, 7, 1, 2, 2, 3, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (704, 'Kiên Giang, Việt Nam', '2024-12-06T07:00:00', 25.90, 25.90, 23.00, 84.06, 0.00, 38.70, 'None', 0.00, 0.00, 16.60, 12.20, 69.30, 1009, 100, 24.1, 27, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 30, 'VN697', 7280, 8, 1, 2, 2, 3, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (705, 'Kiên Giang, Việt Nam', '2024-12-06T08:00:00', 26.40, 26.40, 23.20, 82.60, 0.00, 64.50, '[rain]', 0.00, 0.00, 13.00, 11.90, 57.40, 1009, 100, 24.1, 176, 0.6, 2, 10, 'Rain, Overcast', 'rain', 'None', 30, 'VN697', 7280, 9, 1, 1, 1, 3, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (706, 'Kiên Giang, Việt Nam', '2024-12-06T09:00:00', 27.00, 29.60, 23.30, 80.22, 0.00, 64.50, '[rain]', 0.00, 0.00, 10.80, 9.70, 44.20, 1010, 100, 24.1, 381, 1.4, 4, 10, 'Rain, Overcast', 'rain', 'None', 30, 'VN697', 7280, 10, 1, 1, 1, 5, 1, 1, 1, 1, 2, 1);
INSERT INTO `staging` VALUES (707, 'Kiên Giang, Việt Nam', '2024-12-06T10:00:00', 27.60, 30.70, 23.30, 77.44, 0.00, 64.50, '[rain]', 0.00, 0.00, 9.00, 6.50, 13.80, 1010, 80, 24.1, 586, 2.1, 6, 10, 'Rain, Partially cloudy', 'rain', 'None', 30, 'VN697', 7280, 11, 1, 1, 3, 5, 1, 1, 1, 1, 3, 6);
INSERT INTO `staging` VALUES (708, 'Kiên Giang, Việt Nam', '2024-12-06T11:00:00', 27.90, 31.20, 23.40, 76.56, 0.40, 64.50, '[rain]', 0.00, 0.00, 7.60, 5.00, 349.50, 1009, 82.8, 22.5, 761, 2.7, 8, 10, 'Rain, Partially cloudy', 'rain', 'None', 30, 'VN697', 7280, 12, 1, 1, 3, 4, 1, 1, 1, 2, 4, 1);
INSERT INTO `staging` VALUES (709, 'Kiên Giang, Việt Nam', '2024-12-06T12:00:00', 28.10, 31.60, 23.40, 75.67, 1.00, 64.50, '[rain]', 0.00, 0.00, 5.40, 2.50, 347.60, 1008, 93.7, 8.3, 824, 3, 8, 10, 'Rain, Overcast', 'rain', 'None', 30, 'VN697', 7280, 13, 1, 1, 1, 4, 1, 1, 1, 3, 4, 1);
INSERT INTO `staging` VALUES (710, 'Kiên Giang, Việt Nam', '2024-12-06T13:00:00', 28.40, 32.00, 23.30, 73.91, 1.40, 64.50, '[rain]', 0.00, 0.00, 6.50, 2.90, 19.90, 1007, 85, 24.1, 792, 2.9, 8, 10, 'Rain, Partially cloudy', 'rain', 'None', 30, 'VN697', 7280, 14, 1, 1, 3, 5, 1, 1, 1, 3, 4, 1);
INSERT INTO `staging` VALUES (711, 'Kiên Giang, Việt Nam', '2024-12-06T14:00:00', 28.30, 31.70, 23.20, 73.90, 1.60, 87.10, '[rain]', 0.00, 0.00, 7.20, 4.00, 65.30, 1006, 91.6, 7.7, 741, 2.7, 7, 10, 'Rain, Overcast', 'rain', 'None', 30, 'VN697', 7280, 15, 1, 1, 1, 3, 1, 1, 1, 3, 3, 1);
INSERT INTO `staging` VALUES (712, 'Kiên Giang, Việt Nam', '2024-12-06T15:00:00', 28.50, 32.30, 23.50, 74.38, 1.90, 87.10, '[rain]', 0.00, 0.00, 9.00, 6.50, 81.70, 1006, 24.7, 4.9, 599, 2.2, 6, 10, 'Rain, Partially cloudy', 'rain', 'None', 30, 'VN697', 7280, 16, 1, 1, 3, 3, 1, 1, 1, 1, 3, 4);
INSERT INTO `staging` VALUES (713, 'Kiên Giang, Việt Nam', '2024-12-06T16:00:00', 28.50, 32.50, 23.80, 75.73, 1.90, 87.10, '[rain]', 0.00, 0.00, 11.90, 9.40, 99.40, 1006, 7.3, 4.9, 406, 1.5, 4, 30, 'Rain', 'rain', 'None', 30, 'VN697', 7280, 17, 1, 1, 4, 2, 1, 1, 1, 1, 2, 5);
INSERT INTO `staging` VALUES (714, 'Kiên Giang, Việt Nam', '2024-12-06T17:00:00', 27.90, 31.80, 24.30, 80.82, 2.20, 87.10, '[rain]', 0.00, 0.00, 15.50, 12.20, 110.10, 1006, 81.7, 5, 189, 0.7, 2, 30, 'Rain, Partially cloudy', 'rain', 'None', 30, 'VN697', 7280, 18, 1, 1, 3, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (715, 'Kiên Giang, Việt Nam', '2024-12-06T18:00:00', 27.40, 30.70, 23.90, 81.24, 2.30, 87.10, '[rain]', 0.00, 0.00, 19.10, 14.40, 112.90, 1007, 86, 7.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 30, 'VN697', 7280, 19, 1, 1, 3, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (716, 'Kiên Giang, Việt Nam', '2024-12-06T19:00:00', 27.20, 30.20, 23.60, 80.73, 1.20, 87.10, '[rain]', 0.00, 0.00, 21.20, 13.70, 103.20, 1008, 100, 9.8, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 30, 'VN697', 7280, 20, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (717, 'Kiên Giang, Việt Nam', '2024-12-06T20:00:00', 27.10, 30.10, 23.80, 82.19, 0.00, 48.40, '[rain]', 0.00, 0.00, 23.40, 14.80, 103.00, 1009, 77.4, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 30, 'VN697', 7280, 21, 1, 1, 3, 2, 1, 1, 1, 5, 1, 6);
INSERT INTO `staging` VALUES (718, 'Kiên Giang, Việt Nam', '2024-12-06T21:00:00', 26.60, 26.60, 23.70, 84.13, 0.10, 48.40, '[rain]', 0.00, 0.00, 26.30, 15.80, 105.50, 1009, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 30, 'VN697', 7280, 22, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (719, 'Kiên Giang, Việt Nam', '2024-12-06T22:00:00', 26.30, 26.30, 23.60, 85.12, 0.00, 48.40, '[rain]', 0.00, 0.00, 32.40, 16.90, 104.60, 1009, 99.1, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 30, 'VN697', 7280, 23, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (720, 'Kiên Giang, Việt Nam', '2024-12-06T23:00:00', 26.00, 26.00, 23.60, 86.64, 0.00, 48.40, '[rain]', 0.00, 0.00, 38.20, 18.00, 100.50, 1009, 37.3, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 30, 'VN697', 7280, 24, 1, 1, 3, 2, 1, 1, 1, 5, 1, 4);
INSERT INTO `staging` VALUES (721, 'Kon Tum, Việt Nam', '2024-12-06T00:00:00', 17.70, 17.70, 17.00, 95.67, 0.00, 0.00, 'None', 0.00, 0.00, 7.20, 5.00, 45.20, 1013, 9.8, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 31, 'VN721', 7280, 1, 1, 2, 5, 3, 3, 1, 3, 2, 1, 5);
INSERT INTO `staging` VALUES (722, 'Kon Tum, Việt Nam', '2024-12-06T01:00:00', 17.60, 17.60, 16.90, 95.67, 0.00, 0.00, 'None', 0.00, 0.00, 7.20, 5.00, 43.40, 1012, 6.6, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 31, 'VN721', 7280, 2, 1, 2, 5, 5, 3, 1, 3, 2, 1, 5);
INSERT INTO `staging` VALUES (723, 'Kon Tum, Việt Nam', '2024-12-06T02:00:00', 17.50, 17.50, 16.70, 95.06, 0.00, 0.00, 'None', 0.00, 0.00, 5.40, 4.70, 31.00, 1012, 5, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 31, 'VN721', 7280, 3, 1, 2, 5, 5, 3, 1, 3, 3, 1, 5);
INSERT INTO `staging` VALUES (724, 'Kon Tum, Việt Nam', '2024-12-06T03:00:00', 17.40, 17.40, 16.70, 95.66, 0.00, 0.00, 'None', 0.00, 0.00, 5.00, 5.00, 22.20, 1012, 5, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 31, 'VN721', 7280, 4, 1, 2, 5, 5, 3, 1, 3, 2, 1, 5);
INSERT INTO `staging` VALUES (725, 'Kon Tum, Việt Nam', '2024-12-06T04:00:00', 17.20, 17.20, 16.70, 96.88, 0.00, 0.00, 'None', 0.00, 0.00, 4.70, 5.00, 22.30, 1012, 14.3, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 31, 'VN721', 7280, 5, 1, 2, 5, 5, 3, 1, 3, 2, 1, 5);
INSERT INTO `staging` VALUES (726, 'Kon Tum, Việt Nam', '2024-12-06T05:00:00', 17.10, 17.10, 16.70, 97.50, 0.00, 0.00, 'None', 0.00, 0.00, 4.30, 4.70, 29.20, 1012, 11.6, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 31, 'VN721', 7280, 6, 1, 2, 5, 5, 3, 1, 3, 3, 1, 5);
INSERT INTO `staging` VALUES (727, 'Kon Tum, Việt Nam', '2024-12-06T06:00:00', 17.20, 17.20, 16.70, 96.88, 0.00, 0.00, 'None', 0.00, 0.00, 5.80, 5.00, 40.10, 1013, 18.3, 24.1, 0, 0, 0, 10, 'Clear', 'clear-day', 'None', 31, 'VN721', 7280, 7, 1, 2, 5, 5, 6, 1, 3, 2, 1, 5);
INSERT INTO `staging` VALUES (728, 'Kon Tum, Việt Nam', '2024-12-06T07:00:00', 19.20, 19.20, 17.40, 89.32, 0.00, 0.00, 'None', 0.00, 0.00, 12.20, 5.00, 36.10, 1013, 17.3, 24.1, 59, 0.2, 1, 10, 'Clear', 'clear-day', 'None', 31, 'VN721', 7280, 8, 1, 2, 5, 5, 6, 1, 1, 2, 1, 5);
INSERT INTO `staging` VALUES (729, 'Kon Tum, Việt Nam', '2024-12-06T08:00:00', 22.20, 22.20, 17.70, 75.67, 0.00, 0.00, 'None', 0.00, 0.00, 27.40, 9.40, 41.30, 1013, 55, 24.1, 264, 1, 3, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 31, 'VN721', 7280, 9, 1, 2, 6, 5, 5, 1, 1, 1, 2, 3);
INSERT INTO `staging` VALUES (730, 'Kon Tum, Việt Nam', '2024-12-06T09:00:00', 23.90, 23.90, 17.90, 69.13, 0.00, 0.00, 'None', 0.00, 0.00, 26.60, 11.20, 44.90, 1013, 96.4, 24.1, 411, 1.5, 4, 10, 'Overcast', 'cloudy', 'None', 31, 'VN721', 7280, 10, 1, 2, 2, 5, 2, 1, 2, 2, 2, 1);
INSERT INTO `staging` VALUES (731, 'Kon Tum, Việt Nam', '2024-12-06T10:00:00', 24.70, 24.70, 18.40, 68.00, 0.00, 0.00, 'None', 0.00, 0.00, 25.60, 13.00, 52.20, 1013, 100, 24.1, 497, 1.8, 5, 10, 'Overcast', 'cloudy', 'None', 31, 'VN721', 7280, 11, 1, 2, 2, 3, 2, 1, 2, 5, 2, 1);
INSERT INTO `staging` VALUES (732, 'Kon Tum, Việt Nam', '2024-12-06T11:00:00', 24.60, 24.60, 18.60, 69.27, 0.00, 0.00, 'None', 0.00, 0.00, 24.80, 13.30, 61.50, 1012, 100, 24.1, 522, 1.9, 5, 10, 'Overcast', 'cloudy', 'None', 31, 'VN721', 7280, 12, 1, 2, 2, 3, 2, 1, 2, 5, 2, 1);
INSERT INTO `staging` VALUES (733, 'Kon Tum, Việt Nam', '2024-12-06T12:00:00', 24.40, 24.40, 18.60, 70.10, 0.00, 0.00, 'None', 0.00, 0.00, 23.80, 12.20, 65.40, 1011, 100, 24.1, 525, 1.9, 5, 10, 'Overcast', 'cloudy', 'None', 31, 'VN721', 7280, 13, 1, 2, 2, 3, 2, 1, 1, 5, 2, 1);
INSERT INTO `staging` VALUES (734, 'Kon Tum, Việt Nam', '2024-12-06T13:00:00', 24.40, 24.40, 18.60, 70.10, 0.10, 0.00, '[rain]', 0.00, 0.00, 22.70, 11.50, 66.60, 1011, 84.8, 24.1, 518, 1.9, 5, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 31, 'VN721', 7280, 14, 1, 1, 6, 3, 5, 1, 1, 2, 2, 1);
INSERT INTO `staging` VALUES (735, 'Kon Tum, Việt Nam', '2024-12-06T14:00:00', 24.00, 24.00, 18.60, 71.81, 0.00, 6.50, 'None', 0.00, 0.00, 23.00, 11.50, 68.30, 1010, 55.3, 24.1, 460, 1.7, 5, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 31, 'VN721', 7280, 15, 1, 2, 6, 3, 5, 1, 1, 2, 2, 3);
INSERT INTO `staging` VALUES (736, 'Kon Tum, Việt Nam', '2024-12-06T15:00:00', 23.30, 23.30, 18.50, 74.43, 0.00, 6.50, 'None', 0.00, 0.00, 25.60, 12.20, 66.40, 1010, 38.3, 24.1, 419, 1.5, 4, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 31, 'VN721', 7280, 16, 1, 2, 6, 3, 5, 1, 1, 5, 2, 4);
INSERT INTO `staging` VALUES (737, 'Kon Tum, Việt Nam', '2024-12-06T16:00:00', 22.60, 22.60, 18.40, 77.17, 0.00, 6.50, 'None', 0.00, 0.00, 28.10, 10.80, 69.20, 1010, 26.7, 24.1, 280, 1, 3, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 31, 'VN721', 7280, 17, 1, 2, 6, 3, 5, 1, 1, 1, 2, 4);
INSERT INTO `staging` VALUES (738, 'Kon Tum, Việt Nam', '2024-12-06T17:00:00', 21.30, 21.30, 18.40, 83.54, 0.00, 6.50, 'None', 0.00, 0.00, 27.40, 7.90, 65.80, 1011, 14.4, 24.1, 102, 0.4, 1, 10, 'Clear', 'clear-day', 'None', 31, 'VN721', 7280, 18, 1, 2, 5, 3, 6, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (739, 'Kon Tum, Việt Nam', '2024-12-06T18:00:00', 19.80, 19.80, 18.10, 89.93, 0.00, 6.50, 'None', 0.00, 0.00, 18.40, 6.50, 69.90, 1011, 12.3, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 31, 'VN721', 7280, 19, 1, 2, 5, 3, 3, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (740, 'Kon Tum, Việt Nam', '2024-12-06T19:00:00', 19.00, 19.00, 18.00, 93.93, 0.00, 6.50, 'None', 0.00, 0.00, 9.40, 4.70, 62.20, 1012, 24, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 31, 'VN721', 7280, 20, 1, 2, 6, 3, 4, 1, 3, 3, 1, 4);
INSERT INTO `staging` VALUES (741, 'Kon Tum, Việt Nam', '2024-12-06T20:00:00', 18.80, 18.80, 18.00, 95.11, 0.00, 0.00, 'None', 0.00, 0.00, 7.20, 4.30, 57.40, 1013, 42.4, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 31, 'VN721', 7280, 21, 1, 2, 6, 3, 4, 1, 3, 3, 1, 3);
INSERT INTO `staging` VALUES (742, 'Kon Tum, Việt Nam', '2024-12-06T21:00:00', 19.00, 19.00, 18.00, 93.93, 0.00, 0.00, 'None', 0.00, 0.00, 11.20, 4.70, 51.30, 1013, 50.8, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 31, 'VN721', 7280, 22, 1, 2, 6, 3, 4, 1, 3, 3, 1, 3);
INSERT INTO `staging` VALUES (743, 'Kon Tum, Việt Nam', '2024-12-06T22:00:00', 19.00, 19.00, 18.00, 93.93, 0.00, 0.00, 'None', 0.00, 0.00, 12.20, 4.70, 42.80, 1013, 93.1, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 31, 'VN721', 7280, 23, 1, 2, 2, 5, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (744, 'Kon Tum, Việt Nam', '2024-12-06T23:00:00', 19.90, 19.90, 18.20, 89.94, 0.00, 0.00, 'None', 0.00, 0.00, 7.90, 3.60, 27.10, 1013, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 31, 'VN721', 7280, 24, 1, 2, 2, 5, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (745, 'Lai Châu, Việt Nam', '2024-12-06T00:00:00', 14.90, 14.90, 14.00, 94.35, 0.00, 77.40, '[rain]', 0.00, 0.00, 4.70, 2.90, 95.10, 1014, 100, 8.7, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 32, 'VN745', 7280, 1, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (746, 'Lai Châu, Việt Nam', '2024-12-06T01:00:00', 14.70, 14.70, 14.00, 95.57, 0.00, 77.40, '[rain]', 0.00, 0.00, 2.20, 1.80, 90.80, 1014, 94.8, 8.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 32, 'VN745', 7280, 2, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (747, 'Lai Châu, Việt Nam', '2024-12-06T02:00:00', 14.60, 14.60, 14.00, 96.19, 0.10, 90.30, '[rain]', 0.00, 0.00, 5.80, 3.60, 120.30, 1013, 92.6, 8.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 32, 'VN745', 7280, 3, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (748, 'Lai Châu, Việt Nam', '2024-12-06T03:00:00', 14.50, 14.50, 14.10, 97.44, 0.10, 90.30, '[rain]', 0.00, 0.00, 4.30, 2.20, 159.20, 1013, 66.8, 8.6, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 32, 'VN745', 7280, 4, 1, 1, 3, 1, 1, 1, 3, 3, 1, 6);
INSERT INTO `staging` VALUES (749, 'Lai Châu, Việt Nam', '2024-12-06T04:00:00', 14.10, 14.10, 13.80, 98.07, 0.10, 90.30, '[rain]', 0.00, 0.00, 2.50, 1.80, 180.80, 1013, 86.9, 8.7, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 32, 'VN745', 7280, 5, 1, 1, 3, 8, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (750, 'Lai Châu, Việt Nam', '2024-12-06T05:00:00', 14.20, 14.20, 13.90, 98.07, 0.10, 90.30, '[rain]', 0.00, 0.00, 5.40, 2.50, 167.80, 1013, 58.8, 8.7, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 32, 'VN745', 7280, 6, 1, 1, 3, 1, 1, 1, 3, 3, 1, 3);
INSERT INTO `staging` VALUES (751, 'Lai Châu, Việt Nam', '2024-12-06T06:00:00', 13.50, 13.50, 13.30, 98.71, 0.10, 90.30, '[rain]', 0.00, 0.00, 4.00, 3.60, 110.70, 1014, 56, 8.8, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 32, 'VN745', 7280, 7, 1, 1, 3, 2, 1, 1, 3, 3, 1, 3);
INSERT INTO `staging` VALUES (752, 'Lai Châu, Việt Nam', '2024-12-06T07:00:00', 13.60, 13.60, 13.40, 98.71, 0.00, 90.30, '[rain]', 0.00, 0.00, 4.00, 3.20, 105.30, 1014, 74, 8.6, 5, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 32, 'VN745', 7280, 8, 1, 1, 3, 2, 1, 1, 3, 3, 1, 6);
INSERT INTO `staging` VALUES (753, 'Lai Châu, Việt Nam', '2024-12-06T08:00:00', 15.00, 15.00, 14.10, 94.35, 0.00, 16.10, 'None', 0.00, 0.00, 5.40, 2.20, 152.40, 1015, 81.9, 8.5, 65, 0.2, 1, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 32, 'VN745', 7280, 9, 1, 2, 6, 1, 5, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (754, 'Lai Châu, Việt Nam', '2024-12-06T09:00:00', 15.70, 15.70, 14.40, 91.98, 0.10, 16.10, '[rain]', 0.00, 0.00, 7.60, 3.60, 166.70, 1015, 90.9, 8.5, 105, 0.4, 1, 10, 'Overcast', 'cloudy', 'None', 32, 'VN745', 7280, 10, 1, 1, 2, 1, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (755, 'Lai Châu, Việt Nam', '2024-12-06T10:00:00', 16.20, 16.20, 14.60, 90.24, 0.00, 16.10, 'None', 0.00, 0.00, 7.60, 3.60, 188.90, 1015, 96, 8.6, 109, 0.4, 1, 10, 'Overcast', 'cloudy', 'None', 32, 'VN745', 7280, 11, 1, 2, 2, 8, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (756, 'Lai Châu, Việt Nam', '2024-12-06T11:00:00', 15.90, 15.90, 14.70, 92.58, 0.10, 16.10, '[rain]', 0.00, 0.00, 6.80, 4.30, 215.90, 1015, 100, 8.6, 90, 0.3, 1, 10, 'Overcast', 'cloudy', 'None', 32, 'VN745', 7280, 12, 1, 1, 2, 8, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (757, 'Lai Châu, Việt Nam', '2024-12-06T12:00:00', 15.80, 15.80, 14.70, 93.18, 0.00, 16.10, '[rain]', 0.00, 0.00, 7.60, 4.30, 216.30, 1014, 100, 8.7, 82, 0.3, 1, 10, 'Overcast', 'cloudy', 'None', 32, 'VN745', 7280, 13, 1, 1, 2, 8, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (758, 'Lai Châu, Việt Nam', '2024-12-06T13:00:00', 15.90, 15.90, 14.70, 92.58, 0.10, 16.10, '[rain]', 0.00, 0.00, 8.60, 5.40, 217.90, 1012, 100, 0.6, 91, 0.3, 1, 10, 'Overcast', 'fog', 'None', 32, 'VN745', 7280, 14, 1, 1, 2, 8, 7, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (759, 'Lai Châu, Việt Nam', '2024-12-06T14:00:00', 15.80, 15.80, 14.60, 92.58, 0.00, 25.80, 'None', 0.00, 0.00, 7.60, 4.00, 208.90, 1012, 92.9, 0.5, 56, 0.2, 1, 10, 'Overcast', 'fog', 'None', 32, 'VN745', 7280, 15, 1, 2, 2, 8, 7, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (760, 'Lai Châu, Việt Nam', '2024-12-06T15:00:00', 16.20, 16.20, 14.70, 90.83, 0.10, 25.80, '[rain]', 0.00, 0.00, 6.50, 3.20, 194.00, 1011, 84.4, 10.7, 84, 0.3, 1, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 32, 'VN745', 7280, 16, 1, 1, 6, 8, 5, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (761, 'Lai Châu, Việt Nam', '2024-12-06T16:00:00', 16.70, 16.70, 14.20, 85.19, 0.00, 25.80, 'None', 0.00, 0.00, 7.20, 4.30, 197.10, 1011, 95.5, 21.4, 123, 0.4, 1, 10, 'Overcast', 'cloudy', 'None', 32, 'VN745', 7280, 17, 1, 2, 2, 8, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (762, 'Lai Châu, Việt Nam', '2024-12-06T17:00:00', 15.80, 15.80, 14.50, 91.98, 0.10, 25.80, '[rain]', 0.00, 0.00, 4.70, 2.90, 185.20, 1012, 87.2, 21.4, 24, 0.1, 0, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 32, 'VN745', 7280, 18, 1, 1, 6, 8, 5, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (763, 'Lai Châu, Việt Nam', '2024-12-06T18:00:00', 15.30, 15.30, 14.40, 94.37, 0.00, 25.80, 'None', 0.00, 0.00, 4.00, 2.90, 169.30, 1012, 78.2, 21.4, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 32, 'VN745', 7280, 19, 1, 2, 6, 1, 4, 1, 3, 3, 1, 6);
INSERT INTO `staging` VALUES (764, 'Lai Châu, Việt Nam', '2024-12-06T19:00:00', 14.80, 14.80, 14.30, 96.82, 0.00, 25.80, 'None', 0.00, 0.00, 3.60, 2.90, 142.40, 1013, 77.1, 9.9, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 32, 'VN745', 7280, 20, 1, 2, 6, 1, 4, 1, 3, 3, 1, 6);
INSERT INTO `staging` VALUES (765, 'Lai Châu, Việt Nam', '2024-12-06T20:00:00', 14.80, 14.80, 14.30, 96.82, 0.00, 51.60, '[rain]', 0.00, 0.00, 4.70, 3.20, 119.70, 1014, 99.2, 11.2, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 32, 'VN745', 7280, 21, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (766, 'Lai Châu, Việt Nam', '2024-12-06T21:00:00', 15.10, 15.10, 14.30, 94.97, 0.00, 51.60, '[rain]', 0.00, 0.00, 5.00, 3.20, 112.50, 1014, 100, 9.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 32, 'VN745', 7280, 22, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (767, 'Lai Châu, Việt Nam', '2024-12-06T22:00:00', 15.00, 15.00, 14.30, 95.58, 0.20, 51.60, '[rain]', 0.00, 0.00, 3.20, 2.20, 141.80, 1015, 100, 8.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 32, 'VN745', 7280, 23, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (768, 'Lai Châu, Việt Nam', '2024-12-06T23:00:00', 14.90, 14.90, 14.30, 96.20, 0.10, 51.60, '[rain]', 0.00, 0.00, 3.60, 2.50, 130.60, 1015, 99.8, 8.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 32, 'VN745', 7280, 24, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (769, 'Lâm Đồng, Việt Nam', '2024-12-06T00:00:00', 16.30, 16.30, 15.90, 97.48, 0.00, 0.00, 'None', 0.00, 0.00, 13.70, 5.40, 41.20, 1013, 100, 0.6, 0, 0, 0, 10, 'Overcast', 'fog', 'None', 33, 'VN769', 7280, 1, 1, 2, 2, 5, 7, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (770, 'Lâm Đồng, Việt Nam', '2024-12-06T01:00:00', 16.20, 16.20, 15.90, 98.10, 0.00, 0.00, 'None', 0.00, 0.00, 12.60, 5.40, 43.60, 1013, 100, 0.4, 0, 0, 0, 10, 'Overcast', 'fog', 'None', 33, 'VN769', 7280, 2, 1, 2, 2, 5, 7, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (771, 'Lâm Đồng, Việt Nam', '2024-12-06T02:00:00', 16.00, 16.00, 15.60, 97.47, 0.00, 0.00, 'None', 0.00, 0.00, 11.50, 5.40, 44.40, 1012, 100, 1.7, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 33, 'VN769', 7280, 3, 1, 2, 2, 5, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (772, 'Lâm Đồng, Việt Nam', '2024-12-06T03:00:00', 16.00, 16.00, 15.60, 97.47, 0.00, 0.00, 'None', 0.00, 0.00, 10.40, 5.00, 44.40, 1012, 100, 2.3, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 33, 'VN769', 7280, 4, 1, 2, 2, 5, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (773, 'Lâm Đồng, Việt Nam', '2024-12-06T04:00:00', 16.00, 16.00, 15.60, 97.47, 0.00, 0.00, 'None', 0.00, 0.00, 11.20, 5.80, 41.80, 1012, 100, 5.4, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 33, 'VN769', 7280, 5, 1, 2, 2, 5, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (774, 'Lâm Đồng, Việt Nam', '2024-12-06T05:00:00', 15.90, 15.90, 15.50, 97.47, 0.00, 0.00, 'None', 0.00, 0.00, 11.90, 5.80, 41.80, 1012, 100, 5.3, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 33, 'VN769', 7280, 6, 1, 2, 2, 5, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (775, 'Lâm Đồng, Việt Nam', '2024-12-06T06:00:00', 16.00, 16.00, 15.60, 97.47, 0.00, 0.00, 'None', 0.00, 0.00, 14.80, 6.50, 41.70, 1013, 100, 1.5, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 33, 'VN769', 7280, 7, 1, 2, 2, 5, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (776, 'Lâm Đồng, Việt Nam', '2024-12-06T07:00:00', 16.70, 16.70, 15.80, 94.42, 0.00, 0.00, 'None', 0.00, 0.00, 13.70, 6.80, 51.70, 1013, 100, 6.1, 44, 0.2, 0, 10, 'Overcast', 'cloudy', 'None', 33, 'VN769', 7280, 8, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (777, 'Lâm Đồng, Việt Nam', '2024-12-06T08:00:00', 18.70, 18.70, 16.40, 86.49, 0.00, 87.10, '[rain]', 0.00, 0.00, 16.60, 6.80, 63.50, 1013, 77.7, 24.1, 184, 0.7, 2, 10, 'Rain, Partially cloudy', 'rain', 'None', 33, 'VN769', 7280, 9, 1, 1, 3, 3, 1, 1, 1, 1, 1, 6);
INSERT INTO `staging` VALUES (778, 'Lâm Đồng, Việt Nam', '2024-12-06T09:00:00', 20.80, 20.80, 16.70, 77.39, 0.00, 87.10, '[rain]', 0.00, 0.00, 17.60, 8.30, 62.30, 1013, 100, 24.1, 405, 1.5, 4, 10, 'Rain, Overcast', 'rain', 'None', 33, 'VN769', 7280, 10, 1, 1, 1, 3, 1, 1, 1, 1, 2, 1);
INSERT INTO `staging` VALUES (779, 'Lâm Đồng, Việt Nam', '2024-12-06T10:00:00', 21.80, 21.80, 16.60, 72.32, 0.00, 87.10, '[rain]', 0.00, 0.00, 15.80, 9.00, 65.80, 1013, 100, 24.1, 501, 1.8, 5, 10, 'Rain, Overcast', 'rain', 'None', 33, 'VN769', 7280, 11, 1, 1, 1, 3, 1, 1, 1, 1, 2, 1);
INSERT INTO `staging` VALUES (780, 'Lâm Đồng, Việt Nam', '2024-12-06T11:00:00', 22.50, 22.50, 16.50, 68.86, 0.10, 87.10, '[rain]', 0.00, 0.00, 13.30, 9.00, 61.30, 1012, 100, 24.1, 581, 2.1, 6, 10, 'Rain, Overcast', 'rain', 'None', 33, 'VN769', 7280, 12, 1, 1, 1, 3, 1, 1, 2, 1, 3, 1);
INSERT INTO `staging` VALUES (781, 'Lâm Đồng, Việt Nam', '2024-12-06T12:00:00', 22.70, 22.70, 16.40, 67.60, 0.10, 87.10, '[rain]', 0.00, 0.00, 12.20, 9.00, 57.40, 1011, 100, 23.9, 575, 2.1, 6, 10, 'Rain, Overcast', 'rain', 'None', 33, 'VN769', 7280, 13, 1, 1, 1, 3, 1, 1, 2, 1, 3, 1);
INSERT INTO `staging` VALUES (782, 'Lâm Đồng, Việt Nam', '2024-12-06T13:00:00', 22.40, 22.40, 16.80, 70.62, 0.20, 87.10, '[rain]', 0.00, 0.00, 10.40, 7.90, 55.80, 1010, 100, 21.1, 515, 1.9, 5, 10, 'Rain, Overcast', 'rain', 'None', 33, 'VN769', 7280, 14, 1, 1, 1, 3, 1, 1, 1, 1, 2, 1);
INSERT INTO `staging` VALUES (783, 'Lâm Đồng, Việt Nam', '2024-12-06T14:00:00', 21.40, 21.40, 17.50, 78.46, 0.40, 100.00, '[rain]', 0.00, 0.00, 11.20, 7.20, 63.60, 1010, 97.7, 19.7, 401, 1.4, 4, 10, 'Rain, Overcast', 'rain', 'None', 33, 'VN769', 7280, 15, 1, 1, 1, 3, 1, 1, 1, 1, 2, 1);
INSERT INTO `staging` VALUES (784, 'Lâm Đồng, Việt Nam', '2024-12-06T15:00:00', 20.70, 20.70, 18.30, 86.14, 0.70, 100.00, '[rain]', 0.00, 0.00, 11.20, 6.10, 69.70, 1009, 86.1, 7.5, 487, 1.8, 5, 10, 'Rain, Partially cloudy', 'rain', 'None', 33, 'VN769', 7280, 16, 1, 1, 3, 3, 1, 1, 1, 1, 2, 1);
INSERT INTO `staging` VALUES (785, 'Lâm Đồng, Việt Nam', '2024-12-06T16:00:00', 19.80, 19.80, 18.30, 91.07, 0.40, 100.00, '[rain]', 0.00, 0.00, 11.90, 5.80, 69.50, 1010, 39.3, 12.5, 331, 1.2, 3, 10, 'Rain, Partially cloudy', 'rain', 'None', 33, 'VN769', 7280, 17, 1, 1, 3, 3, 1, 1, 3, 2, 2, 4);
INSERT INTO `staging` VALUES (786, 'Lâm Đồng, Việt Nam', '2024-12-06T17:00:00', 18.00, 18.00, 17.60, 97.51, 0.30, 100.00, '[rain]', 0.00, 0.00, 10.80, 5.00, 59.60, 1011, 99.8, 8, 109, 0.4, 1, 10, 'Rain, Overcast', 'rain', 'None', 33, 'VN769', 7280, 18, 1, 1, 1, 3, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (787, 'Lâm Đồng, Việt Nam', '2024-12-06T18:00:00', 17.10, 17.10, 17.00, 99.37, 0.10, 100.00, '[rain]', 0.00, 0.00, 10.80, 4.70, 46.50, 1012, 99.5, 4.7, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 33, 'VN769', 7280, 19, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (788, 'Lâm Đồng, Việt Nam', '2024-12-06T19:00:00', 17.10, 17.10, 17.00, 99.37, 0.00, 100.00, '[rain]', 0.00, 0.00, 13.00, 4.70, 46.30, 1013, 99.9, 2.3, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 33, 'VN769', 7280, 20, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (789, 'Lâm Đồng, Việt Nam', '2024-12-06T20:00:00', 17.10, 17.10, 17.00, 99.37, 0.00, 3.20, 'None', 0.00, 0.00, 13.70, 5.00, 52.90, 1013, 99.5, 1.2, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 33, 'VN769', 7280, 21, 1, 2, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (790, 'Lâm Đồng, Việt Nam', '2024-12-06T21:00:00', 17.00, 17.00, 16.90, 99.37, 0.00, 3.20, 'None', 0.00, 0.00, 14.80, 4.70, 50.50, 1014, 92.5, 0.2, 0, 0, 0, 10, 'Overcast', 'fog', 'None', 33, 'VN769', 7280, 22, 1, 2, 2, 3, 7, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (791, 'Lâm Đồng, Việt Nam', '2024-12-06T22:00:00', 17.30, 17.30, 17.10, 98.74, 0.00, 3.20, 'None', 0.00, 0.00, 15.80, 4.30, 50.40, 1014, 99.1, 0.2, 0, 0, 0, 10, 'Overcast', 'fog', 'None', 33, 'VN769', 7280, 23, 1, 2, 2, 3, 7, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (792, 'Lâm Đồng, Việt Nam', '2024-12-06T23:00:00', 17.30, 17.30, 17.20, 99.37, 0.00, 3.20, '[rain]', 0.00, 0.00, 18.40, 4.70, 43.00, 1013, 100, 0.1, 0, 0, 0, 10, 'Overcast', 'fog', 'None', 33, 'VN769', 7280, 24, 1, 1, 2, 5, 7, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (793, 'Lạng Sơn, Việt Nam', '2024-12-06T00:00:00', 18.90, 18.90, 14.00, 73.21, 0.00, 0.00, 'None', 0.00, 0.00, 5.40, 4.00, 109.10, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 1, 1, 2, 2, 2, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (794, 'Lạng Sơn, Việt Nam', '2024-12-06T01:00:00', 18.80, 18.80, 13.90, 73.19, 0.00, 0.00, 'None', 0.00, 0.00, 2.50, 2.50, 96.50, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 2, 1, 2, 2, 2, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (795, 'Lạng Sơn, Việt Nam', '2024-12-06T02:00:00', 18.60, 18.60, 14.00, 74.59, 0.00, 0.00, 'None', 0.00, 0.00, 2.20, 2.50, 107.00, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 3, 1, 2, 2, 2, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (796, 'Lạng Sơn, Việt Nam', '2024-12-06T03:00:00', 18.50, 18.50, 14.10, 75.55, 0.00, 0.00, 'None', 0.00, 0.00, 3.60, 3.60, 73.20, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 4, 1, 2, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (797, 'Lạng Sơn, Việt Nam', '2024-12-06T04:00:00', 18.50, 18.50, 14.20, 76.04, 0.00, 0.00, 'None', 0.00, 0.00, 4.00, 4.00, 67.10, 1014, 99.1, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 5, 1, 2, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (798, 'Lạng Sơn, Việt Nam', '2024-12-06T05:00:00', 18.30, 18.30, 14.20, 77.00, 0.00, 0.00, 'None', 0.00, 0.00, 3.60, 3.60, 74.90, 1014, 93.1, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 6, 1, 2, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (799, 'Lạng Sơn, Việt Nam', '2024-12-06T06:00:00', 18.10, 18.10, 14.20, 77.97, 0.00, 0.00, 'None', 0.00, 0.00, 5.00, 4.70, 63.50, 1015, 97, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 7, 1, 2, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (800, 'Lạng Sơn, Việt Nam', '2024-12-06T07:00:00', 18.50, 18.50, 14.10, 75.55, 0.00, 0.00, 'None', 0.00, 0.00, 5.80, 4.30, 66.80, 1016, 31.7, 24.1, 5, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 34, 'VN793', 7280, 8, 1, 2, 6, 3, 5, 1, 1, 3, 1, 4);
INSERT INTO `staging` VALUES (801, 'Lạng Sơn, Việt Nam', '2024-12-06T08:00:00', 20.10, 20.10, 14.20, 68.83, 0.00, 0.00, 'None', 0.00, 0.00, 6.80, 4.70, 52.00, 1016, 75.2, 24.1, 141, 0.5, 1, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 34, 'VN793', 7280, 9, 1, 2, 6, 3, 5, 1, 2, 3, 1, 6);
INSERT INTO `staging` VALUES (802, 'Lạng Sơn, Việt Nam', '2024-12-06T09:00:00', 21.10, 21.10, 14.30, 65.14, 0.00, 0.00, 'None', 0.00, 0.00, 14.00, 6.80, 74.50, 1017, 80.8, 24.1, 188, 0.7, 2, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 34, 'VN793', 7280, 10, 1, 2, 6, 3, 5, 1, 2, 1, 1, 2);
INSERT INTO `staging` VALUES (803, 'Lạng Sơn, Việt Nam', '2024-12-06T10:00:00', 22.20, 22.20, 14.30, 60.90, 0.00, 0.00, 'None', 0.00, 0.00, 16.20, 9.40, 101.30, 1016, 100, 24.1, 312, 1.1, 3, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 11, 1, 2, 2, 2, 2, 1, 2, 1, 2, 1);
INSERT INTO `staging` VALUES (804, 'Lạng Sơn, Việt Nam', '2024-12-06T11:00:00', 21.90, 21.90, 14.10, 61.22, 0.00, 0.00, 'None', 0.00, 0.00, 16.60, 10.80, 119.00, 1015, 100, 24.1, 166, 0.6, 2, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 12, 1, 2, 2, 2, 2, 1, 2, 1, 1, 1);
INSERT INTO `staging` VALUES (805, 'Lạng Sơn, Việt Nam', '2024-12-06T12:00:00', 21.60, 21.60, 14.10, 62.36, 0.00, 0.00, 'None', 0.00, 0.00, 18.00, 11.90, 123.20, 1014, 100, 24.1, 109, 0.4, 1, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 13, 1, 2, 2, 2, 2, 1, 2, 2, 1, 1);
INSERT INTO `staging` VALUES (806, 'Lạng Sơn, Việt Nam', '2024-12-06T13:00:00', 21.60, 21.60, 14.20, 62.76, 0.00, 0.00, 'None', 0.00, 0.00, 16.60, 11.90, 127.60, 1013, 100, 24.1, 156, 0.6, 2, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 14, 1, 2, 2, 2, 2, 1, 2, 2, 1, 1);
INSERT INTO `staging` VALUES (807, 'Lạng Sơn, Việt Nam', '2024-12-06T14:00:00', 20.90, 20.90, 14.20, 65.52, 0.00, 3.20, 'None', 0.00, 0.00, 17.30, 10.10, 131.00, 1012, 100, 24.1, 71, 0.3, 1, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 15, 1, 2, 2, 2, 2, 1, 2, 1, 1, 1);
INSERT INTO `staging` VALUES (808, 'Lạng Sơn, Việt Nam', '2024-12-06T15:00:00', 20.10, 20.10, 14.50, 70.18, 0.10, 3.20, '[rain]', 0.00, 0.00, 13.30, 5.40, 132.50, 1012, 100, 24.1, 24, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 16, 1, 1, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (809, 'Lạng Sơn, Việt Nam', '2024-12-06T16:00:00', 19.40, 19.40, 14.70, 74.25, 0.00, 3.20, '[rain]', 0.00, 0.00, 3.20, 3.20, 52.80, 1013, 100, 24.1, 9, 0, 0, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 17, 1, 1, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (810, 'Lạng Sơn, Việt Nam', '2024-12-06T17:00:00', 18.90, 18.90, 14.50, 75.62, 0.00, 3.20, 'None', 0.00, 0.00, 6.80, 5.40, 36.70, 1014, 98.4, 24.1, 4, 0, 0, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 18, 1, 2, 2, 5, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (811, 'Lạng Sơn, Việt Nam', '2024-12-06T18:00:00', 18.40, 18.40, 14.10, 76.03, 0.00, 3.20, 'None', 0.00, 0.00, 8.60, 6.50, 23.30, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 19, 1, 2, 2, 5, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (812, 'Lạng Sơn, Việt Nam', '2024-12-06T19:00:00', 18.00, 18.00, 13.40, 74.49, 0.00, 3.20, 'None', 0.00, 0.00, 11.20, 7.20, 21.60, 1015, 70.2, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 34, 'VN793', 7280, 20, 1, 2, 6, 5, 4, 1, 1, 1, 1, 6);
INSERT INTO `staging` VALUES (813, 'Lạng Sơn, Việt Nam', '2024-12-06T20:00:00', 17.30, 17.30, 12.50, 73.40, 0.00, 6.50, 'None', 0.00, 0.00, 14.00, 7.60, 19.40, 1016, 80.8, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 34, 'VN793', 7280, 21, 1, 2, 6, 5, 4, 1, 1, 1, 1, 2);
INSERT INTO `staging` VALUES (814, 'Lạng Sơn, Việt Nam', '2024-12-06T21:00:00', 17.10, 17.10, 11.50, 69.60, 0.00, 6.50, 'None', 0.00, 0.00, 16.60, 8.60, 27.00, 1016, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 22, 1, 2, 2, 5, 2, 1, 2, 1, 1, 1);
INSERT INTO `staging` VALUES (815, 'Lạng Sơn, Việt Nam', '2024-12-06T22:00:00', 17.10, 17.10, 10.70, 66.00, 0.00, 6.50, 'None', 0.00, 0.00, 14.40, 8.30, 30.80, 1016, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 23, 1, 2, 2, 5, 2, 1, 2, 1, 1, 1);
INSERT INTO `staging` VALUES (816, 'Lạng Sơn, Việt Nam', '2024-12-06T23:00:00', 16.90, 16.90, 10.30, 65.08, 0.00, 6.50, 'None', 0.00, 0.00, 14.40, 9.00, 25.70, 1017, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 34, 'VN793', 7280, 24, 1, 2, 2, 5, 2, 1, 2, 1, 1, 1);
INSERT INTO `staging` VALUES (817, 'Lào Cai, Việt Nam', '2024-12-06T00:00:00', 17.10, 17.10, 16.20, 94.44, 0.10, 90.30, '[rain]', 0.00, 0.00, 1.40, 1.10, 156.30, 1014, 97.8, 18.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 35, 'VN817', 7280, 1, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (818, 'Lào Cai, Việt Nam', '2024-12-06T01:00:00', 17.00, 17.00, 16.30, 95.65, 0.00, 90.30, '[rain]', 0.00, 0.00, 2.20, 1.40, 158.10, 1014, 99.3, 18.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 35, 'VN817', 7280, 2, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (819, 'Lào Cai, Việt Nam', '2024-12-06T02:00:00', 17.00, 17.00, 16.30, 95.65, 0.00, 100.00, '[rain]', 0.00, 0.00, 3.20, 1.80, 160.20, 1014, 100, 18.5, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 35, 'VN817', 7280, 3, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (820, 'Lào Cai, Việt Nam', '2024-12-06T03:00:00', 17.00, 17.00, 16.40, 96.26, 0.00, 100.00, '[rain]', 0.00, 0.00, 5.40, 2.50, 144.60, 1013, 100, 6.9, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 35, 'VN817', 7280, 4, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (821, 'Lào Cai, Việt Nam', '2024-12-06T04:00:00', 17.00, 17.00, 16.50, 96.88, 0.10, 100.00, '[rain]', 0.00, 0.00, 6.80, 2.20, 136.60, 1013, 100, 1.7, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 35, 'VN817', 7280, 5, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (822, 'Lào Cai, Việt Nam', '2024-12-06T05:00:00', 17.00, 17.00, 16.70, 98.11, 0.10, 100.00, '[rain]', 0.00, 0.00, 7.60, 2.20, 138.70, 1013, 100, 1.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 35, 'VN817', 7280, 6, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (823, 'Lào Cai, Việt Nam', '2024-12-06T06:00:00', 17.00, 17.00, 16.80, 98.74, 0.10, 100.00, '[rain]', 0.00, 0.00, 6.80, 1.80, 135.20, 1014, 100, 3.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 35, 'VN817', 7280, 7, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (824, 'Lào Cai, Việt Nam', '2024-12-06T07:00:00', 17.00, 17.00, 16.80, 98.74, 0.20, 100.00, '[rain]', 0.00, 0.00, 7.60, 2.20, 133.50, 1014, 100, 1.2, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 35, 'VN817', 7280, 8, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (825, 'Lào Cai, Việt Nam', '2024-12-06T08:00:00', 17.10, 17.10, 16.80, 98.12, 0.20, 48.40, '[rain]', 0.00, 0.00, 6.50, 1.80, 136.30, 1015, 100, 11.5, 4, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 35, 'VN817', 7280, 9, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (826, 'Lào Cai, Việt Nam', '2024-12-06T09:00:00', 17.20, 17.20, 16.90, 98.12, 0.10, 48.40, '[rain]', 0.00, 0.00, 6.80, 2.20, 142.80, 1016, 100, 11.6, 12, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 35, 'VN817', 7280, 10, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (827, 'Lào Cai, Việt Nam', '2024-12-06T10:00:00', 17.30, 17.30, 16.90, 97.50, 0.30, 48.40, '[rain]', 0.00, 0.00, 6.10, 2.20, 142.80, 1016, 100, 16.8, 19, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 35, 'VN817', 7280, 11, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (828, 'Lào Cai, Việt Nam', '2024-12-06T11:00:00', 17.40, 17.40, 16.90, 96.88, 0.20, 48.40, '[rain]', 0.00, 0.00, 6.10, 2.20, 130.60, 1015, 100, 18.6, 22, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 35, 'VN817', 7280, 12, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (829, 'Lào Cai, Việt Nam', '2024-12-06T12:00:00', 17.30, 17.30, 16.90, 97.50, 0.10, 48.40, '[rain]', 0.00, 0.00, 7.20, 2.90, 121.40, 1014, 100, 18.5, 25, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 35, 'VN817', 7280, 13, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (830, 'Lào Cai, Việt Nam', '2024-12-06T13:00:00', 17.30, 17.30, 16.90, 97.50, 0.10, 48.40, '[rain]', 0.00, 0.00, 7.20, 2.90, 111.50, 1013, 100, 11.5, 25, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 35, 'VN817', 7280, 14, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (831, 'Lào Cai, Việt Nam', '2024-12-06T14:00:00', 17.20, 17.20, 16.80, 97.50, 0.20, 6.50, '[rain]', 0.00, 0.00, 7.60, 2.50, 117.20, 1012, 100, 7.1, 24, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 35, 'VN817', 7280, 15, 1, 1, 2, 2, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (832, 'Lào Cai, Việt Nam', '2024-12-06T15:00:00', 17.10, 17.10, 16.80, 98.12, 0.00, 6.50, '[rain]', 0.00, 0.00, 7.60, 2.50, 112.30, 1012, 100, 6.7, 17, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 35, 'VN817', 7280, 16, 1, 1, 2, 2, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (833, 'Lào Cai, Việt Nam', '2024-12-06T16:00:00', 17.10, 17.10, 16.80, 98.12, 0.00, 6.50, '[rain]', 0.00, 0.00, 5.40, 1.80, 108.20, 1012, 100, 6.6, 12, 0, 0, 10, 'Overcast', 'cloudy', 'None', 35, 'VN817', 7280, 17, 1, 1, 2, 2, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (834, 'Lào Cai, Việt Nam', '2024-12-06T17:00:00', 17.00, 17.00, 16.70, 98.11, 0.10, 6.50, '[rain]', 0.00, 0.00, 4.70, 1.40, 143.90, 1013, 100, 6.6, 5, 0, 0, 10, 'Overcast', 'cloudy', 'None', 35, 'VN817', 7280, 18, 1, 1, 2, 1, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (835, 'Lào Cai, Việt Nam', '2024-12-06T18:00:00', 16.90, 16.90, 16.70, 98.74, 0.00, 6.50, '[rain]', 0.00, 0.00, 5.40, 1.80, 139.50, 1013, 100, 6.6, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 35, 'VN817', 7280, 19, 1, 1, 2, 1, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (836, 'Lào Cai, Việt Nam', '2024-12-06T19:00:00', 16.90, 16.90, 16.70, 98.74, 0.10, 6.50, '[rain]', 0.00, 0.00, 4.30, 1.40, 131.80, 1014, 100, 1.2, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 35, 'VN817', 7280, 20, 1, 1, 2, 2, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (837, 'Lào Cai, Việt Nam', '2024-12-06T20:00:00', 16.90, 16.90, 16.80, 99.37, 0.30, 35.50, '[rain]', 0.00, 0.00, 4.70, 1.10, 136.40, 1014, 100, 0.7, 0, 0, 0, 10, 'Overcast', 'fog', 'None', 35, 'VN817', 7280, 21, 1, 1, 2, 1, 7, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (838, 'Lào Cai, Việt Nam', '2024-12-06T21:00:00', 16.90, 16.90, 16.80, 99.37, 0.40, 35.50, '[rain]', 0.00, 0.00, 5.00, 1.80, 120.60, 1015, 100, 0.7, 0, 0, 0, 10, 'Overcast', 'fog', 'None', 35, 'VN817', 7280, 22, 1, 1, 2, 2, 7, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (839, 'Lào Cai, Việt Nam', '2024-12-06T22:00:00', 17.00, 17.00, 16.80, 98.74, 0.10, 35.50, '[rain]', 0.00, 0.00, 5.40, 1.80, 125.60, 1015, 100, 0.7, 0, 0, 0, 10, 'Overcast', 'fog', 'None', 35, 'VN817', 7280, 23, 1, 1, 2, 2, 7, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (840, 'Lào Cai, Việt Nam', '2024-12-06T23:00:00', 16.90, 16.90, 16.80, 99.37, 0.30, 35.50, '[rain]', 0.00, 0.00, 4.70, 1.40, 108.20, 1016, 99.6, 0.6, 0, 0, 0, 10, 'Overcast', 'fog', 'None', 35, 'VN817', 7280, 24, 1, 1, 2, 2, 7, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (841, 'Nam Định, Việt Nam', '2024-12-06T00:00:00', 22.20, 22.20, 19.40, 84.17, 0.00, 0.00, 'None', 0.00, 0.00, 23.40, 11.20, 104.40, 1014, 99.7, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 36, 'VN841', 7280, 1, 1, 2, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (842, 'Nam Định, Việt Nam', '2024-12-06T01:00:00', 22.40, 22.40, 19.40, 83.15, 0.00, 0.00, 'None', 0.00, 0.00, 23.80, 12.20, 97.80, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 36, 'VN841', 7280, 2, 1, 2, 2, 2, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (843, 'Nam Định, Việt Nam', '2024-12-06T02:00:00', 22.50, 22.50, 19.40, 82.64, 0.00, 96.80, '[rain]', 0.00, 0.00, 25.60, 14.00, 94.40, 1013, 91.6, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 36, 'VN841', 7280, 3, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (844, 'Nam Định, Việt Nam', '2024-12-06T03:00:00', 22.40, 22.40, 19.50, 83.67, 0.00, 96.80, '[rain]', 0.00, 0.00, 28.40, 16.20, 91.90, 1013, 49.1, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 36, 'VN841', 7280, 4, 1, 1, 3, 2, 1, 1, 1, 5, 1, 3);
INSERT INTO `staging` VALUES (845, 'Nam Định, Việt Nam', '2024-12-06T04:00:00', 22.30, 22.30, 19.40, 83.66, 0.10, 96.80, '[rain]', 0.00, 0.00, 29.50, 15.80, 87.50, 1013, 97.8, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 36, 'VN841', 7280, 5, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (846, 'Nam Định, Việt Nam', '2024-12-06T05:00:00', 22.40, 22.40, 19.60, 84.19, 0.20, 96.80, '[rain]', 0.00, 0.00, 29.20, 15.50, 88.10, 1013, 100, 17.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 36, 'VN841', 7280, 6, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (847, 'Nam Định, Việt Nam', '2024-12-06T06:00:00', 22.50, 22.50, 19.60, 83.68, 0.30, 96.80, '[rain]', 0.00, 0.00, 30.60, 17.30, 93.20, 1014, 100, 17.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 36, 'VN841', 7280, 7, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (848, 'Nam Định, Việt Nam', '2024-12-06T07:00:00', 22.70, 22.70, 19.40, 81.65, 0.30, 96.80, '[rain]', 0.00, 0.00, 30.60, 18.40, 93.50, 1014, 100, 21.8, 7, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 36, 'VN841', 7280, 8, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (849, 'Nam Định, Việt Nam', '2024-12-06T08:00:00', 23.00, 23.00, 19.40, 80.18, 0.10, 77.40, '[rain]', 0.00, 0.00, 31.00, 19.10, 92.20, 1015, 100, 24.1, 25, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 36, 'VN841', 7280, 9, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (850, 'Nam Định, Việt Nam', '2024-12-06T09:00:00', 23.30, 23.30, 19.40, 78.73, 0.10, 77.40, '[rain]', 0.00, 0.00, 29.90, 19.40, 96.40, 1015, 100, 24.1, 47, 0.2, 0, 10, 'Rain, Overcast', 'rain', 'None', 36, 'VN841', 7280, 10, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (851, 'Nam Định, Việt Nam', '2024-12-06T10:00:00', 23.50, 23.50, 19.40, 77.79, 0.10, 77.40, '[rain]', 0.00, 0.00, 28.40, 19.80, 97.60, 1015, 92.5, 24.1, 72, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 36, 'VN841', 7280, 11, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (852, 'Nam Định, Việt Nam', '2024-12-06T11:00:00', 24.70, 24.70, 19.20, 71.49, 0.10, 77.40, '[rain]', 0.00, 0.00, 24.50, 22.30, 99.80, 1014, 79.1, 20.4, 316, 1.1, 3, 10, 'Rain, Partially cloudy', 'rain', 'None', 36, 'VN841', 7280, 12, 1, 1, 3, 2, 1, 1, 1, 7, 2, 6);
INSERT INTO `staging` VALUES (853, 'Nam Định, Việt Nam', '2024-12-06T12:00:00', 25.20, 25.20, 19.20, 69.38, 0.30, 77.40, '[rain]', 0.00, 0.00, 23.80, 22.30, 98.40, 1013, 84.9, 21.6, 408, 1.5, 4, 10, 'Rain, Partially cloudy', 'rain', 'None', 36, 'VN841', 7280, 13, 1, 1, 3, 2, 1, 1, 2, 7, 2, 1);
INSERT INTO `staging` VALUES (854, 'Nam Định, Việt Nam', '2024-12-06T13:00:00', 25.50, 25.50, 19.00, 67.31, 0.10, 77.40, '[rain]', 0.00, 0.00, 22.70, 21.60, 102.80, 1012, 88.7, 24.1, 345, 1.2, 3, 10, 'Rain, Partially cloudy', 'rain', 'None', 36, 'VN841', 7280, 14, 1, 1, 3, 2, 1, 1, 2, 7, 2, 1);
INSERT INTO `staging` VALUES (855, 'Nam Định, Việt Nam', '2024-12-06T14:00:00', 25.50, 25.50, 18.70, 66.06, 0.10, 45.20, '[rain]', 0.00, 0.00, 22.70, 22.30, 106.50, 1011, 94.1, 24.1, 338, 1.2, 3, 10, 'Rain, Overcast', 'rain', 'None', 36, 'VN841', 7280, 15, 1, 1, 1, 2, 1, 1, 2, 7, 2, 1);
INSERT INTO `staging` VALUES (856, 'Nam Định, Việt Nam', '2024-12-06T15:00:00', 24.80, 24.80, 18.90, 69.74, 0.10, 45.20, '[rain]', 0.00, 0.00, 24.50, 22.70, 106.90, 1011, 66.5, 24.1, 202, 0.7, 2, 10, 'Rain, Partially cloudy', 'rain', 'None', 36, 'VN841', 7280, 16, 1, 1, 3, 2, 1, 1, 2, 7, 1, 6);
INSERT INTO `staging` VALUES (857, 'Nam Định, Việt Nam', '2024-12-06T16:00:00', 24.20, 24.20, 18.90, 72.29, 0.00, 45.20, '[rain]', 0.00, 0.00, 26.30, 22.70, 104.90, 1011, 75.8, 24.1, 171, 0.6, 2, 10, 'Rain, Partially cloudy', 'rain', 'None', 36, 'VN841', 7280, 17, 1, 1, 3, 2, 1, 1, 1, 7, 1, 6);
INSERT INTO `staging` VALUES (858, 'Nam Định, Việt Nam', '2024-12-06T17:00:00', 23.50, 23.50, 18.80, 74.93, 0.00, 45.20, '[rain]', 0.00, 0.00, 27.00, 20.90, 100.30, 1012, 90.8, 24.1, 49, 0.2, 0, 10, 'Rain, Overcast', 'rain', 'None', 36, 'VN841', 7280, 18, 1, 1, 1, 2, 1, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (859, 'Nam Định, Việt Nam', '2024-12-06T18:00:00', 23.10, 23.10, 18.70, 76.29, 0.00, 45.20, '[rain]', 0.00, 0.00, 29.50, 20.20, 98.00, 1013, 91.8, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 36, 'VN841', 7280, 19, 1, 1, 1, 2, 1, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (860, 'Nam Định, Việt Nam', '2024-12-06T19:00:00', 23.00, 23.00, 18.80, 77.23, 0.00, 45.20, '[rain]', 0.00, 0.00, 30.20, 19.80, 96.40, 1014, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 36, 'VN841', 7280, 20, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (861, 'Nam Định, Việt Nam', '2024-12-06T20:00:00', 23.00, 23.00, 18.50, 75.79, 0.00, 51.60, '[rain]', 0.00, 0.00, 30.60, 19.80, 99.30, 1014, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 36, 'VN841', 7280, 21, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (862, 'Nam Định, Việt Nam', '2024-12-06T21:00:00', 22.90, 22.90, 18.60, 76.73, 0.00, 51.60, '[rain]', 0.00, 0.00, 32.40, 20.20, 99.20, 1014, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 36, 'VN841', 7280, 22, 1, 1, 1, 2, 1, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (863, 'Nam Định, Việt Nam', '2024-12-06T22:00:00', 22.80, 22.80, 18.70, 77.69, 0.00, 51.60, '[rain]', 0.00, 0.00, 33.50, 20.50, 98.80, 1015, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 36, 'VN841', 7280, 23, 1, 1, 1, 2, 1, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (864, 'Nam Định, Việt Nam', '2024-12-06T23:00:00', 22.60, 22.60, 18.50, 77.66, 0.00, 51.60, '[rain]', 0.00, 0.00, 33.80, 22.00, 95.10, 1015, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 36, 'VN841', 7280, 24, 1, 1, 1, 2, 1, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (865, 'Nghệ An, Việt Nam', '2024-12-06T00:00:00', 22.80, 22.80, 20.20, 85.28, 0.10, 25.80, '[rain]', 0.00, 0.00, 8.60, 7.20, 48.60, 1014, 82.2, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 37, 'VN865', 7280, 1, 1, 1, 6, 3, 4, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (866, 'Nghệ An, Việt Nam', '2024-12-06T01:00:00', 22.80, 22.80, 20.20, 85.28, 0.20, 25.80, '[rain]', 0.00, 0.00, 6.80, 5.80, 46.50, 1013, 100, 22.8, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 37, 'VN865', 7280, 2, 1, 1, 2, 3, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (867, 'Nghệ An, Việt Nam', '2024-12-06T02:00:00', 22.70, 22.70, 20.10, 85.27, 0.20, 35.50, '[rain]', 0.00, 0.00, 4.70, 3.20, 47.10, 1013, 39.3, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 37, 'VN865', 7280, 3, 1, 1, 6, 3, 4, 1, 1, 3, 1, 4);
INSERT INTO `staging` VALUES (868, 'Nghệ An, Việt Nam', '2024-12-06T03:00:00', 22.40, 22.40, 19.90, 85.77, 0.10, 35.50, '[rain]', 0.00, 0.00, 3.20, 0.40, 335.30, 1013, 36, 22.5, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 37, 'VN865', 7280, 4, 1, 1, 6, 4, 4, 1, 1, 4, 1, 4);
INSERT INTO `staging` VALUES (869, 'Nghệ An, Việt Nam', '2024-12-06T04:00:00', 22.20, 22.20, 19.90, 86.82, 0.10, 35.50, '[rain]', 0.00, 0.00, 3.20, 2.20, 265.50, 1013, 42.4, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 37, 'VN865', 7280, 5, 1, 1, 6, 6, 4, 1, 1, 3, 1, 3);
INSERT INTO `staging` VALUES (870, 'Nghệ An, Việt Nam', '2024-12-06T05:00:00', 21.80, 21.80, 19.90, 88.97, 0.00, 35.50, 'None', 0.00, 0.00, 5.80, 5.80, 276.40, 1013, 9.9, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 37, 'VN865', 7280, 6, 1, 2, 5, 7, 3, 1, 1, 2, 1, 5);
INSERT INTO `staging` VALUES (871, 'Nghệ An, Việt Nam', '2024-12-06T06:00:00', 21.40, 21.40, 19.80, 90.61, 0.10, 35.50, '[rain]', 0.00, 0.00, 7.20, 7.60, 279.00, 1013, 9.8, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 37, 'VN865', 7280, 7, 1, 1, 5, 7, 3, 1, 3, 1, 1, 5);
INSERT INTO `staging` VALUES (872, 'Nghệ An, Việt Nam', '2024-12-06T07:00:00', 21.40, 21.40, 20.00, 91.74, 0.00, 35.50, 'None', 0.00, 0.00, 8.30, 8.30, 277.90, 1014, 13.4, 24.1, 24, 0.1, 0, 10, 'Clear', 'clear-day', 'None', 37, 'VN865', 7280, 8, 1, 2, 5, 7, 6, 1, 3, 1, 1, 5);
INSERT INTO `staging` VALUES (873, 'Nghệ An, Việt Nam', '2024-12-06T08:00:00', 22.10, 22.10, 20.20, 88.99, 0.00, 32.30, 'None', 0.00, 0.00, 10.10, 10.10, 291.70, 1015, 50.1, 24.1, 190, 0.7, 2, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 37, 'VN865', 7280, 9, 1, 2, 6, 7, 5, 1, 1, 1, 1, 3);
INSERT INTO `staging` VALUES (874, 'Nghệ An, Việt Nam', '2024-12-06T09:00:00', 22.90, 22.90, 20.20, 84.77, 0.00, 32.30, 'None', 0.00, 0.00, 7.20, 7.90, 297.90, 1015, 96.2, 24.1, 336, 1.2, 3, 10, 'Overcast', 'cloudy', 'None', 37, 'VN865', 7280, 10, 1, 2, 2, 7, 2, 1, 1, 1, 2, 1);
INSERT INTO `staging` VALUES (875, 'Nghệ An, Việt Nam', '2024-12-06T10:00:00', 23.20, 23.20, 20.00, 82.22, 0.00, 32.30, 'None', 0.00, 0.00, 4.30, 4.30, 293.90, 1015, 98.1, 24.1, 259, 0.9, 3, 10, 'Overcast', 'cloudy', 'None', 37, 'VN865', 7280, 11, 1, 2, 2, 7, 2, 1, 1, 3, 2, 1);
INSERT INTO `staging` VALUES (876, 'Nghệ An, Việt Nam', '2024-12-06T11:00:00', 23.90, 23.90, 20.00, 78.82, 0.00, 32.30, 'None', 0.00, 0.00, 2.90, 1.40, 347.90, 1014, 96.9, 24.1, 420, 1.5, 4, 10, 'Overcast', 'cloudy', 'None', 37, 'VN865', 7280, 12, 1, 2, 2, 4, 2, 1, 1, 3, 2, 1);
INSERT INTO `staging` VALUES (877, 'Nghệ An, Việt Nam', '2024-12-06T12:00:00', 23.90, 23.90, 20.10, 79.31, 0.00, 32.30, '[rain]', 0.00, 0.00, 3.20, 4.30, 77.70, 1013, 100, 24.1, 407, 1.5, 4, 10, 'Overcast', 'cloudy', 'None', 37, 'VN865', 7280, 13, 1, 1, 2, 3, 2, 1, 1, 3, 2, 1);
INSERT INTO `staging` VALUES (878, 'Nghệ An, Việt Nam', '2024-12-06T13:00:00', 23.70, 23.70, 20.30, 81.27, 0.00, 32.30, '[rain]', 0.00, 0.00, 7.60, 9.00, 104.20, 1012, 100, 24.1, 283, 1, 3, 10, 'Overcast', 'cloudy', 'None', 37, 'VN865', 7280, 14, 1, 1, 2, 2, 2, 1, 1, 1, 2, 1);
INSERT INTO `staging` VALUES (879, 'Nghệ An, Việt Nam', '2024-12-06T14:00:00', 23.00, 23.00, 20.50, 85.83, 0.10, 90.30, '[rain]', 0.00, 0.00, 10.80, 11.20, 110.10, 1011, 100, 24.1, 127, 0.5, 1, 10, 'Rain, Overcast', 'rain', 'None', 37, 'VN865', 7280, 15, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (880, 'Nghệ An, Việt Nam', '2024-12-06T15:00:00', 22.60, 22.60, 20.50, 87.94, 0.00, 90.30, '[rain]', 0.00, 0.00, 10.80, 9.00, 120.10, 1011, 98.9, 24.1, 67, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 37, 'VN865', 7280, 16, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (881, 'Nghệ An, Việt Nam', '2024-12-06T16:00:00', 22.60, 22.60, 20.50, 87.94, 0.10, 90.30, '[rain]', 0.00, 0.00, 10.10, 7.20, 130.10, 1011, 95.2, 24.1, 46, 0.2, 0, 10, 'Rain, Overcast', 'rain', 'None', 37, 'VN865', 7280, 17, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (882, 'Nghệ An, Việt Nam', '2024-12-06T17:00:00', 22.70, 22.70, 20.50, 87.41, 0.00, 90.30, '[rain]', 0.00, 0.00, 11.20, 7.20, 132.60, 1012, 95.1, 24.1, 34, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 37, 'VN865', 7280, 18, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (883, 'Nghệ An, Việt Nam', '2024-12-06T18:00:00', 22.70, 22.70, 20.50, 87.41, 0.00, 90.30, '[rain]', 0.00, 0.00, 17.60, 10.10, 135.70, 1012, 72.6, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 37, 'VN865', 7280, 19, 1, 1, 3, 1, 1, 1, 1, 1, 1, 6);
INSERT INTO `staging` VALUES (884, 'Nghệ An, Việt Nam', '2024-12-06T19:00:00', 22.70, 22.70, 20.50, 87.41, 0.00, 90.30, '[rain]', 0.00, 0.00, 19.40, 10.40, 138.50, 1013, 71.7, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 37, 'VN865', 7280, 20, 1, 1, 3, 1, 1, 1, 1, 1, 1, 6);
INSERT INTO `staging` VALUES (885, 'Nghệ An, Việt Nam', '2024-12-06T20:00:00', 22.80, 22.80, 20.60, 87.41, 0.00, 12.90, 'None', 0.00, 0.00, 20.20, 9.70, 139.80, 1013, 65.6, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 37, 'VN865', 7280, 21, 1, 2, 6, 1, 4, 1, 1, 1, 1, 6);
INSERT INTO `staging` VALUES (886, 'Nghệ An, Việt Nam', '2024-12-06T21:00:00', 22.90, 22.90, 20.80, 87.96, 0.10, 12.90, '[rain]', 0.00, 0.00, 17.60, 10.80, 138.40, 1014, 55.3, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 37, 'VN865', 7280, 22, 1, 1, 6, 1, 4, 1, 1, 1, 1, 3);
INSERT INTO `staging` VALUES (887, 'Nghệ An, Việt Nam', '2024-12-06T22:00:00', 22.90, 22.90, 20.80, 87.96, 0.10, 12.90, '[rain]', 0.00, 0.00, 18.70, 11.90, 142.30, 1014, 45, 23.7, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 37, 'VN865', 7280, 23, 1, 1, 6, 1, 4, 1, 1, 2, 1, 3);
INSERT INTO `staging` VALUES (888, 'Nghệ An, Việt Nam', '2024-12-06T23:00:00', 22.70, 22.70, 20.70, 88.49, 0.10, 12.90, '[rain]', 0.00, 0.00, 16.90, 10.10, 150.70, 1014, 55.8, 23.3, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 37, 'VN865', 7280, 24, 1, 1, 6, 1, 4, 1, 1, 1, 1, 3);
INSERT INTO `staging` VALUES (889, 'Ninh Bình, Việt Nam', '2024-12-06T00:00:00', 22.00, 22.00, 19.70, 86.80, 0.00, 0.00, 'None', 0.00, 0.00, 15.50, 7.20, 105.60, 1014, 91.8, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 38, 'VN889', 7280, 1, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (890, 'Ninh Bình, Việt Nam', '2024-12-06T01:00:00', 22.20, 22.20, 19.80, 86.28, 0.00, 0.00, 'None', 0.00, 0.00, 17.60, 7.90, 92.50, 1014, 59.5, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 38, 'VN889', 7280, 2, 1, 2, 6, 2, 4, 1, 1, 1, 1, 3);
INSERT INTO `staging` VALUES (891, 'Ninh Bình, Việt Nam', '2024-12-06T02:00:00', 21.90, 21.90, 19.70, 87.33, 0.10, 96.80, '[rain]', 0.00, 0.00, 15.50, 7.90, 92.70, 1013, 9.5, 24.1, 0, 0, 0, 10, 'Rain', 'rain', 'None', 38, 'VN889', 7280, 3, 1, 1, 4, 2, 1, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (892, 'Ninh Bình, Việt Nam', '2024-12-06T03:00:00', 21.50, 21.50, 19.70, 89.50, 0.00, 96.80, '[rain]', 0.00, 0.00, 17.30, 7.90, 92.60, 1013, 54.7, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 38, 'VN889', 7280, 4, 1, 1, 3, 2, 1, 1, 1, 1, 1, 3);
INSERT INTO `staging` VALUES (893, 'Ninh Bình, Việt Nam', '2024-12-06T04:00:00', 21.80, 21.80, 19.90, 88.97, 0.20, 96.80, '[rain]', 0.00, 0.00, 21.20, 8.30, 86.20, 1013, 99, 22.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 38, 'VN889', 7280, 5, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (894, 'Ninh Bình, Việt Nam', '2024-12-06T05:00:00', 22.10, 22.10, 20.00, 87.89, 0.30, 96.80, '[rain]', 0.00, 0.00, 23.00, 9.70, 83.40, 1013, 98.9, 13.5, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 38, 'VN889', 7280, 6, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (895, 'Ninh Bình, Việt Nam', '2024-12-06T06:00:00', 22.40, 22.40, 20.00, 86.30, 0.60, 96.80, '[rain]', 0.00, 0.00, 24.10, 11.50, 93.00, 1014, 100, 12.3, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 38, 'VN889', 7280, 7, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (896, 'Ninh Bình, Việt Nam', '2024-12-06T07:00:00', 22.50, 22.50, 19.90, 85.25, 0.40, 96.80, '[rain]', 0.00, 0.00, 24.80, 12.60, 96.00, 1014, 100, 15.2, 4, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 38, 'VN889', 7280, 8, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (897, 'Ninh Bình, Việt Nam', '2024-12-06T08:00:00', 22.70, 22.70, 19.90, 84.22, 0.40, 77.40, '[rain]', 0.00, 0.00, 24.80, 13.30, 92.80, 1015, 100, 15.4, 18, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 38, 'VN889', 7280, 9, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (898, 'Ninh Bình, Việt Nam', '2024-12-06T09:00:00', 23.00, 23.00, 19.90, 82.70, 0.40, 77.40, '[rain]', 0.00, 0.00, 22.70, 13.30, 90.80, 1015, 100, 17.6, 41, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 38, 'VN889', 7280, 10, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (899, 'Ninh Bình, Việt Nam', '2024-12-06T10:00:00', 23.30, 23.30, 19.90, 81.22, 0.20, 77.40, '[rain]', 0.00, 0.00, 20.90, 12.60, 95.20, 1015, 74.9, 23.1, 55, 0.2, 1, 10, 'Rain, Partially cloudy', 'rain', 'None', 38, 'VN889', 7280, 11, 1, 1, 3, 2, 1, 1, 1, 5, 1, 6);
INSERT INTO `staging` VALUES (900, 'Ninh Bình, Việt Nam', '2024-12-06T11:00:00', 24.90, 24.90, 19.60, 72.42, 0.10, 77.40, '[rain]', 0.00, 0.00, 15.10, 13.30, 92.40, 1014, 53.1, 23, 363, 1.3, 4, 10, 'Rain, Partially cloudy', 'rain', 'None', 38, 'VN889', 7280, 12, 1, 1, 3, 2, 1, 1, 1, 5, 2, 3);
INSERT INTO `staging` VALUES (901, 'Ninh Bình, Việt Nam', '2024-12-06T12:00:00', 26.20, 26.20, 19.30, 65.80, 0.30, 77.40, '[rain]', 0.00, 0.00, 13.30, 13.00, 88.60, 1013, 45.1, 21.6, 589, 2.1, 6, 10, 'Rain, Partially cloudy', 'rain', 'None', 38, 'VN889', 7280, 13, 1, 1, 3, 3, 1, 1, 2, 5, 3, 3);
INSERT INTO `staging` VALUES (902, 'Ninh Bình, Việt Nam', '2024-12-06T13:00:00', 26.70, 26.70, 19.00, 62.70, 0.10, 77.40, '[rain]', 0.00, 0.00, 12.60, 12.60, 85.50, 1012, 52.5, 24.1, 581, 2.1, 6, 10, 'Rain, Partially cloudy', 'rain', 'None', 38, 'VN889', 7280, 14, 1, 1, 3, 3, 1, 1, 2, 5, 3, 3);
INSERT INTO `staging` VALUES (903, 'Ninh Bình, Việt Nam', '2024-12-06T14:00:00', 26.60, 26.60, 19.00, 63.07, 0.10, 45.20, '[rain]', 0.00, 0.00, 13.70, 14.40, 98.70, 1011, 61.9, 24, 451, 1.6, 5, 10, 'Rain, Partially cloudy', 'rain', 'None', 38, 'VN889', 7280, 15, 1, 1, 3, 2, 1, 1, 2, 5, 2, 6);
INSERT INTO `staging` VALUES (904, 'Ninh Bình, Việt Nam', '2024-12-06T15:00:00', 25.70, 25.70, 19.10, 66.93, 0.20, 45.20, '[rain]', 0.00, 0.00, 17.30, 17.30, 109.30, 1011, 87.9, 23.1, 268, 1, 3, 10, 'Rain, Partially cloudy', 'rain', 'None', 38, 'VN889', 7280, 16, 1, 1, 3, 2, 1, 1, 2, 5, 2, 1);
INSERT INTO `staging` VALUES (905, 'Ninh Bình, Việt Nam', '2024-12-06T16:00:00', 24.80, 24.80, 19.40, 71.95, 0.00, 45.20, '[rain]', 0.00, 0.00, 19.40, 15.80, 108.10, 1011, 82.5, 24.1, 95, 0.3, 1, 10, 'Rain, Partially cloudy', 'rain', 'None', 38, 'VN889', 7280, 17, 1, 1, 3, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (906, 'Ninh Bình, Việt Nam', '2024-12-06T17:00:00', 24.10, 24.10, 19.60, 75.97, 0.00, 45.20, '[rain]', 0.00, 0.00, 23.00, 16.20, 107.60, 1012, 93, 24.1, 48, 0.2, 0, 10, 'Rain, Overcast', 'rain', 'None', 38, 'VN889', 7280, 18, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (907, 'Ninh Bình, Việt Nam', '2024-12-06T18:00:00', 23.40, 23.40, 19.70, 79.73, 0.00, 45.20, '[rain]', 0.00, 0.00, 24.50, 16.20, 102.00, 1012, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 38, 'VN889', 7280, 19, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (908, 'Ninh Bình, Việt Nam', '2024-12-06T19:00:00', 23.20, 23.20, 19.60, 80.20, 0.00, 45.20, '[rain]', 0.00, 0.00, 24.10, 15.80, 101.00, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 38, 'VN889', 7280, 20, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (909, 'Ninh Bình, Việt Nam', '2024-12-06T20:00:00', 23.00, 23.00, 19.40, 80.18, 0.10, 51.60, '[rain]', 0.00, 0.00, 25.60, 15.80, 101.10, 1014, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 38, 'VN889', 7280, 21, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (910, 'Ninh Bình, Việt Nam', '2024-12-06T21:00:00', 23.00, 23.00, 19.30, 79.68, 0.00, 51.60, '[rain]', 0.00, 0.00, 27.00, 16.60, 102.30, 1014, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 38, 'VN889', 7280, 22, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (911, 'Ninh Bình, Việt Nam', '2024-12-06T22:00:00', 22.90, 22.90, 19.10, 79.17, 0.00, 51.60, '[rain]', 0.00, 0.00, 29.20, 17.30, 102.30, 1014, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 38, 'VN889', 7280, 23, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (912, 'Ninh Bình, Việt Nam', '2024-12-06T23:00:00', 22.60, 22.60, 19.20, 81.13, 0.00, 51.60, '[rain]', 0.00, 0.00, 29.50, 17.60, 99.60, 1015, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 38, 'VN889', 7280, 24, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (913, 'Ninh Thuận, Việt Nam', '2024-12-06T00:00:00', 24.30, 24.30, 20.70, 80.35, 0.00, 0.00, 'None', 0.00, 0.00, 19.10, 11.90, 358.40, 1009, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 39, 'VN913', 7280, 1, 1, 2, 2, 4, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (914, 'Ninh Thuận, Việt Nam', '2024-12-06T01:00:00', 24.10, 24.10, 20.60, 80.82, 0.00, 0.00, 'None', 0.00, 0.00, 15.80, 10.40, 352.30, 1009, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 39, 'VN913', 7280, 2, 1, 2, 2, 4, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (915, 'Ninh Thuận, Việt Nam', '2024-12-06T02:00:00', 23.90, 23.90, 20.60, 81.80, 0.00, 3.20, 'None', 0.00, 0.00, 14.80, 10.40, 348.30, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 39, 'VN913', 7280, 3, 1, 2, 2, 4, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (916, 'Ninh Thuận, Việt Nam', '2024-12-06T03:00:00', 23.80, 23.80, 20.50, 81.78, 0.00, 3.20, 'None', 0.00, 0.00, 16.60, 11.20, 349.40, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 39, 'VN913', 7280, 4, 1, 2, 2, 4, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (917, 'Ninh Thuận, Việt Nam', '2024-12-06T04:00:00', 23.90, 23.90, 20.40, 80.79, 0.00, 3.20, 'None', 0.00, 0.00, 17.30, 11.50, 347.30, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 39, 'VN913', 7280, 5, 1, 2, 2, 4, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (918, 'Ninh Thuận, Việt Nam', '2024-12-06T05:00:00', 23.90, 23.90, 20.30, 80.30, 0.00, 3.20, 'None', 0.00, 0.00, 16.60, 10.80, 348.10, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 39, 'VN913', 7280, 6, 1, 2, 2, 4, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (919, 'Ninh Thuận, Việt Nam', '2024-12-06T06:00:00', 23.80, 23.80, 20.20, 80.28, 0.00, 3.20, 'None', 0.00, 0.00, 15.80, 10.80, 349.40, 1009, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 39, 'VN913', 7280, 7, 1, 2, 2, 4, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (920, 'Ninh Thuận, Việt Nam', '2024-12-06T07:00:00', 24.60, 24.60, 20.80, 79.41, 0.00, 3.20, 'None', 0.00, 0.00, 17.60, 10.10, 344.50, 1009, 100, 24.1, 61, 0.2, 1, 10, 'Overcast', 'cloudy', 'None', 39, 'VN913', 7280, 8, 1, 2, 2, 4, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (921, 'Ninh Thuận, Việt Nam', '2024-12-06T08:00:00', 26.10, 26.10, 21.30, 74.89, 0.00, 9.70, 'None', 0.00, 0.00, 20.20, 11.50, 359.10, 1010, 73.7, 24.1, 224, 0.8, 2, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 39, 'VN913', 7280, 9, 1, 2, 6, 4, 5, 1, 1, 2, 1, 6);
INSERT INTO `staging` VALUES (922, 'Ninh Thuận, Việt Nam', '2024-12-06T09:00:00', 27.90, 30.40, 22.00, 70.32, 0.00, 9.70, 'None', 0.00, 0.00, 24.80, 16.20, 16.40, 1010, 27.7, 24.1, 477, 1.7, 5, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 39, 'VN913', 7280, 10, 1, 2, 6, 5, 5, 1, 1, 5, 2, 4);
INSERT INTO `staging` VALUES (923, 'Ninh Thuận, Việt Nam', '2024-12-06T10:00:00', 29.20, 32.40, 22.30, 66.41, 0.00, 9.70, 'None', 0.00, 0.00, 29.20, 19.80, 25.80, 1010, 15.3, 24.1, 677, 2.4, 7, 10, 'Clear', 'clear-day', 'None', 39, 'VN913', 7280, 11, 1, 2, 5, 5, 6, 1, 2, 2, 3, 5);
INSERT INTO `staging` VALUES (924, 'Ninh Thuận, Việt Nam', '2024-12-06T11:00:00', 29.80, 33.30, 22.50, 64.94, 0.00, 9.70, 'None', 0.00, 0.00, 29.50, 22.00, 32.60, 1009, 84.8, 24.1, 796, 2.9, 8, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 39, 'VN913', 7280, 12, 1, 2, 6, 5, 5, 1, 2, 7, 4, 1);
INSERT INTO `staging` VALUES (925, 'Ninh Thuận, Việt Nam', '2024-12-06T12:00:00', 30.00, 33.60, 22.50, 64.19, 0.00, 9.70, 'None', 0.00, 0.00, 30.20, 23.80, 37.40, 1008, 96.2, 24.1, 824, 3, 8, 10, 'Overcast', 'cloudy', 'None', 39, 'VN913', 7280, 13, 1, 2, 2, 5, 2, 1, 2, 7, 4, 1);
INSERT INTO `staging` VALUES (926, 'Ninh Thuận, Việt Nam', '2024-12-06T13:00:00', 29.70, 33.30, 22.60, 65.71, 0.00, 9.70, 'None', 0.00, 0.00, 31.00, 24.80, 40.00, 1007, 57.4, 24.1, 771, 2.8, 8, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 39, 'VN913', 7280, 14, 1, 2, 6, 5, 5, 1, 2, 7, 4, 3);
INSERT INTO `staging` VALUES (927, 'Ninh Thuận, Việt Nam', '2024-12-06T14:00:00', 28.80, 32.10, 22.60, 69.22, 0.00, 16.10, 'None', 0.00, 0.00, 29.20, 23.80, 40.70, 1007, 62.9, 24.1, 542, 2, 5, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 39, 'VN913', 7280, 15, 1, 2, 6, 5, 5, 1, 2, 7, 2, 6);
INSERT INTO `staging` VALUES (928, 'Ninh Thuận, Việt Nam', '2024-12-06T15:00:00', 27.60, 30.30, 22.60, 74.23, 0.00, 16.10, 'None', 0.00, 0.00, 28.10, 22.00, 39.50, 1007, 80.3, 24.1, 317, 1.1, 3, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 39, 'VN913', 7280, 16, 1, 2, 6, 5, 5, 1, 1, 7, 2, 2);
INSERT INTO `staging` VALUES (929, 'Ninh Thuận, Việt Nam', '2024-12-06T16:00:00', 26.70, 26.70, 22.60, 78.26, 0.10, 16.10, '[rain]', 0.00, 0.00, 27.70, 19.10, 33.80, 1007, 95.4, 24.1, 199, 0.7, 2, 10, 'Overcast', 'cloudy', 'None', 39, 'VN913', 7280, 17, 1, 1, 2, 5, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (930, 'Ninh Thuận, Việt Nam', '2024-12-06T17:00:00', 25.90, 25.90, 22.60, 82.04, 0.00, 16.10, 'None', 0.00, 0.00, 27.00, 16.20, 27.20, 1008, 99.7, 24.1, 77, 0.3, 1, 10, 'Overcast', 'cloudy', 'None', 39, 'VN913', 7280, 18, 1, 2, 2, 5, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (931, 'Ninh Thuận, Việt Nam', '2024-12-06T18:00:00', 25.40, 25.40, 22.30, 82.99, 0.00, 16.10, 'None', 0.00, 0.00, 25.60, 15.10, 23.90, 1008, 98.3, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 39, 'VN913', 7280, 19, 1, 2, 2, 5, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (932, 'Ninh Thuận, Việt Nam', '2024-12-06T19:00:00', 25.30, 25.30, 22.10, 82.47, 0.10, 16.10, '[rain]', 0.00, 0.00, 25.20, 14.40, 21.80, 1009, 88.7, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 39, 'VN913', 7280, 20, 1, 1, 6, 5, 4, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (933, 'Ninh Thuận, Việt Nam', '2024-12-06T20:00:00', 24.70, 24.70, 22.20, 86.00, 0.10, 0.00, '[rain]', 0.00, 0.00, 22.30, 13.00, 24.40, 1010, 98.5, 18.3, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 39, 'VN913', 7280, 21, 1, 1, 2, 5, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (934, 'Ninh Thuận, Việt Nam', '2024-12-06T21:00:00', 25.00, 25.00, 22.20, 84.47, 0.00, 0.00, 'None', 0.00, 0.00, 23.80, 13.00, 15.80, 1010, 100, 20.3, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 39, 'VN913', 7280, 22, 1, 2, 2, 5, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (935, 'Ninh Thuận, Việt Nam', '2024-12-06T22:00:00', 24.90, 24.90, 22.20, 84.98, 0.10, 0.00, '[rain]', 0.00, 0.00, 23.80, 13.00, 6.30, 1010, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 39, 'VN913', 7280, 23, 1, 1, 2, 5, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (936, 'Ninh Thuận, Việt Nam', '2024-12-06T23:00:00', 24.80, 24.80, 22.20, 85.48, 0.00, 0.00, 'None', 0.00, 0.00, 22.70, 12.20, 4.80, 1010, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 39, 'VN913', 7280, 24, 1, 2, 2, 5, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (937, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T00:00:00', 22.30, 22.30, 17.80, 75.68, 0.00, 6.50, 'None', 0.00, 0.00, 33.10, 18.00, 120.00, 1013, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 40, 'VN937', 7280, 1, 1, 2, 2, 2, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (938, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T01:00:00', 22.20, 22.20, 17.80, 76.15, 0.00, 6.50, 'None', 0.00, 0.00, 31.00, 15.50, 114.30, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 40, 'VN937', 7280, 2, 1, 2, 2, 2, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (939, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T02:00:00', 22.00, 22.00, 17.80, 77.08, 0.10, 100.00, '[rain]', 0.00, 0.00, 30.60, 14.40, 109.00, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 3, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (940, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T03:00:00', 21.80, 21.80, 17.80, 78.03, 0.00, 100.00, '[rain]', 0.00, 0.00, 27.40, 11.20, 103.80, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 4, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (941, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T04:00:00', 21.60, 21.60, 17.80, 78.99, 0.10, 100.00, '[rain]', 0.00, 0.00, 22.70, 8.30, 105.10, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 5, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (942, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T05:00:00', 21.50, 21.50, 17.80, 79.47, 0.10, 100.00, '[rain]', 0.00, 0.00, 20.90, 8.30, 117.80, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 6, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (943, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T06:00:00', 21.30, 21.30, 17.90, 80.96, 0.10, 100.00, '[rain]', 0.00, 0.00, 22.30, 8.30, 127.60, 1014, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 7, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (944, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T07:00:00', 21.00, 21.00, 17.90, 82.46, 0.10, 100.00, '[rain]', 0.00, 0.00, 26.60, 10.80, 145.80, 1014, 100, 24.1, 1, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 8, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (945, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T08:00:00', 20.80, 20.80, 17.90, 83.48, 0.10, 96.80, '[rain]', 0.00, 0.00, 26.30, 9.70, 136.70, 1015, 98, 24.1, 7, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 9, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (946, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T09:00:00', 21.50, 21.50, 17.90, 79.97, 0.10, 96.80, '[rain]', 0.00, 0.00, 18.00, 10.10, 145.70, 1016, 100, 24.1, 47, 0.2, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 10, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (947, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T10:00:00', 21.40, 21.40, 18.00, 80.97, 0.10, 96.80, '[rain]', 0.00, 0.00, 15.50, 8.30, 131.00, 1015, 100, 24, 13, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 11, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (948, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T11:00:00', 20.50, 20.50, 18.20, 86.66, 1.00, 96.80, '[rain]', 0.00, 0.00, 11.90, 6.10, 146.50, 1015, 100, 8.9, 14, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 12, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (949, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T12:00:00', 20.20, 20.20, 18.30, 88.84, 0.80, 96.80, '[rain]', 0.00, 0.00, 9.40, 4.30, 128.00, 1014, 100, 19.1, 17, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 13, 1, 1, 1, 2, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (950, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T13:00:00', 20.30, 20.30, 18.40, 88.85, 0.30, 96.80, '[rain]', 0.00, 0.00, 5.80, 2.20, 69.90, 1012, 100, 24.1, 17, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 14, 1, 1, 1, 3, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (951, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T14:00:00', 20.20, 20.20, 18.50, 89.96, 0.40, 87.10, '[rain]', 0.00, 0.00, 3.60, 2.90, 343.50, 1012, 100, 19.8, 19, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 15, 1, 1, 1, 4, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (952, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T15:00:00', 19.90, 19.90, 18.60, 92.22, 0.50, 87.10, '[rain]', 0.00, 0.00, 5.00, 3.60, 313.60, 1011, 100, 12.5, 11, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 16, 1, 1, 1, 7, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (953, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T16:00:00', 19.70, 19.70, 18.70, 93.96, 0.90, 87.10, '[rain]', 0.00, 0.00, 7.20, 5.40, 310.10, 1012, 100, 12, 5, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 17, 1, 1, 1, 7, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (954, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T17:00:00', 19.80, 19.80, 18.70, 93.38, 0.40, 87.10, '[rain]', 0.00, 0.00, 7.20, 4.70, 347.20, 1013, 100, 24.1, 2, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 18, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (955, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T18:00:00', 19.90, 19.90, 18.80, 93.38, 0.10, 87.10, '[rain]', 0.00, 0.00, 5.00, 3.60, 334.00, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 19, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (956, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T19:00:00', 19.80, 19.80, 18.90, 94.55, 0.60, 87.10, '[rain]', 0.00, 0.00, 4.30, 3.20, 337.10, 1014, 100, 8.3, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 20, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (957, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T20:00:00', 19.70, 19.70, 18.90, 95.14, 1.20, 93.50, '[rain]', 0.00, 0.00, 6.10, 3.60, 21.50, 1014, 100, 9.9, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 21, 1, 1, 1, 5, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (958, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T21:00:00', 19.60, 19.60, 18.80, 95.14, 1.30, 93.50, '[rain]', 0.00, 0.00, 4.70, 3.20, 12.80, 1015, 100, 9.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 22, 1, 1, 1, 5, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (959, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T22:00:00', 19.40, 19.40, 18.80, 96.33, 1.80, 93.50, '[rain]', 0.00, 0.00, 5.40, 4.30, 19.90, 1015, 100, 9, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 23, 1, 1, 1, 5, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (960, 'Thị Xã Phú Thọ, Việt Nam', '2024-12-06T23:00:00', 19.20, 19.20, 18.60, 96.32, 1.50, 93.50, '[rain]', 0.00, 0.00, 7.20, 5.80, 346.20, 1015, 100, 5.4, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 40, 'VN937', 7280, 24, 1, 1, 1, 4, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (961, 'Phú Yên, Việt Nam', '2024-12-06T00:00:00', 22.20, 22.20, 21.10, 93.49, 0.10, 48.40, '[rain]', 0.00, 0.00, 7.60, 2.50, 274.60, 1011, 77.6, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 41, 'VN961', 7280, 1, 1, 1, 3, 7, 1, 1, 3, 3, 1, 6);
INSERT INTO `staging` VALUES (962, 'Phú Yên, Việt Nam', '2024-12-06T01:00:00', 22.10, 22.10, 20.90, 92.92, 0.00, 48.40, '[rain]', 0.00, 0.00, 6.50, 2.90, 286.70, 1011, 56, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 41, 'VN961', 7280, 2, 1, 1, 3, 7, 1, 1, 3, 3, 1, 3);
INSERT INTO `staging` VALUES (963, 'Phú Yên, Việt Nam', '2024-12-06T02:00:00', 21.90, 21.90, 20.80, 93.48, 0.00, 58.10, '[rain]', 0.00, 0.00, 6.80, 3.60, 288.60, 1010, 71.2, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 41, 'VN961', 7280, 3, 1, 1, 3, 7, 1, 1, 3, 3, 1, 6);
INSERT INTO `staging` VALUES (964, 'Phú Yên, Việt Nam', '2024-12-06T03:00:00', 22.00, 22.00, 20.90, 93.48, 0.00, 58.10, '[rain]', 0.00, 0.00, 6.50, 3.60, 288.20, 1010, 81.9, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 41, 'VN961', 7280, 4, 1, 1, 3, 7, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (965, 'Phú Yên, Việt Nam', '2024-12-06T04:00:00', 22.10, 22.10, 20.90, 92.92, 0.00, 58.10, '[rain]', 0.00, 0.00, 6.50, 4.00, 291.80, 1010, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 41, 'VN961', 7280, 5, 1, 1, 1, 7, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (966, 'Phú Yên, Việt Nam', '2024-12-06T05:00:00', 22.20, 22.20, 21.00, 92.92, 0.00, 58.10, '[rain]', 0.00, 0.00, 6.10, 3.20, 295.90, 1011, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 41, 'VN961', 7280, 6, 1, 1, 1, 7, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (967, 'Phú Yên, Việt Nam', '2024-12-06T06:00:00', 22.20, 22.20, 21.10, 93.49, 0.10, 58.10, '[rain]', 0.00, 0.00, 5.40, 2.90, 313.50, 1011, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 41, 'VN961', 7280, 7, 1, 1, 1, 7, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (968, 'Phú Yên, Việt Nam', '2024-12-06T07:00:00', 22.30, 22.30, 21.30, 94.07, 0.10, 58.10, '[rain]', 0.00, 0.00, 7.90, 4.00, 327.90, 1012, 100, 24.1, 6, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 41, 'VN961', 7280, 8, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (969, 'Phú Yên, Việt Nam', '2024-12-06T08:00:00', 22.50, 22.50, 21.50, 94.08, 0.00, 93.50, '[rain]', 0.00, 0.00, 18.00, 5.00, 352.90, 1012, 100, 20.8, 20, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 41, 'VN961', 7280, 9, 1, 1, 1, 4, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (970, 'Phú Yên, Việt Nam', '2024-12-06T09:00:00', 22.50, 22.50, 21.60, 94.66, 0.20, 93.50, '[rain]', 0.00, 0.00, 16.90, 4.30, 349.30, 1013, 100, 23.4, 28, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 41, 'VN961', 7280, 10, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (971, 'Phú Yên, Việt Nam', '2024-12-06T10:00:00', 22.60, 22.60, 21.80, 95.24, 0.10, 93.50, '[rain]', 0.00, 0.00, 15.80, 4.30, 332.50, 1013, 100, 15.8, 38, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 41, 'VN961', 7280, 11, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (972, 'Phú Yên, Việt Nam', '2024-12-06T11:00:00', 22.90, 22.90, 21.90, 94.10, 0.10, 93.50, '[rain]', 0.00, 0.00, 16.20, 4.70, 331.50, 1012, 100, 11.3, 54, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 41, 'VN961', 7280, 12, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (973, 'Phú Yên, Việt Nam', '2024-12-06T12:00:00', 23.20, 23.20, 22.10, 93.54, 0.10, 93.50, '[rain]', 0.00, 0.00, 18.70, 5.00, 347.70, 1011, 100, 10.8, 64, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 41, 'VN961', 7280, 13, 1, 1, 1, 4, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (974, 'Phú Yên, Việt Nam', '2024-12-06T13:00:00', 23.50, 23.50, 22.40, 93.55, 0.10, 93.50, '[rain]', 0.00, 0.00, 21.20, 6.50, 357.30, 1010, 99.1, 10.5, 67, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 41, 'VN961', 7280, 14, 1, 1, 1, 4, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (975, 'Phú Yên, Việt Nam', '2024-12-06T14:00:00', 23.60, 23.60, 22.50, 93.56, 0.20, 96.80, '[rain]', 0.00, 0.00, 22.70, 7.60, 354.70, 1009, 93.2, 9.9, 71, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 41, 'VN961', 7280, 15, 1, 1, 1, 4, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (976, 'Phú Yên, Việt Nam', '2024-12-06T15:00:00', 23.80, 23.80, 22.70, 93.57, 0.30, 96.80, '[rain]', 0.00, 0.00, 25.20, 9.40, 359.80, 1009, 89.6, 11.3, 85, 0.3, 1, 10, 'Rain, Partially cloudy', 'rain', 'None', 41, 'VN961', 7280, 16, 1, 1, 3, 4, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (977, 'Phú Yên, Việt Nam', '2024-12-06T16:00:00', 23.70, 23.70, 22.60, 93.56, 0.40, 96.80, '[rain]', 0.00, 0.00, 27.00, 10.80, 5.50, 1009, 97.6, 15.4, 64, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 41, 'VN961', 7280, 17, 1, 1, 1, 5, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (978, 'Phú Yên, Việt Nam', '2024-12-06T17:00:00', 23.40, 23.40, 22.50, 94.69, 0.40, 96.80, '[rain]', 0.00, 0.00, 26.30, 10.40, 10.00, 1010, 100, 18.2, 33, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 41, 'VN961', 7280, 18, 1, 1, 1, 5, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (979, 'Phú Yên, Việt Nam', '2024-12-06T18:00:00', 23.10, 23.10, 22.40, 95.84, 0.40, 96.80, '[rain]', 0.00, 0.00, 27.40, 9.70, 12.60, 1010, 100, 22.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 41, 'VN961', 7280, 19, 1, 1, 1, 5, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (980, 'Phú Yên, Việt Nam', '2024-12-06T19:00:00', 23.20, 23.20, 22.40, 95.26, 0.40, 96.80, '[rain]', 0.00, 0.00, 28.10, 10.10, 12.90, 1011, 99.9, 13.5, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 41, 'VN961', 7280, 20, 1, 1, 1, 5, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (981, 'Phú Yên, Việt Nam', '2024-12-06T20:00:00', 23.20, 23.20, 22.40, 95.26, 0.50, 71.00, '[rain]', 0.00, 0.00, 28.10, 9.40, 14.50, 1012, 100, 13.2, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 41, 'VN961', 7280, 21, 1, 1, 1, 5, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (982, 'Phú Yên, Việt Nam', '2024-12-06T21:00:00', 23.20, 23.20, 22.30, 94.69, 0.30, 71.00, '[rain]', 0.00, 0.00, 28.80, 9.70, 8.30, 1012, 86.6, 13.8, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 41, 'VN961', 7280, 22, 1, 1, 3, 5, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (983, 'Phú Yên, Việt Nam', '2024-12-06T22:00:00', 23.10, 23.10, 22.30, 95.26, 0.30, 71.00, '[rain]', 0.00, 0.00, 28.40, 9.70, 8.40, 1012, 96.4, 12.3, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 41, 'VN961', 7280, 23, 1, 1, 1, 5, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (984, 'Phú Yên, Việt Nam', '2024-12-06T23:00:00', 23.00, 23.00, 22.20, 95.26, 0.40, 71.00, '[rain]', 0.00, 0.00, 25.60, 8.60, 6.00, 1012, 100, 12.4, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 41, 'VN961', 7280, 24, 1, 1, 1, 5, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (985, 'Quảng Bình, Việt Nam', '2024-12-06T00:00:00', 20.50, 20.50, 18.90, 90.55, 0.00, 41.90, 'None', 0.00, 0.00, 5.00, 4.00, 317.80, 1014, 74.3, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 42, 'VN985', 7280, 1, 1, 2, 6, 4, 4, 1, 3, 3, 1, 6);
INSERT INTO `staging` VALUES (986, 'Quảng Bình, Việt Nam', '2024-12-06T01:00:00', 20.60, 20.60, 19.10, 91.12, 0.00, 41.90, 'None', 0.00, 0.00, 6.80, 5.00, 319.30, 1013, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 42, 'VN985', 7280, 2, 1, 2, 2, 4, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (987, 'Quảng Bình, Việt Nam', '2024-12-06T02:00:00', 20.60, 20.60, 19.30, 92.26, 0.00, 93.50, '[rain]', 0.00, 0.00, 8.30, 5.40, 324.00, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 42, 'VN985', 7280, 3, 1, 1, 1, 4, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (988, 'Quảng Bình, Việt Nam', '2024-12-06T03:00:00', 20.40, 20.40, 19.20, 92.83, 0.00, 93.50, '[rain]', 0.00, 0.00, 9.00, 5.00, 320.00, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 42, 'VN985', 7280, 4, 1, 1, 1, 4, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (989, 'Quảng Bình, Việt Nam', '2024-12-06T04:00:00', 20.40, 20.40, 19.20, 92.83, 0.10, 93.50, '[rain]', 0.00, 0.00, 7.90, 4.30, 315.60, 1013, 100, 23.9, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 42, 'VN985', 7280, 5, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (990, 'Quảng Bình, Việt Nam', '2024-12-06T05:00:00', 20.40, 20.40, 19.10, 92.25, 0.00, 93.50, '[rain]', 0.00, 0.00, 5.80, 3.20, 312.20, 1013, 100, 23.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 42, 'VN985', 7280, 6, 1, 1, 1, 7, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (991, 'Quảng Bình, Việt Nam', '2024-12-06T06:00:00', 20.40, 20.40, 19.10, 92.25, 0.00, 93.50, '[rain]', 0.00, 0.00, 4.00, 2.90, 305.30, 1014, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 42, 'VN985', 7280, 7, 1, 1, 1, 7, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (992, 'Quảng Bình, Việt Nam', '2024-12-06T07:00:00', 20.50, 20.50, 19.20, 92.26, 0.00, 93.50, '[rain]', 0.00, 0.00, 1.80, 1.10, 268.40, 1014, 99.8, 24.1, 3, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 42, 'VN985', 7280, 8, 1, 1, 1, 6, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (993, 'Quảng Bình, Việt Nam', '2024-12-06T08:00:00', 20.90, 20.90, 19.50, 91.71, 0.10, 100.00, '[rain]', 0.00, 0.00, 3.20, 0.40, 221.90, 1015, 98.2, 23.7, 24, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 42, 'VN985', 7280, 9, 1, 1, 1, 8, 1, 1, 3, 4, 1, 1);
INSERT INTO `staging` VALUES (994, 'Quảng Bình, Việt Nam', '2024-12-06T09:00:00', 21.70, 21.70, 20.10, 90.63, 0.20, 100.00, '[rain]', 0.00, 0.00, 10.40, 4.30, 122.80, 1015, 96.1, 23.6, 55, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 42, 'VN985', 7280, 10, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (995, 'Quảng Bình, Việt Nam', '2024-12-06T10:00:00', 22.40, 22.40, 20.50, 89.01, 0.20, 100.00, '[rain]', 0.00, 0.00, 18.00, 6.10, 114.20, 1015, 95.3, 17.2, 83, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 42, 'VN985', 7280, 11, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (996, 'Quảng Bình, Việt Nam', '2024-12-06T11:00:00', 23.00, 23.00, 20.60, 86.36, 0.20, 100.00, '[rain]', 0.00, 0.00, 20.90, 10.40, 111.90, 1014, 86.9, 23.3, 163, 0.6, 2, 10, 'Rain, Partially cloudy', 'rain', 'None', 42, 'VN985', 7280, 12, 1, 1, 3, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (997, 'Quảng Bình, Việt Nam', '2024-12-06T12:00:00', 23.30, 23.30, 20.60, 84.81, 0.40, 100.00, '[rain]', 0.00, 0.00, 22.00, 13.70, 112.80, 1013, 97.8, 21.1, 281, 1, 3, 10, 'Rain, Overcast', 'rain', 'None', 42, 'VN985', 7280, 13, 1, 1, 1, 2, 1, 1, 1, 5, 2, 1);
INSERT INTO `staging` VALUES (998, 'Quảng Bình, Việt Nam', '2024-12-06T13:00:00', 23.10, 23.10, 20.60, 85.84, 0.20, 100.00, '[rain]', 0.00, 0.00, 22.00, 14.00, 110.00, 1012, 95.2, 20.1, 219, 0.8, 2, 10, 'Rain, Overcast', 'rain', 'None', 42, 'VN985', 7280, 14, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (999, 'Quảng Bình, Việt Nam', '2024-12-06T14:00:00', 23.30, 23.30, 20.60, 84.81, 0.20, 61.30, '[rain]', 0.00, 0.00, 21.60, 14.40, 108.50, 1011, 59.2, 23.8, 250, 0.9, 3, 10, 'Rain, Partially cloudy', 'rain', 'None', 42, 'VN985', 7280, 15, 1, 1, 3, 2, 1, 1, 1, 5, 2, 3);
INSERT INTO `staging` VALUES (1000, 'Quảng Bình, Việt Nam', '2024-12-06T15:00:00', 23.60, 23.60, 20.60, 83.29, 0.20, 61.30, '[rain]', 0.00, 0.00, 21.60, 14.80, 113.60, 1011, 69.8, 23.2, 349, 1.3, 3, 10, 'Rain, Partially cloudy', 'rain', 'None', 42, 'VN985', 7280, 16, 1, 1, 3, 2, 1, 1, 1, 5, 2, 6);
INSERT INTO `staging` VALUES (1001, 'Quảng Bình, Việt Nam', '2024-12-06T16:00:00', 23.10, 23.10, 20.70, 86.37, 0.30, 61.30, '[rain]', 0.00, 0.00, 22.70, 12.60, 120.00, 1011, 84.3, 22.5, 175, 0.6, 2, 10, 'Rain, Partially cloudy', 'rain', 'None', 42, 'VN985', 7280, 17, 1, 1, 3, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1002, 'Quảng Bình, Việt Nam', '2024-12-06T17:00:00', 22.50, 22.50, 20.60, 89.02, 0.10, 61.30, '[rain]', 0.00, 0.00, 22.00, 10.80, 125.20, 1012, 63.4, 22.7, 58, 0.2, 1, 10, 'Rain, Partially cloudy', 'rain', 'None', 42, 'VN985', 7280, 18, 1, 1, 3, 2, 1, 1, 1, 1, 1, 6);
INSERT INTO `staging` VALUES (1003, 'Quảng Bình, Việt Nam', '2024-12-06T18:00:00', 22.00, 22.00, 20.50, 91.21, 0.20, 61.30, '[rain]', 0.00, 0.00, 20.90, 10.10, 128.80, 1012, 73.8, 21.3, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 42, 'VN985', 7280, 19, 1, 1, 3, 2, 1, 1, 3, 1, 1, 6);
INSERT INTO `staging` VALUES (1004, 'Quảng Bình, Việt Nam', '2024-12-06T19:00:00', 22.00, 22.00, 20.50, 91.21, 0.30, 61.30, '[rain]', 0.00, 0.00, 21.60, 10.40, 129.00, 1013, 34.9, 18.9, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 42, 'VN985', 7280, 20, 1, 1, 3, 2, 1, 1, 3, 1, 1, 4);
INSERT INTO `staging` VALUES (1005, 'Quảng Bình, Việt Nam', '2024-12-06T20:00:00', 21.50, 21.50, 20.20, 92.31, 0.20, 67.70, '[rain]', 0.00, 0.00, 21.20, 10.10, 124.90, 1014, 40.7, 18.8, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 42, 'VN985', 7280, 21, 1, 1, 3, 2, 1, 1, 3, 1, 1, 2);
INSERT INTO `staging` VALUES (1006, 'Quảng Bình, Việt Nam', '2024-12-06T21:00:00', 21.40, 21.40, 20.10, 92.31, 0.20, 67.70, '[rain]', 0.00, 0.00, 20.50, 9.40, 120.60, 1014, 92, 19, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 42, 'VN985', 7280, 22, 1, 1, 1, 2, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1007, 'Quảng Bình, Việt Nam', '2024-12-06T22:00:00', 21.80, 21.80, 20.30, 91.20, 0.30, 67.70, '[rain]', 0.00, 0.00, 21.60, 10.10, 117.90, 1014, 80.7, 22.5, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 42, 'VN985', 7280, 23, 1, 1, 3, 2, 1, 1, 3, 1, 1, 2);
INSERT INTO `staging` VALUES (1008, 'Quảng Bình, Việt Nam', '2024-12-06T23:00:00', 21.70, 21.70, 20.30, 91.75, 0.20, 67.70, '[rain]', 0.00, 0.00, 20.20, 10.40, 121.70, 1014, 89.2, 18.2, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 42, 'VN985', 7280, 24, 1, 1, 3, 2, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1009, 'Quảng Nam, Việt Nam', '2024-12-06T00:00:00', 22.40, 22.40, 20.80, 90.67, 0.20, 100.00, '[rain]', 0.00, 0.00, 2.50, 2.50, 260.20, 1013, 77, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 43, 'VN1009', 7280, 1, 1, 1, 3, 6, 1, 1, 3, 3, 1, 6);
INSERT INTO `staging` VALUES (1010, 'Quảng Nam, Việt Nam', '2024-12-06T01:00:00', 22.30, 22.30, 20.70, 90.67, 0.30, 100.00, '[rain]', 0.00, 0.00, 2.90, 3.20, 278.80, 1013, 88.3, 21, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 43, 'VN1009', 7280, 2, 1, 1, 3, 7, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1011, 'Quảng Nam, Việt Nam', '2024-12-06T02:00:00', 22.40, 22.40, 20.80, 90.67, 0.20, 100.00, '[rain]', 0.00, 0.00, 2.90, 2.90, 293.90, 1012, 94.6, 22.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 3, 1, 1, 1, 7, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1012, 'Quảng Nam, Việt Nam', '2024-12-06T03:00:00', 22.40, 22.40, 20.90, 91.23, 0.30, 100.00, '[rain]', 0.00, 0.00, 2.90, 2.20, 307.60, 1012, 100, 21.3, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 4, 1, 1, 1, 7, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1013, 'Quảng Nam, Việt Nam', '2024-12-06T04:00:00', 22.40, 22.40, 21.00, 91.80, 0.30, 100.00, '[rain]', 0.00, 0.00, 2.90, 1.80, 320.70, 1012, 97.4, 20.4, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 5, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1014, 'Quảng Nam, Việt Nam', '2024-12-06T05:00:00', 22.40, 22.40, 21.10, 92.36, 0.30, 100.00, '[rain]', 0.00, 0.00, 4.00, 2.20, 358.60, 1012, 100, 17.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 6, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1015, 'Quảng Nam, Việt Nam', '2024-12-06T06:00:00', 22.40, 22.40, 21.20, 92.93, 0.70, 100.00, '[rain]', 0.00, 0.00, 6.80, 4.30, 38.90, 1013, 100, 13.4, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 7, 1, 1, 1, 5, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1016, 'Quảng Nam, Việt Nam', '2024-12-06T07:00:00', 22.50, 22.50, 21.40, 93.51, 0.80, 100.00, '[rain]', 0.00, 0.00, 13.00, 6.80, 46.50, 1014, 100, 9.9, 3, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 8, 1, 1, 1, 3, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1017, 'Quảng Nam, Việt Nam', '2024-12-06T08:00:00', 22.80, 22.80, 21.40, 91.82, 0.70, 100.00, '[rain]', 0.00, 0.00, 18.00, 8.30, 43.00, 1014, 100, 12.2, 14, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 9, 1, 1, 1, 5, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1018, 'Quảng Nam, Việt Nam', '2024-12-06T09:00:00', 23.20, 23.20, 21.60, 90.73, 0.50, 100.00, '[rain]', 0.00, 0.00, 18.70, 7.60, 45.90, 1015, 100, 12.9, 39, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 10, 1, 1, 1, 3, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1019, 'Quảng Nam, Việt Nam', '2024-12-06T10:00:00', 23.50, 23.50, 21.60, 89.10, 0.50, 100.00, '[rain]', 0.00, 0.00, 16.90, 6.50, 51.50, 1014, 100, 13.5, 63, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 11, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1020, 'Quảng Nam, Việt Nam', '2024-12-06T11:00:00', 23.60, 23.60, 21.60, 88.56, 0.30, 100.00, '[rain]', 0.00, 0.00, 14.00, 5.40, 54.60, 1014, 100, 17.6, 71, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 12, 1, 1, 1, 3, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1021, 'Quảng Nam, Việt Nam', '2024-12-06T12:00:00', 23.50, 23.50, 21.60, 89.10, 0.40, 100.00, '[rain]', 0.00, 0.00, 12.60, 5.80, 57.80, 1013, 100, 16.5, 73, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 13, 1, 1, 1, 3, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1022, 'Quảng Nam, Việt Nam', '2024-12-06T13:00:00', 23.40, 23.40, 21.50, 89.09, 0.30, 100.00, '[rain]', 0.00, 0.00, 12.20, 5.80, 59.40, 1012, 100, 17, 71, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 14, 1, 1, 1, 3, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1023, 'Quảng Nam, Việt Nam', '2024-12-06T14:00:00', 23.30, 23.30, 21.40, 89.08, 0.30, 100.00, '[rain]', 0.00, 0.00, 13.00, 6.10, 54.90, 1011, 100, 17.9, 64, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 15, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1024, 'Quảng Nam, Việt Nam', '2024-12-06T15:00:00', 23.20, 23.20, 21.30, 89.08, 0.30, 100.00, '[rain]', 0.00, 0.00, 12.60, 6.50, 58.40, 1011, 100, 19.3, 52, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 16, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1025, 'Quảng Nam, Việt Nam', '2024-12-06T16:00:00', 22.90, 22.90, 21.20, 90.15, 0.30, 100.00, '[rain]', 0.00, 0.00, 12.60, 6.80, 51.40, 1011, 100, 15.6, 28, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 17, 1, 1, 1, 3, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1026, 'Quảng Nam, Việt Nam', '2024-12-06T17:00:00', 22.60, 22.60, 21.20, 91.81, 0.40, 100.00, '[rain]', 0.00, 0.00, 13.00, 7.20, 43.60, 1012, 100, 15.3, 8, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 18, 1, 1, 1, 5, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1027, 'Quảng Nam, Việt Nam', '2024-12-06T18:00:00', 22.50, 22.50, 21.10, 91.80, 0.30, 100.00, '[rain]', 0.00, 0.00, 15.80, 7.90, 38.30, 1012, 100, 12.7, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 19, 1, 1, 1, 5, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1028, 'Quảng Nam, Việt Nam', '2024-12-06T19:00:00', 22.40, 22.40, 21.10, 92.36, 0.60, 100.00, '[rain]', 0.00, 0.00, 17.60, 8.30, 39.10, 1013, 100, 12.7, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 20, 1, 1, 1, 5, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1029, 'Quảng Nam, Việt Nam', '2024-12-06T20:00:00', 22.30, 22.30, 21.10, 92.93, 0.50, 96.80, '[rain]', 0.00, 0.00, 13.70, 6.10, 30.70, 1014, 100, 11.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 21, 1, 1, 1, 5, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1030, 'Quảng Nam, Việt Nam', '2024-12-06T21:00:00', 22.30, 22.30, 21.10, 92.93, 0.50, 96.80, '[rain]', 0.00, 0.00, 7.20, 3.60, 17.10, 1014, 100, 12.9, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 22, 1, 1, 1, 5, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1031, 'Quảng Nam, Việt Nam', '2024-12-06T22:00:00', 22.20, 22.20, 21.00, 92.92, 0.30, 96.80, '[rain]', 0.00, 0.00, 2.20, 1.80, 271.80, 1014, 100, 15.2, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 23, 1, 1, 1, 7, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1032, 'Quảng Nam, Việt Nam', '2024-12-06T23:00:00', 21.90, 21.90, 21.00, 94.64, 0.30, 96.80, '[rain]', 0.00, 0.00, 5.40, 5.00, 253.50, 1014, 100, 21.4, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 43, 'VN1009', 7280, 24, 1, 1, 1, 6, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1033, 'Quảng Ngãi, Việt Nam', '2024-12-06T00:00:00', 21.50, 21.50, 20.30, 92.88, 0.00, 100.00, '[rain]', 0.00, 0.00, 6.50, 6.10, 285.40, 1013, 87.1, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 44, 'VN1033', 7280, 1, 1, 1, 3, 7, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1034, 'Quảng Ngãi, Việt Nam', '2024-12-06T01:00:00', 21.40, 21.40, 20.30, 93.46, 0.00, 100.00, '[rain]', 0.00, 0.00, 6.80, 6.50, 277.50, 1012, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 2, 1, 1, 1, 7, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1035, 'Quảng Ngãi, Việt Nam', '2024-12-06T02:00:00', 21.30, 21.30, 20.30, 94.03, 0.00, 100.00, '[rain]', 0.00, 0.00, 6.80, 6.50, 271.90, 1012, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 3, 1, 1, 1, 7, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1036, 'Quảng Ngãi, Việt Nam', '2024-12-06T03:00:00', 21.40, 21.40, 20.30, 93.46, 0.00, 100.00, '[rain]', 0.00, 0.00, 6.10, 5.80, 278.40, 1012, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 4, 1, 1, 1, 7, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1037, 'Quảng Ngãi, Việt Nam', '2024-12-06T04:00:00', 21.40, 21.40, 20.30, 93.46, 0.10, 100.00, '[rain]', 0.00, 0.00, 5.80, 5.40, 297.10, 1012, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 5, 1, 1, 1, 7, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1038, 'Quảng Ngãi, Việt Nam', '2024-12-06T05:00:00', 21.40, 21.40, 20.40, 94.03, 0.10, 100.00, '[rain]', 0.00, 0.00, 5.40, 5.00, 311.10, 1012, 100, 24, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 6, 1, 1, 1, 7, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1039, 'Quảng Ngãi, Việt Nam', '2024-12-06T06:00:00', 21.30, 21.30, 20.60, 95.79, 0.40, 100.00, '[rain]', 0.00, 0.00, 6.50, 5.00, 313.80, 1013, 100, 15.3, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 7, 1, 1, 1, 7, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1040, 'Quảng Ngãi, Việt Nam', '2024-12-06T07:00:00', 21.20, 21.20, 20.80, 97.57, 0.80, 100.00, '[rain]', 0.00, 0.00, 7.60, 5.00, 306.20, 1013, 100, 12.7, 2, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 8, 1, 1, 1, 7, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1041, 'Quảng Ngãi, Việt Nam', '2024-12-06T08:00:00', 21.40, 21.40, 21.00, 97.57, 0.80, 100.00, '[rain]', 0.00, 0.00, 7.60, 4.70, 308.50, 1014, 100, 15.9, 6, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 9, 1, 1, 1, 7, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1042, 'Quảng Ngãi, Việt Nam', '2024-12-06T09:00:00', 21.60, 21.60, 21.20, 97.58, 0.50, 100.00, '[rain]', 0.00, 0.00, 9.00, 5.40, 317.00, 1014, 100, 16.4, 12, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 10, 1, 1, 1, 4, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1043, 'Quảng Ngãi, Việt Nam', '2024-12-06T10:00:00', 21.80, 21.80, 21.30, 96.99, 0.40, 100.00, '[rain]', 0.00, 0.00, 10.10, 5.80, 319.50, 1014, 100, 21.4, 21, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 11, 1, 1, 1, 4, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1044, 'Quảng Ngãi, Việt Nam', '2024-12-06T11:00:00', 22.00, 22.00, 21.40, 96.40, 0.40, 100.00, '[rain]', 0.00, 0.00, 9.40, 4.70, 321.70, 1014, 100, 17.6, 27, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 12, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1045, 'Quảng Ngãi, Việt Nam', '2024-12-06T12:00:00', 22.10, 22.10, 21.50, 96.40, 0.50, 100.00, '[rain]', 0.00, 0.00, 9.00, 5.00, 325.60, 1013, 100, 15.9, 26, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 13, 1, 1, 1, 4, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1046, 'Quảng Ngãi, Việt Nam', '2024-12-06T13:00:00', 22.20, 22.20, 21.50, 95.82, 0.30, 100.00, '[rain]', 0.00, 0.00, 8.60, 4.70, 326.90, 1012, 100, 13.3, 32, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 14, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1047, 'Quảng Ngãi, Việt Nam', '2024-12-06T14:00:00', 22.30, 22.30, 21.40, 94.65, 0.30, 100.00, '[rain]', 0.00, 0.00, 8.60, 4.70, 325.50, 1011, 100, 18.4, 31, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 15, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1048, 'Quảng Ngãi, Việt Nam', '2024-12-06T15:00:00', 22.10, 22.10, 21.30, 95.23, 0.20, 100.00, '[rain]', 0.00, 0.00, 7.20, 4.70, 321.80, 1011, 100, 24.1, 21, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 16, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1049, 'Quảng Ngãi, Việt Nam', '2024-12-06T16:00:00', 22.00, 22.00, 21.20, 95.22, 0.10, 100.00, '[rain]', 0.00, 0.00, 5.40, 4.70, 315.80, 1011, 100, 24.1, 11, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 17, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1050, 'Quảng Ngãi, Việt Nam', '2024-12-06T17:00:00', 21.80, 21.80, 21.10, 95.80, 0.20, 100.00, '[rain]', 0.00, 0.00, 4.70, 4.30, 315.90, 1012, 100, 24, 3, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 18, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1051, 'Quảng Ngãi, Việt Nam', '2024-12-06T18:00:00', 21.70, 21.70, 21.10, 96.39, 0.30, 100.00, '[rain]', 0.00, 0.00, 6.10, 4.70, 323.00, 1012, 100, 16.5, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 19, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1052, 'Quảng Ngãi, Việt Nam', '2024-12-06T19:00:00', 21.60, 21.60, 21.10, 96.98, 0.60, 100.00, '[rain]', 0.00, 0.00, 7.20, 5.00, 326.50, 1013, 100, 11.9, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 20, 1, 1, 1, 4, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1053, 'Quảng Ngãi, Việt Nam', '2024-12-06T20:00:00', 21.50, 21.50, 21.20, 98.18, 0.80, 93.50, '[rain]', 0.00, 0.00, 9.70, 5.80, 333.90, 1013, 100, 10.4, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 21, 1, 1, 1, 4, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1054, 'Quảng Ngãi, Việt Nam', '2024-12-06T21:00:00', 21.50, 21.50, 21.30, 98.78, 0.80, 93.50, '[rain]', 0.00, 0.00, 9.40, 5.40, 334.90, 1014, 100, 4, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 22, 1, 1, 1, 4, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1055, 'Quảng Ngãi, Việt Nam', '2024-12-06T22:00:00', 21.50, 21.50, 21.30, 98.78, 0.70, 93.50, '[rain]', 0.00, 0.00, 9.40, 5.40, 321.80, 1014, 100, 4, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 23, 1, 1, 1, 4, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1056, 'Quảng Ngãi, Việt Nam', '2024-12-06T23:00:00', 21.60, 21.60, 21.20, 97.58, 0.70, 93.50, '[rain]', 0.00, 0.00, 7.90, 5.40, 310.50, 1013, 100, 9.5, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 44, 'VN1033', 7280, 24, 1, 1, 1, 7, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1057, 'Quảng Ninh, Việt Nam', '2024-12-06T00:00:00', 18.40, 18.40, 16.20, 87.01, 0.00, 0.00, 'None', 0.00, 0.00, 10.10, 7.20, 51.50, 1015, 12, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 45, 'VN1057', 7280, 1, 1, 2, 5, 3, 3, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (1058, 'Quảng Ninh, Việt Nam', '2024-12-06T01:00:00', 18.40, 18.40, 16.20, 87.01, 0.00, 0.00, 'None', 0.00, 0.00, 13.70, 8.30, 61.60, 1014, 73, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 45, 'VN1057', 7280, 2, 1, 2, 6, 3, 4, 1, 1, 1, 1, 6);
INSERT INTO `staging` VALUES (1059, 'Quảng Ninh, Việt Nam', '2024-12-06T02:00:00', 19.20, 19.20, 16.50, 84.37, 0.00, 25.80, 'None', 0.00, 0.00, 16.60, 8.60, 70.20, 1014, 99.9, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 45, 'VN1057', 7280, 3, 1, 2, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1060, 'Quảng Ninh, Việt Nam', '2024-12-06T03:00:00', 19.50, 19.50, 16.90, 84.94, 0.00, 25.80, 'None', 0.00, 0.00, 18.40, 9.40, 64.70, 1014, 28.9, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 45, 'VN1057', 7280, 4, 1, 2, 6, 3, 4, 1, 1, 1, 1, 4);
INSERT INTO `staging` VALUES (1061, 'Quảng Ninh, Việt Nam', '2024-12-06T04:00:00', 18.30, 18.30, 17.20, 93.30, 0.00, 25.80, 'None', 0.00, 0.00, 14.00, 8.60, 55.60, 1014, 96.2, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 45, 'VN1057', 7280, 5, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1062, 'Quảng Ninh, Việt Nam', '2024-12-06T05:00:00', 19.10, 19.10, 17.50, 90.45, 0.00, 25.80, 'None', 0.00, 0.00, 20.50, 9.40, 61.40, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 45, 'VN1057', 7280, 6, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1063, 'Quảng Ninh, Việt Nam', '2024-12-06T06:00:00', 19.40, 19.40, 17.90, 91.04, 0.00, 25.80, 'None', 0.00, 0.00, 23.00, 10.40, 69.10, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 45, 'VN1057', 7280, 7, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1064, 'Quảng Ninh, Việt Nam', '2024-12-06T07:00:00', 19.70, 19.70, 18.20, 91.06, 0.00, 25.80, 'None', 0.00, 0.00, 20.20, 9.40, 63.90, 1015, 100, 24.1, 4, 0, 0, 10, 'Overcast', 'cloudy', 'None', 45, 'VN1057', 7280, 8, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1065, 'Quảng Ninh, Việt Nam', '2024-12-06T08:00:00', 20.20, 20.20, 18.50, 89.96, 0.10, 32.30, '[rain]', 0.00, 0.00, 19.80, 9.70, 61.90, 1016, 100, 22.8, 22, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 45, 'VN1057', 7280, 9, 1, 1, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1066, 'Quảng Ninh, Việt Nam', '2024-12-06T09:00:00', 20.70, 20.70, 18.50, 87.23, 0.10, 32.30, '[rain]', 0.00, 0.00, 25.90, 10.80, 66.70, 1016, 100, 23.4, 44, 0.2, 0, 10, 'Overcast', 'cloudy', 'None', 45, 'VN1057', 7280, 10, 1, 1, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1067, 'Quảng Ninh, Việt Nam', '2024-12-06T10:00:00', 21.10, 21.10, 18.50, 85.11, 0.10, 32.30, '[rain]', 0.00, 0.00, 26.60, 11.90, 72.70, 1016, 61.3, 22.7, 53, 0.2, 1, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 45, 'VN1057', 7280, 11, 1, 1, 6, 3, 5, 1, 1, 2, 1, 6);
INSERT INTO `staging` VALUES (1068, 'Quảng Ninh, Việt Nam', '2024-12-06T11:00:00', 23.20, 23.20, 18.40, 74.42, 0.20, 32.30, '[rain]', 0.00, 0.00, 25.60, 15.80, 82.30, 1015, 99.6, 24, 449, 1.6, 4, 10, 'Overcast', 'cloudy', 'None', 45, 'VN1057', 7280, 12, 1, 1, 2, 3, 2, 1, 1, 5, 2, 1);
INSERT INTO `staging` VALUES (1069, 'Quảng Ninh, Việt Nam', '2024-12-06T12:00:00', 21.50, 21.50, 18.40, 82.52, 0.10, 32.30, '[rain]', 0.00, 0.00, 25.20, 12.60, 77.60, 1014, 99.9, 24.1, 78, 0.3, 1, 10, 'Overcast', 'cloudy', 'None', 45, 'VN1057', 7280, 13, 1, 1, 2, 3, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1070, 'Quảng Ninh, Việt Nam', '2024-12-06T13:00:00', 22.00, 22.00, 18.20, 79.04, 0.10, 32.30, '[rain]', 0.00, 0.00, 25.90, 14.00, 85.30, 1013, 99.9, 24.1, 129, 0.5, 1, 10, 'Overcast', 'cloudy', 'None', 45, 'VN1057', 7280, 14, 1, 1, 2, 3, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1071, 'Quảng Ninh, Việt Nam', '2024-12-06T14:00:00', 21.90, 21.90, 18.10, 79.03, 0.00, 0.00, 'None', 0.00, 0.00, 27.70, 14.80, 84.10, 1012, 64.3, 24.1, 115, 0.4, 1, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 45, 'VN1057', 7280, 15, 1, 2, 6, 3, 5, 1, 1, 5, 1, 6);
INSERT INTO `staging` VALUES (1072, 'Quảng Ninh, Việt Nam', '2024-12-06T15:00:00', 23.00, 23.00, 17.70, 72.08, 0.00, 0.00, 'None', 0.00, 0.00, 24.80, 16.90, 87.30, 1012, 39.8, 24.1, 342, 1.2, 3, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 45, 'VN1057', 7280, 16, 1, 2, 6, 3, 5, 1, 1, 5, 2, 4);
INSERT INTO `staging` VALUES (1073, 'Quảng Ninh, Việt Nam', '2024-12-06T16:00:00', 22.70, 22.70, 17.70, 73.40, 0.10, 0.00, '[rain]', 0.00, 0.00, 23.40, 15.80, 87.20, 1012, 32.9, 24.1, 249, 0.9, 2, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 45, 'VN1057', 7280, 17, 1, 1, 6, 3, 5, 1, 1, 5, 1, 4);
INSERT INTO `staging` VALUES (1074, 'Quảng Ninh, Việt Nam', '2024-12-06T17:00:00', 21.20, 21.20, 17.80, 80.95, 0.00, 0.00, 'None', 0.00, 0.00, 23.40, 12.20, 78.00, 1013, 0, 24.1, 77, 0.3, 1, 10, 'Clear', 'clear-day', 'None', 45, 'VN1057', 7280, 18, 1, 2, 5, 3, 6, 1, 1, 5, 1, 5);
INSERT INTO `staging` VALUES (1075, 'Quảng Ninh, Việt Nam', '2024-12-06T18:00:00', 19.60, 19.60, 17.60, 88.23, 0.00, 0.00, 'None', 0.00, 0.00, 16.20, 9.40, 65.80, 1014, 12.7, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 45, 'VN1057', 7280, 19, 1, 2, 5, 3, 3, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (1076, 'Quảng Ninh, Việt Nam', '2024-12-06T19:00:00', 19.00, 19.00, 17.40, 90.44, 0.00, 0.00, 'None', 0.00, 0.00, 17.30, 9.40, 62.50, 1014, 81.9, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 45, 'VN1057', 7280, 20, 1, 2, 6, 3, 4, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1077, 'Quảng Ninh, Việt Nam', '2024-12-06T20:00:00', 19.70, 19.70, 17.10, 84.96, 0.00, 0.00, 'None', 0.00, 0.00, 22.70, 9.70, 66.70, 1015, 99.5, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 45, 'VN1057', 7280, 21, 1, 2, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1078, 'Quảng Ninh, Việt Nam', '2024-12-06T21:00:00', 20.40, 20.40, 16.70, 79.32, 0.00, 0.00, 'None', 0.00, 0.00, 28.40, 11.50, 72.10, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 45, 'VN1057', 7280, 22, 1, 2, 2, 3, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1079, 'Quảng Ninh, Việt Nam', '2024-12-06T22:00:00', 20.60, 20.60, 16.10, 75.41, 0.00, 0.00, 'None', 0.00, 0.00, 31.00, 13.00, 73.50, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 45, 'VN1057', 7280, 23, 1, 2, 2, 3, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1080, 'Quảng Ninh, Việt Nam', '2024-12-06T23:00:00', 20.50, 20.50, 15.60, 73.49, 0.00, 0.00, 'None', 0.00, 0.00, 31.70, 13.70, 71.90, 1016, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 45, 'VN1057', 7280, 24, 1, 2, 2, 3, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1081, 'Quảng Trị, Việt Nam', '2024-12-06T00:00:00', 21.00, 21.00, 20.10, 94.60, 0.10, 83.90, '[rain]', 0.00, 0.00, 2.50, 2.50, 334.80, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 46, 'VN1081', 7280, 1, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1082, 'Quảng Trị, Việt Nam', '2024-12-06T01:00:00', 20.50, 20.50, 19.80, 95.76, 0.00, 83.90, '[rain]', 0.00, 0.00, 2.90, 2.90, 329.50, 1013, 34.9, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 46, 'VN1081', 7280, 2, 1, 1, 3, 4, 1, 1, 3, 3, 1, 4);
INSERT INTO `staging` VALUES (1083, 'Quảng Trị, Việt Nam', '2024-12-06T02:00:00', 20.40, 20.40, 19.80, 96.35, 0.00, 100.00, '[rain]', 0.00, 0.00, 3.20, 3.20, 328.60, 1013, 46.9, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 46, 'VN1081', 7280, 3, 1, 1, 3, 4, 1, 1, 3, 3, 1, 3);
INSERT INTO `staging` VALUES (1084, 'Quảng Trị, Việt Nam', '2024-12-06T03:00:00', 20.30, 20.30, 19.80, 96.95, 0.00, 100.00, '[rain]', 0.00, 0.00, 2.90, 2.90, 335.80, 1012, 47.5, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 46, 'VN1081', 7280, 4, 1, 1, 3, 4, 1, 1, 3, 3, 1, 3);
INSERT INTO `staging` VALUES (1085, 'Quảng Trị, Việt Nam', '2024-12-06T04:00:00', 20.30, 20.30, 19.80, 96.95, 0.00, 100.00, '[rain]', 0.00, 0.00, 2.20, 2.20, 342.00, 1012, 56.6, 19.4, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 46, 'VN1081', 7280, 5, 1, 1, 3, 4, 1, 1, 3, 3, 1, 3);
INSERT INTO `staging` VALUES (1086, 'Quảng Trị, Việt Nam', '2024-12-06T05:00:00', 20.40, 20.40, 19.80, 96.35, 0.10, 100.00, '[rain]', 0.00, 0.00, 1.40, 0.70, 346.70, 1013, 81, 13.6, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 46, 'VN1081', 7280, 6, 1, 1, 3, 4, 1, 1, 3, 4, 1, 1);
INSERT INTO `staging` VALUES (1087, 'Quảng Trị, Việt Nam', '2024-12-06T06:00:00', 20.70, 20.70, 20.00, 95.77, 0.00, 100.00, '[rain]', 0.00, 0.00, 1.40, 0.40, 72.20, 1013, 93.8, 16.3, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 46, 'VN1081', 7280, 7, 1, 1, 1, 3, 1, 1, 3, 4, 1, 1);
INSERT INTO `staging` VALUES (1088, 'Quảng Trị, Việt Nam', '2024-12-06T07:00:00', 21.20, 21.20, 20.30, 94.61, 0.10, 100.00, '[rain]', 0.00, 0.00, 3.60, 1.10, 76.60, 1014, 99.9, 24.1, 15, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 46, 'VN1081', 7280, 8, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1089, 'Quảng Trị, Việt Nam', '2024-12-06T08:00:00', 21.80, 21.80, 20.40, 91.76, 0.00, 96.80, '[rain]', 0.00, 0.00, 11.90, 2.50, 83.50, 1014, 96.9, 24.1, 51, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 46, 'VN1081', 7280, 9, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1090, 'Quảng Trị, Việt Nam', '2024-12-06T09:00:00', 22.40, 22.40, 20.70, 90.12, 0.00, 96.80, '[rain]', 0.00, 0.00, 18.40, 5.00, 97.70, 1015, 72.9, 24.1, 111, 0.4, 1, 10, 'Rain, Partially cloudy', 'rain', 'None', 46, 'VN1081', 7280, 10, 1, 1, 3, 2, 1, 1, 3, 2, 1, 6);
INSERT INTO `staging` VALUES (1091, 'Quảng Trị, Việt Nam', '2024-12-06T10:00:00', 24.10, 24.10, 21.00, 82.83, 0.30, 96.80, '[rain]', 0.00, 0.00, 21.20, 10.80, 100.80, 1014, 65.9, 22.7, 375, 1.3, 4, 10, 'Rain, Partially cloudy', 'rain', 'None', 46, 'VN1081', 7280, 11, 1, 1, 3, 2, 1, 1, 1, 1, 2, 6);
INSERT INTO `staging` VALUES (1092, 'Quảng Trị, Việt Nam', '2024-12-06T11:00:00', 25.10, 25.10, 21.10, 78.50, 0.20, 96.80, '[rain]', 0.00, 0.00, 20.90, 14.00, 92.00, 1013, 91.5, 20, 484, 1.7, 5, 10, 'Rain, Overcast', 'rain', 'None', 46, 'VN1081', 7280, 12, 1, 1, 1, 2, 1, 1, 1, 5, 2, 1);
INSERT INTO `staging` VALUES (1093, 'Quảng Trị, Việt Nam', '2024-12-06T12:00:00', 24.80, 24.80, 21.20, 80.41, 0.20, 96.80, '[rain]', 0.00, 0.00, 21.60, 15.10, 85.10, 1012, 78.9, 24, 345, 1.2, 3, 10, 'Rain, Partially cloudy', 'rain', 'None', 46, 'VN1081', 7280, 13, 1, 1, 3, 3, 1, 1, 1, 5, 2, 6);
INSERT INTO `staging` VALUES (1094, 'Quảng Trị, Việt Nam', '2024-12-06T13:00:00', 25.00, 25.00, 21.10, 78.97, 0.30, 96.80, '[rain]', 0.00, 0.00, 22.00, 16.60, 84.40, 1011, 94.6, 17.4, 462, 1.7, 5, 10, 'Rain, Overcast', 'rain', 'None', 46, 'VN1081', 7280, 14, 1, 1, 1, 3, 1, 1, 1, 5, 2, 1);
INSERT INTO `staging` VALUES (1095, 'Quảng Trị, Việt Nam', '2024-12-06T14:00:00', 24.00, 24.00, 21.20, 84.36, 0.20, 64.50, '[rain]', 0.00, 0.00, 23.00, 14.80, 83.40, 1011, 79.6, 23.4, 265, 1, 3, 10, 'Rain, Partially cloudy', 'rain', 'None', 46, 'VN1081', 7280, 15, 1, 1, 3, 3, 1, 1, 1, 5, 2, 6);
INSERT INTO `staging` VALUES (1096, 'Quảng Trị, Việt Nam', '2024-12-06T15:00:00', 23.40, 23.40, 21.10, 86.93, 0.30, 64.50, '[rain]', 0.00, 0.00, 23.40, 12.20, 83.20, 1011, 91.2, 19, 216, 0.8, 2, 10, 'Rain, Overcast', 'rain', 'None', 46, 'VN1081', 7280, 16, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1097, 'Quảng Trị, Việt Nam', '2024-12-06T16:00:00', 22.70, 22.70, 20.90, 89.59, 0.10, 64.50, '[rain]', 0.00, 0.00, 25.60, 10.80, 85.10, 1011, 99.9, 21.9, 94, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 46, 'VN1081', 7280, 17, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1098, 'Quảng Trị, Việt Nam', '2024-12-06T17:00:00', 22.10, 22.10, 20.60, 91.21, 0.20, 64.50, '[rain]', 0.00, 0.00, 26.30, 9.00, 97.50, 1012, 98.4, 24.1, 23, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 46, 'VN1081', 7280, 18, 1, 1, 1, 2, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1099, 'Quảng Trị, Việt Nam', '2024-12-06T18:00:00', 21.80, 21.80, 20.60, 92.90, 0.10, 64.50, '[rain]', 0.00, 0.00, 23.00, 7.20, 104.00, 1012, 98.2, 23, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 46, 'VN1081', 7280, 19, 1, 1, 1, 2, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1100, 'Quảng Trị, Việt Nam', '2024-12-06T19:00:00', 21.80, 21.80, 20.60, 92.90, 0.10, 64.50, '[rain]', 0.00, 0.00, 21.20, 6.50, 103.00, 1013, 99.3, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 46, 'VN1081', 7280, 20, 1, 1, 1, 2, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1101, 'Quảng Trị, Việt Nam', '2024-12-06T20:00:00', 21.70, 21.70, 20.60, 93.47, 0.00, 48.40, '[rain]', 0.00, 0.00, 21.20, 5.00, 106.30, 1014, 99.3, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 46, 'VN1081', 7280, 21, 1, 1, 1, 2, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1102, 'Quảng Trị, Việt Nam', '2024-12-06T21:00:00', 21.60, 21.60, 20.60, 94.04, 0.10, 48.40, '[rain]', 0.00, 0.00, 10.40, 2.90, 107.40, 1014, 89.7, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 46, 'VN1081', 7280, 22, 1, 1, 3, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1103, 'Quảng Trị, Việt Nam', '2024-12-06T22:00:00', 21.60, 21.60, 20.60, 94.04, 0.00, 48.40, '[rain]', 0.00, 0.00, 4.70, 1.40, 113.20, 1014, 87.7, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 46, 'VN1081', 7280, 23, 1, 1, 3, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1104, 'Quảng Trị, Việt Nam', '2024-12-06T23:00:00', 21.40, 21.40, 20.50, 94.62, 0.00, 48.40, '[rain]', 0.00, 0.00, 1.80, 0.70, 32.70, 1014, 88.2, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 46, 'VN1081', 7280, 24, 1, 1, 3, 5, 1, 1, 3, 4, 1, 1);
INSERT INTO `staging` VALUES (1105, 'Sóc Trăng, Việt Nam', '2024-12-06T00:00:00', 25.90, 25.90, 22.50, 81.54, 0.00, 6.50, 'None', 0.00, 0.00, 47.50, 20.90, 82.00, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 47, 'VN1105', 7280, 1, 1, 2, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (1106, 'Sóc Trăng, Việt Nam', '2024-12-06T01:00:00', 26.00, 26.00, 22.30, 80.08, 0.00, 6.50, 'None', 0.00, 0.00, 47.90, 21.20, 83.60, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 47, 'VN1105', 7280, 2, 1, 2, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (1107, 'Sóc Trăng, Việt Nam', '2024-12-06T02:00:00', 25.90, 25.90, 22.20, 80.07, 0.00, 6.50, 'None', 0.00, 0.00, 48.60, 21.20, 84.50, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 47, 'VN1105', 7280, 3, 1, 2, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (1108, 'Sóc Trăng, Việt Nam', '2024-12-06T03:00:00', 25.90, 25.90, 22.20, 80.07, 0.00, 6.50, 'None', 0.00, 0.00, 49.70, 23.00, 85.40, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 47, 'VN1105', 7280, 4, 1, 2, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (1109, 'Sóc Trăng, Việt Nam', '2024-12-06T04:00:00', 25.90, 25.90, 22.30, 80.56, 0.00, 6.50, 'None', 0.00, 0.00, 52.60, 23.80, 83.90, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 47, 'VN1105', 7280, 5, 1, 2, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (1110, 'Sóc Trăng, Việt Nam', '2024-12-06T05:00:00', 25.90, 25.90, 22.30, 80.56, 0.00, 6.50, 'None', 0.00, 0.00, 52.20, 24.50, 83.50, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 47, 'VN1105', 7280, 6, 1, 2, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (1111, 'Sóc Trăng, Việt Nam', '2024-12-06T06:00:00', 25.90, 25.90, 22.40, 81.05, 0.00, 6.50, 'None', 0.00, 0.00, 50.80, 24.10, 81.60, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 47, 'VN1105', 7280, 7, 1, 2, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (1112, 'Sóc Trăng, Việt Nam', '2024-12-06T07:00:00', 26.20, 26.20, 23.00, 82.58, 0.00, 6.50, 'None', 0.00, 0.00, 48.60, 23.00, 79.00, 1008, 98.8, 24.1, 55, 0.2, 1, 10, 'Overcast', 'cloudy', 'None', 47, 'VN1105', 7280, 8, 1, 2, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (1113, 'Sóc Trăng, Việt Nam', '2024-12-06T08:00:00', 27.50, 30.70, 23.60, 79.32, 0.00, 77.40, '[rain]', 0.00, 0.00, 43.90, 23.80, 76.80, 1009, 74.9, 24.1, 246, 0.9, 2, 10, 'Rain, Partially cloudy', 'rain', 'None', 47, 'VN1105', 7280, 9, 1, 1, 3, 3, 1, 1, 1, 7, 1, 6);
INSERT INTO `staging` VALUES (1114, 'Sóc Trăng, Việt Nam', '2024-12-06T09:00:00', 28.70, 32.40, 23.20, 72.20, 0.00, 77.40, '[rain]', 0.00, 0.00, 42.50, 27.70, 73.10, 1010, 23.6, 24.1, 478, 1.7, 5, 10, 'Rain, Partially cloudy', 'rain', 'None', 47, 'VN1105', 7280, 10, 1, 1, 3, 3, 1, 1, 1, 7, 2, 4);
INSERT INTO `staging` VALUES (1115, 'Sóc Trăng, Việt Nam', '2024-12-06T10:00:00', 29.60, 33.50, 23.00, 67.71, 0.00, 77.40, '[rain]', 0.00, 0.00, 39.60, 28.80, 74.10, 1009, 76.3, 24.1, 675, 2.4, 7, 10, 'Rain, Partially cloudy', 'rain', 'None', 47, 'VN1105', 7280, 11, 1, 1, 3, 3, 1, 1, 2, 2, 3, 6);
INSERT INTO `staging` VALUES (1116, 'Sóc Trăng, Việt Nam', '2024-12-06T11:00:00', 30.10, 34.20, 23.00, 65.79, 0.00, 77.40, '[rain]', 0.00, 0.00, 38.20, 29.50, 78.50, 1009, 92.1, 24.1, 789, 2.8, 8, 10, 'Rain, Overcast', 'rain', 'None', 47, 'VN1105', 7280, 12, 1, 1, 1, 3, 1, 1, 2, 6, 4, 1);
INSERT INTO `staging` VALUES (1117, 'Sóc Trăng, Việt Nam', '2024-12-06T12:00:00', 30.30, 34.60, 23.20, 65.83, 0.00, 77.40, '[rain]', 0.00, 0.00, 37.10, 29.50, 80.10, 1008, 25, 24.1, 808, 2.9, 8, 10, 'Rain, Partially cloudy', 'rain', 'None', 47, 'VN1105', 7280, 13, 1, 1, 3, 3, 1, 1, 2, 6, 4, 4);
INSERT INTO `staging` VALUES (1118, 'Sóc Trăng, Việt Nam', '2024-12-06T13:00:00', 30.20, 34.60, 23.30, 66.61, 0.10, 77.40, '[rain]', 0.00, 0.00, 35.60, 29.50, 84.00, 1007, 98.6, 24.1, 826, 3, 8, 10, 'Rain, Overcast', 'rain', 'None', 47, 'VN1105', 7280, 14, 1, 1, 1, 3, 1, 1, 2, 6, 4, 1);
INSERT INTO `staging` VALUES (1119, 'Sóc Trăng, Việt Nam', '2024-12-06T14:00:00', 29.90, 34.20, 23.30, 67.77, 0.00, 67.70, '[rain]', 0.00, 0.00, 35.30, 28.80, 85.10, 1006, 28.1, 24.1, 744, 2.7, 7, 10, 'Rain, Partially cloudy', 'rain', 'None', 47, 'VN1105', 7280, 15, 1, 1, 3, 3, 1, 1, 2, 2, 3, 4);
INSERT INTO `staging` VALUES (1120, 'Sóc Trăng, Việt Nam', '2024-12-06T15:00:00', 29.40, 33.50, 23.40, 70.17, 0.00, 67.70, '[rain]', 0.00, 0.00, 34.90, 27.00, 85.60, 1006, 97, 24.1, 596, 2.1, 6, 10, 'Rain, Overcast', 'rain', 'None', 47, 'VN1105', 7280, 16, 1, 1, 1, 3, 1, 1, 1, 7, 3, 1);
INSERT INTO `staging` VALUES (1121, 'Sóc Trăng, Việt Nam', '2024-12-06T16:00:00', 28.10, 31.80, 23.70, 77.05, 0.40, 67.70, '[rain]', 0.00, 0.00, 35.60, 22.70, 88.20, 1006, 92.9, 13.9, 335, 1.2, 3, 30, 'Rain, Overcast', 'rain', 'None', 47, 'VN1105', 7280, 17, 1, 1, 1, 3, 1, 1, 1, 7, 2, 1);
INSERT INTO `staging` VALUES (1122, 'Sóc Trăng, Việt Nam', '2024-12-06T17:00:00', 26.90, 29.60, 23.60, 82.16, 0.30, 67.70, '[rain]', 0.00, 0.00, 38.50, 20.20, 88.20, 1006, 73.2, 24.1, 137, 0.5, 1, 10, 'Rain, Partially cloudy', 'rain', 'None', 47, 'VN1105', 7280, 18, 1, 1, 3, 3, 1, 1, 1, 7, 1, 6);
INSERT INTO `staging` VALUES (1123, 'Sóc Trăng, Việt Nam', '2024-12-06T18:00:00', 26.00, 26.00, 23.40, 85.60, 0.20, 67.70, '[rain]', 0.00, 0.00, 38.90, 16.60, 88.80, 1007, 41.1, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 47, 'VN1105', 7280, 19, 1, 1, 3, 3, 1, 1, 1, 5, 1, 3);
INSERT INTO `staging` VALUES (1124, 'Sóc Trăng, Việt Nam', '2024-12-06T19:00:00', 25.70, 25.70, 23.40, 87.14, 0.00, 67.70, '[rain]', 0.00, 0.00, 39.20, 14.80, 84.20, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 47, 'VN1105', 7280, 20, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1125, 'Sóc Trăng, Việt Nam', '2024-12-06T20:00:00', 25.70, 25.70, 23.40, 87.14, 0.00, 19.40, 'None', 0.00, 0.00, 41.80, 15.80, 83.20, 1009, 99.2, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 47, 'VN1105', 7280, 21, 1, 2, 2, 3, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1126, 'Sóc Trăng, Việt Nam', '2024-12-06T21:00:00', 25.80, 25.80, 23.40, 86.63, 0.00, 19.40, 'None', 0.00, 0.00, 44.30, 18.40, 82.40, 1009, 85.6, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 47, 'VN1105', 7280, 22, 1, 2, 6, 3, 4, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1127, 'Sóc Trăng, Việt Nam', '2024-12-06T22:00:00', 25.90, 25.90, 23.50, 86.63, 0.00, 19.40, 'None', 0.00, 0.00, 46.40, 20.50, 87.10, 1009, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 47, 'VN1105', 7280, 23, 1, 2, 2, 3, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (1128, 'Sóc Trăng, Việt Nam', '2024-12-06T23:00:00', 25.90, 25.90, 23.70, 87.69, 0.00, 19.40, 'None', 0.00, 0.00, 47.50, 20.90, 88.80, 1009, 4.1, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 47, 'VN1105', 7280, 24, 1, 2, 5, 3, 3, 1, 1, 7, 1, 5);
INSERT INTO `staging` VALUES (1129, 'Sơn La, Việt Nam', '2024-12-06T00:00:00', 17.40, 17.40, 15.60, 89.18, 0.00, 9.70, 'None', 0.00, 0.00, 17.30, 7.20, 146.00, 1014, 89, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 48, 'VN1129', 7280, 1, 1, 2, 6, 1, 4, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1130, 'Sơn La, Việt Nam', '2024-12-06T01:00:00', 17.00, 17.00, 15.70, 92.05, 0.00, 9.70, 'None', 0.00, 0.00, 16.60, 6.80, 146.10, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 48, 'VN1129', 7280, 2, 1, 2, 2, 1, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1131, 'Sơn La, Việt Nam', '2024-12-06T02:00:00', 17.10, 17.10, 15.70, 91.47, 0.00, 38.70, 'None', 0.00, 0.00, 15.50, 6.10, 147.50, 1013, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 48, 'VN1129', 7280, 3, 1, 2, 2, 1, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1132, 'Sơn La, Việt Nam', '2024-12-06T03:00:00', 17.00, 17.00, 15.70, 92.05, 0.00, 38.70, 'None', 0.00, 0.00, 14.80, 6.10, 140.30, 1013, 98.6, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 48, 'VN1129', 7280, 4, 1, 2, 2, 1, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1133, 'Sơn La, Việt Nam', '2024-12-06T04:00:00', 16.90, 16.90, 15.70, 92.64, 0.00, 38.70, 'None', 0.00, 0.00, 15.10, 6.50, 148.20, 1013, 99.9, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 48, 'VN1129', 7280, 5, 1, 2, 2, 1, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1134, 'Sơn La, Việt Nam', '2024-12-06T05:00:00', 16.70, 16.70, 15.80, 94.42, 0.00, 38.70, 'None', 0.00, 0.00, 17.30, 6.80, 138.40, 1013, 92.1, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 48, 'VN1129', 7280, 6, 1, 2, 2, 1, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1135, 'Sơn La, Việt Nam', '2024-12-06T06:00:00', 16.50, 16.50, 15.80, 95.63, 0.00, 38.70, 'None', 0.00, 0.00, 19.80, 7.90, 146.30, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 48, 'VN1129', 7280, 7, 1, 2, 2, 1, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1136, 'Sơn La, Việt Nam', '2024-12-06T07:00:00', 16.70, 16.70, 15.90, 95.03, 0.00, 38.70, 'None', 0.00, 0.00, 19.80, 7.90, 143.80, 1014, 99.5, 24.1, 2, 0, 0, 10, 'Overcast', 'cloudy', 'None', 48, 'VN1129', 7280, 8, 1, 2, 2, 1, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1137, 'Sơn La, Việt Nam', '2024-12-06T08:00:00', 17.40, 17.40, 16.10, 92.08, 0.00, 45.20, '[rain]', 0.00, 0.00, 16.60, 7.90, 135.50, 1015, 100, 24.1, 33, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 48, 'VN1129', 7280, 9, 1, 1, 1, 1, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1138, 'Sơn La, Việt Nam', '2024-12-06T09:00:00', 17.70, 17.70, 16.30, 91.51, 0.10, 45.20, '[rain]', 0.00, 0.00, 16.60, 7.20, 126.00, 1015, 100, 24.1, 28, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 48, 'VN1129', 7280, 10, 1, 1, 1, 2, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1139, 'Sơn La, Việt Nam', '2024-12-06T10:00:00', 18.20, 18.20, 16.30, 88.68, 0.00, 45.20, '[rain]', 0.00, 0.00, 14.80, 7.90, 125.40, 1015, 99.8, 24.1, 69, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 48, 'VN1129', 7280, 11, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1140, 'Sơn La, Việt Nam', '2024-12-06T11:00:00', 18.70, 18.70, 16.10, 84.85, 0.00, 45.20, '[rain]', 0.00, 0.00, 13.30, 7.60, 118.10, 1015, 99.3, 24.1, 93, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 48, 'VN1129', 7280, 12, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1141, 'Sơn La, Việt Nam', '2024-12-06T12:00:00', 19.20, 19.20, 16.00, 81.72, 0.10, 45.20, '[rain]', 0.00, 0.00, 12.60, 7.90, 111.40, 1014, 100, 24.1, 133, 0.5, 1, 10, 'Rain, Overcast', 'rain', 'None', 48, 'VN1129', 7280, 13, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1142, 'Sơn La, Việt Nam', '2024-12-06T13:00:00', 19.00, 19.00, 15.90, 82.22, 0.00, 45.20, '[rain]', 0.00, 0.00, 12.20, 7.60, 115.30, 1012, 97.5, 24.1, 78, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 48, 'VN1129', 7280, 14, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1143, 'Sơn La, Việt Nam', '2024-12-06T14:00:00', 19.60, 19.60, 15.90, 79.20, 0.00, 19.40, 'None', 0.00, 0.00, 11.20, 8.30, 121.40, 1011, 98.5, 24.1, 168, 0.6, 2, 10, 'Overcast', 'cloudy', 'None', 48, 'VN1129', 7280, 15, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1144, 'Sơn La, Việt Nam', '2024-12-06T15:00:00', 19.60, 19.60, 15.80, 78.70, 0.00, 19.40, 'None', 0.00, 0.00, 11.90, 7.90, 120.90, 1011, 56.2, 24.1, 146, 0.5, 1, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 48, 'VN1129', 7280, 16, 1, 2, 6, 2, 5, 1, 1, 1, 1, 3);
INSERT INTO `staging` VALUES (1145, 'Sơn La, Việt Nam', '2024-12-06T16:00:00', 20.20, 20.20, 16.00, 76.80, 0.00, 19.40, 'None', 0.00, 0.00, 13.30, 8.60, 120.20, 1011, 47.1, 24.1, 241, 0.9, 2, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 48, 'VN1129', 7280, 17, 1, 2, 6, 2, 5, 1, 1, 1, 1, 3);
INSERT INTO `staging` VALUES (1146, 'Sơn La, Việt Nam', '2024-12-06T17:00:00', 19.10, 19.10, 16.10, 82.76, 0.00, 19.40, 'None', 0.00, 0.00, 13.30, 7.20, 112.50, 1011, 47.8, 24.1, 90, 0.3, 1, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 48, 'VN1129', 7280, 18, 1, 2, 6, 2, 5, 1, 1, 1, 1, 3);
INSERT INTO `staging` VALUES (1147, 'Sơn La, Việt Nam', '2024-12-06T18:00:00', 17.30, 17.30, 15.80, 90.90, 0.00, 19.40, 'None', 0.00, 0.00, 11.50, 6.50, 127.00, 1012, 70.1, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 48, 'VN1129', 7280, 19, 1, 2, 6, 2, 4, 1, 3, 1, 1, 6);
INSERT INTO `staging` VALUES (1148, 'Sơn La, Việt Nam', '2024-12-06T19:00:00', 17.10, 17.10, 15.60, 90.89, 0.00, 19.40, 'None', 0.00, 0.00, 15.10, 6.80, 137.30, 1013, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 48, 'VN1129', 7280, 20, 1, 2, 2, 1, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1149, 'Sơn La, Việt Nam', '2024-12-06T20:00:00', 17.60, 17.60, 15.40, 86.94, 0.00, 0.00, 'None', 0.00, 0.00, 14.40, 6.50, 143.00, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 48, 'VN1129', 7280, 21, 1, 2, 2, 1, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1150, 'Sơn La, Việt Nam', '2024-12-06T21:00:00', 17.20, 17.20, 15.60, 90.32, 0.00, 0.00, 'None', 0.00, 0.00, 17.30, 7.60, 142.70, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 48, 'VN1129', 7280, 22, 1, 2, 2, 1, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1151, 'Sơn La, Việt Nam', '2024-12-06T22:00:00', 17.00, 17.00, 15.70, 92.05, 0.00, 0.00, '[rain]', 0.00, 0.00, 16.90, 7.20, 144.70, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 48, 'VN1129', 7280, 23, 1, 1, 2, 1, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1152, 'Sơn La, Việt Nam', '2024-12-06T23:00:00', 16.90, 16.90, 15.80, 93.23, 0.00, 0.00, 'None', 0.00, 0.00, 15.10, 6.80, 147.50, 1015, 100, 22.8, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 48, 'VN1129', 7280, 24, 1, 2, 2, 1, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1153, 'Tây Ninh, Việt Nam', '2024-12-06T00:00:00', 25.60, 25.60, 21.60, 78.58, 0.10, 74.20, '[rain]', 0.00, 0.00, 6.80, 6.80, 68.50, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 49, 'VN1153', 7280, 1, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1154, 'Tây Ninh, Việt Nam', '2024-12-06T01:00:00', 25.70, 25.70, 21.50, 77.63, 0.00, 74.20, '[rain]', 0.00, 0.00, 5.00, 4.70, 60.50, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 49, 'VN1153', 7280, 2, 1, 1, 1, 3, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1155, 'Tây Ninh, Việt Nam', '2024-12-06T02:00:00', 25.50, 25.50, 21.30, 77.60, 0.00, 29.00, 'None', 0.00, 0.00, 5.40, 5.00, 44.90, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 49, 'VN1153', 7280, 3, 1, 2, 2, 5, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1156, 'Tây Ninh, Việt Nam', '2024-12-06T03:00:00', 24.80, 24.80, 21.10, 79.92, 0.00, 29.00, 'None', 0.00, 0.00, 6.10, 5.80, 17.30, 1007, 95.3, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 49, 'VN1153', 7280, 4, 1, 2, 2, 5, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1157, 'Tây Ninh, Việt Nam', '2024-12-06T04:00:00', 24.10, 24.10, 20.90, 82.33, 0.00, 29.00, 'None', 0.00, 0.00, 8.30, 7.90, 18.50, 1007, 90.8, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 49, 'VN1153', 7280, 5, 1, 2, 2, 5, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1158, 'Tây Ninh, Việt Nam', '2024-12-06T05:00:00', 23.60, 23.60, 20.80, 84.32, 0.00, 29.00, 'None', 0.00, 0.00, 9.70, 8.30, 19.50, 1007, 67.7, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 49, 'VN1153', 7280, 6, 1, 2, 6, 5, 4, 1, 1, 1, 1, 6);
INSERT INTO `staging` VALUES (1159, 'Tây Ninh, Việt Nam', '2024-12-06T06:00:00', 23.20, 23.20, 20.90, 86.91, 0.00, 29.00, 'None', 0.00, 0.00, 10.10, 8.30, 24.60, 1008, 69.1, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 49, 'VN1153', 7280, 7, 1, 2, 6, 5, 4, 1, 1, 1, 1, 6);
INSERT INTO `staging` VALUES (1160, 'Tây Ninh, Việt Nam', '2024-12-06T07:00:00', 24.00, 24.00, 21.40, 85.40, 0.00, 29.00, 'None', 0.00, 0.00, 10.40, 7.90, 32.40, 1009, 86.4, 24.1, 46, 0.2, 0, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 49, 'VN1153', 7280, 8, 1, 2, 6, 5, 5, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1161, 'Tây Ninh, Việt Nam', '2024-12-06T08:00:00', 25.70, 25.70, 21.90, 79.56, 0.00, 9.70, 'None', 0.00, 0.00, 9.40, 8.30, 62.20, 1009, 60.8, 24.1, 203, 0.7, 2, 3, 'Partially cloudy', 'partly-cloudy-day', 'None', 49, 'VN1153', 7280, 9, 1, 2, 6, 3, 5, 1, 1, 1, 1, 2);
INSERT INTO `staging` VALUES (1162, 'Tây Ninh, Việt Nam', '2024-12-06T09:00:00', 27.60, 30.20, 22.50, 73.78, 0.00, 9.70, 'None', 0.00, 0.00, 7.90, 7.60, 79.90, 1010, 100, 24.1, 452, 1.6, 5, 10, 'Overcast', 'cloudy', 'None', 49, 'VN1153', 7280, 10, 1, 2, 2, 3, 2, 1, 1, 1, 2, 1);
INSERT INTO `staging` VALUES (1163, 'Tây Ninh, Việt Nam', '2024-12-06T10:00:00', 29.20, 32.80, 22.80, 68.46, 0.00, 9.70, 'None', 0.00, 0.00, 8.30, 8.60, 76.60, 1010, 95.9, 24.1, 618, 2.2, 6, 10, 'Overcast', 'cloudy', 'None', 49, 'VN1153', 7280, 11, 1, 2, 2, 3, 2, 1, 2, 1, 3, 1);
INSERT INTO `staging` VALUES (1164, 'Tây Ninh, Việt Nam', '2024-12-06T11:00:00', 30.40, 34.50, 22.90, 64.28, 0.00, 9.70, 'None', 0.00, 0.00, 8.30, 9.00, 65.60, 1009, 99.5, 24.1, 751, 2.7, 8, 10, 'Overcast', 'cloudy', 'None', 49, 'VN1153', 7280, 12, 1, 2, 2, 3, 2, 1, 2, 1, 4, 1);
INSERT INTO `staging` VALUES (1165, 'Tây Ninh, Việt Nam', '2024-12-06T12:00:00', 31.40, 35.80, 22.90, 60.71, 0.10, 9.70, '[rain]', 0.00, 0.00, 8.30, 9.40, 61.70, 1008, 100, 24.1, 799, 2.9, 8, 30, 'Overcast', 'cloudy', 'None', 49, 'VN1153', 7280, 13, 1, 1, 2, 3, 2, 1, 2, 1, 4, 1);
INSERT INTO `staging` VALUES (1166, 'Tây Ninh, Việt Nam', '2024-12-06T13:00:00', 31.60, 36.10, 22.90, 60.02, 0.10, 9.70, '[rain]', 0.00, 0.00, 8.60, 10.10, 72.20, 1007, 100, 24.1, 644, 2.3, 6, 30, 'Overcast', 'cloudy', 'None', 49, 'VN1153', 7280, 14, 1, 1, 2, 3, 2, 1, 2, 1, 3, 1);
INSERT INTO `staging` VALUES (1167, 'Tây Ninh, Việt Nam', '2024-12-06T14:00:00', 30.80, 35.00, 22.90, 62.82, 0.10, 48.40, '[rain]', 0.00, 0.00, 9.40, 11.50, 92.50, 1006, 100, 24.1, 353, 1.3, 4, 30, 'Rain, Overcast', 'rain', 'None', 49, 'VN1153', 7280, 15, 1, 1, 1, 2, 1, 1, 2, 2, 2, 1);
INSERT INTO `staging` VALUES (1168, 'Tây Ninh, Việt Nam', '2024-12-06T15:00:00', 29.50, 33.90, 23.60, 70.62, 0.00, 48.40, '[rain]', 0.00, 0.00, 11.20, 11.50, 103.50, 1006, 100, 24.1, 183, 0.7, 2, 30, 'Rain, Overcast', 'rain', 'None', 49, 'VN1153', 7280, 16, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1169, 'Tây Ninh, Việt Nam', '2024-12-06T16:00:00', 28.50, 32.50, 23.80, 75.73, 0.00, 48.40, '[rain]', 0.00, 0.00, 14.00, 10.80, 118.20, 1006, 100, 24.1, 122, 0.4, 1, 30, 'Rain, Overcast', 'rain', 'None', 49, 'VN1153', 7280, 17, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1170, 'Tây Ninh, Việt Nam', '2024-12-06T17:00:00', 27.70, 31.20, 23.80, 79.35, 0.10, 48.40, '[rain]', 0.00, 0.00, 10.40, 8.30, 139.60, 1006, 100, 24.1, 65, 0.2, 1, 30, 'Rain, Overcast', 'rain', 'None', 49, 'VN1153', 7280, 18, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1171, 'Tây Ninh, Việt Nam', '2024-12-06T18:00:00', 26.70, 26.70, 23.20, 81.15, 0.10, 48.40, '[rain]', 0.00, 0.00, 6.80, 6.80, 153.40, 1007, 99.9, 23.4, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 49, 'VN1153', 7280, 19, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1172, 'Tây Ninh, Việt Nam', '2024-12-06T19:00:00', 26.60, 26.60, 23.00, 80.65, 0.30, 48.40, '[rain]', 0.00, 0.00, 6.10, 6.10, 141.70, 1007, 59.7, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 49, 'VN1153', 7280, 20, 1, 1, 3, 1, 1, 1, 1, 1, 1, 3);
INSERT INTO `staging` VALUES (1173, 'Tây Ninh, Việt Nam', '2024-12-06T20:00:00', 26.50, 26.50, 22.90, 80.64, 0.00, 64.50, '[rain]', 0.00, 0.00, 5.80, 5.40, 121.00, 1008, 53.2, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 49, 'VN1153', 7280, 21, 1, 1, 3, 2, 1, 1, 1, 2, 1, 3);
INSERT INTO `staging` VALUES (1174, 'Tây Ninh, Việt Nam', '2024-12-06T21:00:00', 26.30, 26.30, 22.80, 81.10, 0.00, 64.50, '[rain]', 0.00, 0.00, 6.10, 5.80, 104.10, 1009, 65.7, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 49, 'VN1153', 7280, 22, 1, 1, 3, 2, 1, 1, 1, 2, 1, 6);
INSERT INTO `staging` VALUES (1175, 'Tây Ninh, Việt Nam', '2024-12-06T22:00:00', 25.70, 25.70, 22.80, 84.03, 0.00, 64.50, '[rain]', 0.00, 0.00, 7.20, 7.20, 117.60, 1009, 7.3, 24.1, 0, 0, 0, 10, 'Rain', 'rain', 'None', 49, 'VN1153', 7280, 23, 1, 1, 4, 2, 1, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (1176, 'Tây Ninh, Việt Nam', '2024-12-06T23:00:00', 25.10, 25.10, 22.90, 87.62, 0.00, 64.50, '[rain]', 0.00, 0.00, 5.80, 5.40, 123.50, 1009, 6.5, 24.1, 0, 0, 0, 10, 'Rain', 'rain', 'None', 49, 'VN1153', 7280, 24, 1, 1, 4, 2, 1, 1, 1, 2, 1, 5);
INSERT INTO `staging` VALUES (1177, 'Thái Bình, Việt Nam', '2024-12-06T00:00:00', 22.20, 22.20, 19.40, 84.17, 0.00, 0.00, 'None', 0.00, 0.00, 23.40, 11.20, 104.40, 1014, 99.7, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 50, 'VN1177', 7280, 1, 1, 2, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1178, 'Thái Bình, Việt Nam', '2024-12-06T01:00:00', 22.40, 22.40, 19.40, 83.15, 0.00, 0.00, 'None', 0.00, 0.00, 23.80, 12.20, 97.80, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 50, 'VN1177', 7280, 2, 1, 2, 2, 2, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1179, 'Thái Bình, Việt Nam', '2024-12-06T02:00:00', 22.50, 22.50, 19.40, 82.64, 0.00, 61.30, '[rain]', 0.00, 0.00, 25.60, 14.00, 94.40, 1013, 91.6, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 50, 'VN1177', 7280, 3, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1180, 'Thái Bình, Việt Nam', '2024-12-06T03:00:00', 22.40, 22.40, 19.50, 83.67, 0.00, 61.30, '[rain]', 0.00, 0.00, 28.40, 16.20, 91.90, 1013, 49.1, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 50, 'VN1177', 7280, 4, 1, 1, 3, 2, 1, 1, 1, 5, 1, 3);
INSERT INTO `staging` VALUES (1181, 'Thái Bình, Việt Nam', '2024-12-06T04:00:00', 22.30, 22.30, 19.40, 83.66, 0.10, 61.30, '[rain]', 0.00, 0.00, 29.50, 15.80, 87.50, 1013, 97.8, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 50, 'VN1177', 7280, 5, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1182, 'Thái Bình, Việt Nam', '2024-12-06T05:00:00', 22.40, 22.40, 19.60, 84.19, 0.20, 61.30, '[rain]', 0.00, 0.00, 29.20, 15.50, 88.10, 1013, 100, 17.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 50, 'VN1177', 7280, 6, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1183, 'Thái Bình, Việt Nam', '2024-12-06T06:00:00', 22.50, 22.50, 19.60, 83.68, 0.30, 61.30, '[rain]', 0.00, 0.00, 30.60, 17.30, 93.20, 1014, 100, 17.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 50, 'VN1177', 7280, 7, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1184, 'Thái Bình, Việt Nam', '2024-12-06T07:00:00', 22.70, 22.70, 19.40, 81.65, 0.30, 61.30, '[rain]', 0.00, 0.00, 30.60, 18.40, 93.50, 1014, 100, 21.8, 7, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 50, 'VN1177', 7280, 8, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1185, 'Thái Bình, Việt Nam', '2024-12-06T08:00:00', 23.00, 23.00, 19.40, 80.18, 0.10, 51.60, '[rain]', 0.00, 0.00, 31.00, 19.10, 92.20, 1015, 100, 24.1, 25, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 50, 'VN1177', 7280, 9, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1186, 'Thái Bình, Việt Nam', '2024-12-06T09:00:00', 23.30, 23.30, 19.40, 78.73, 0.10, 51.60, '[rain]', 0.00, 0.00, 29.90, 19.40, 96.40, 1015, 100, 24.1, 47, 0.2, 0, 10, 'Rain, Overcast', 'rain', 'None', 50, 'VN1177', 7280, 10, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1187, 'Thái Bình, Việt Nam', '2024-12-06T10:00:00', 23.50, 23.50, 19.40, 77.79, 0.10, 51.60, '[rain]', 0.00, 0.00, 28.40, 19.80, 97.60, 1015, 92.5, 24.1, 72, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 50, 'VN1177', 7280, 11, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1188, 'Thái Bình, Việt Nam', '2024-12-06T11:00:00', 24.70, 24.70, 19.20, 71.49, 0.10, 51.60, '[rain]', 0.00, 0.00, 24.50, 22.30, 99.80, 1014, 79.1, 20.4, 316, 1.1, 3, 10, 'Rain, Partially cloudy', 'rain', 'None', 50, 'VN1177', 7280, 12, 1, 1, 3, 2, 1, 1, 1, 7, 2, 6);
INSERT INTO `staging` VALUES (1189, 'Thái Bình, Việt Nam', '2024-12-06T12:00:00', 25.20, 25.20, 19.20, 69.38, 0.30, 51.60, '[rain]', 0.00, 0.00, 23.80, 22.30, 98.40, 1013, 84.9, 21.6, 408, 1.5, 4, 10, 'Rain, Partially cloudy', 'rain', 'None', 50, 'VN1177', 7280, 13, 1, 1, 3, 2, 1, 1, 2, 7, 2, 1);
INSERT INTO `staging` VALUES (1190, 'Thái Bình, Việt Nam', '2024-12-06T13:00:00', 25.50, 25.50, 19.00, 67.31, 0.10, 51.60, '[rain]', 0.00, 0.00, 22.70, 21.60, 102.80, 1012, 88.7, 24.1, 345, 1.2, 3, 10, 'Rain, Partially cloudy', 'rain', 'None', 50, 'VN1177', 7280, 14, 1, 1, 3, 2, 1, 1, 2, 7, 2, 1);
INSERT INTO `staging` VALUES (1191, 'Thái Bình, Việt Nam', '2024-12-06T14:00:00', 25.50, 25.50, 18.70, 66.06, 0.10, 6.50, '[rain]', 0.00, 0.00, 22.70, 22.30, 106.50, 1011, 94.1, 24.1, 338, 1.2, 3, 10, 'Overcast', 'cloudy', 'None', 50, 'VN1177', 7280, 15, 1, 1, 2, 2, 2, 1, 2, 7, 2, 1);
INSERT INTO `staging` VALUES (1192, 'Thái Bình, Việt Nam', '2024-12-06T15:00:00', 24.80, 24.80, 18.90, 69.74, 0.10, 6.50, '[rain]', 0.00, 0.00, 24.50, 22.70, 106.90, 1011, 66.5, 24.1, 202, 0.7, 2, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 50, 'VN1177', 7280, 16, 1, 1, 6, 2, 5, 1, 2, 7, 1, 6);
INSERT INTO `staging` VALUES (1193, 'Thái Bình, Việt Nam', '2024-12-06T16:00:00', 24.20, 24.20, 18.90, 72.29, 0.00, 6.50, 'None', 0.00, 0.00, 26.30, 22.70, 104.90, 1011, 75.8, 24.1, 171, 0.6, 2, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 50, 'VN1177', 7280, 17, 1, 2, 6, 2, 5, 1, 1, 7, 1, 6);
INSERT INTO `staging` VALUES (1194, 'Thái Bình, Việt Nam', '2024-12-06T17:00:00', 23.50, 23.50, 18.80, 74.93, 0.00, 6.50, 'None', 0.00, 0.00, 27.00, 20.90, 100.30, 1012, 90.8, 24.1, 49, 0.2, 0, 10, 'Overcast', 'cloudy', 'None', 50, 'VN1177', 7280, 18, 1, 2, 2, 2, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (1195, 'Thái Bình, Việt Nam', '2024-12-06T18:00:00', 23.10, 23.10, 18.70, 76.29, 0.00, 6.50, 'None', 0.00, 0.00, 29.50, 20.20, 98.00, 1013, 91.8, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 50, 'VN1177', 7280, 19, 1, 2, 2, 2, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (1196, 'Thái Bình, Việt Nam', '2024-12-06T19:00:00', 23.00, 23.00, 18.80, 77.23, 0.00, 6.50, 'None', 0.00, 0.00, 30.20, 19.80, 96.40, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 50, 'VN1177', 7280, 20, 1, 2, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1197, 'Thái Bình, Việt Nam', '2024-12-06T20:00:00', 23.00, 23.00, 18.50, 75.79, 0.00, 0.00, 'None', 0.00, 0.00, 30.60, 19.80, 99.30, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 50, 'VN1177', 7280, 21, 1, 2, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1198, 'Thái Bình, Việt Nam', '2024-12-06T21:00:00', 22.90, 22.90, 18.60, 76.73, 0.00, 0.00, 'None', 0.00, 0.00, 32.40, 20.20, 99.20, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 50, 'VN1177', 7280, 22, 1, 2, 2, 2, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (1199, 'Thái Bình, Việt Nam', '2024-12-06T22:00:00', 22.80, 22.80, 18.70, 77.69, 0.00, 0.00, 'None', 0.00, 0.00, 33.50, 20.50, 98.80, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 50, 'VN1177', 7280, 23, 1, 2, 2, 2, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (1200, 'Thái Bình, Việt Nam', '2024-12-06T23:00:00', 22.60, 22.60, 18.50, 77.66, 0.00, 0.00, 'None', 0.00, 0.00, 33.80, 22.00, 95.10, 1015, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 50, 'VN1177', 7280, 24, 1, 2, 2, 2, 2, 1, 1, 7, 1, 1);
INSERT INTO `staging` VALUES (1201, 'Thái Nguyên, Việt Nam', '2024-12-06T00:00:00', 21.30, 21.30, 17.40, 78.45, 0.00, 0.00, 'None', 0.00, 0.00, 22.70, 9.00, 148.90, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 51, 'VN1201', 7280, 1, 1, 2, 2, 1, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1202, 'Thái Nguyên, Việt Nam', '2024-12-06T01:00:00', 21.10, 21.10, 17.20, 78.42, 0.00, 0.00, 'None', 0.00, 0.00, 23.00, 9.00, 148.50, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 51, 'VN1201', 7280, 2, 1, 2, 2, 1, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1203, 'Thái Nguyên, Việt Nam', '2024-12-06T02:00:00', 20.90, 20.90, 17.00, 78.39, 0.00, 3.20, 'None', 0.00, 0.00, 19.10, 6.80, 146.70, 1014, 93.9, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 51, 'VN1201', 7280, 3, 1, 2, 2, 1, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1204, 'Thái Nguyên, Việt Nam', '2024-12-06T03:00:00', 20.70, 20.70, 16.90, 78.86, 0.00, 3.20, '[rain]', 0.00, 0.00, 14.40, 5.00, 135.20, 1014, 99.6, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 51, 'VN1201', 7280, 4, 1, 1, 2, 1, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1205, 'Thái Nguyên, Việt Nam', '2024-12-06T04:00:00', 20.70, 20.70, 16.80, 78.36, 0.10, 3.20, '[rain]', 0.00, 0.00, 12.20, 5.00, 121.10, 1013, 85.2, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 51, 'VN1201', 7280, 5, 1, 1, 6, 2, 4, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1206, 'Thái Nguyên, Việt Nam', '2024-12-06T05:00:00', 20.50, 20.50, 16.70, 78.83, 0.00, 3.20, 'None', 0.00, 0.00, 7.60, 4.00, 88.90, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 51, 'VN1201', 7280, 6, 1, 2, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1207, 'Thái Nguyên, Việt Nam', '2024-12-06T06:00:00', 20.40, 20.40, 16.60, 78.81, 0.00, 3.20, '[rain]', 0.00, 0.00, 10.40, 5.40, 108.70, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 51, 'VN1201', 7280, 7, 1, 1, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1208, 'Thái Nguyên, Việt Nam', '2024-12-06T07:00:00', 20.40, 20.40, 16.40, 77.82, 0.10, 3.20, '[rain]', 0.00, 0.00, 12.60, 5.00, 94.80, 1015, 90.5, 24.1, 2, 0, 0, 10, 'Overcast', 'cloudy', 'None', 51, 'VN1201', 7280, 8, 1, 1, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1209, 'Thái Nguyên, Việt Nam', '2024-12-06T08:00:00', 21.30, 21.30, 16.20, 72.69, 0.00, 6.50, 'None', 0.00, 0.00, 12.20, 6.50, 104.30, 1016, 100, 24.1, 71, 0.3, 1, 10, 'Overcast', 'cloudy', 'None', 51, 'VN1201', 7280, 9, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1210, 'Thái Nguyên, Việt Nam', '2024-12-06T09:00:00', 21.10, 21.10, 16.50, 75.01, 0.00, 6.50, 'None', 0.00, 0.00, 14.80, 8.30, 105.90, 1016, 100, 24.1, 34, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 51, 'VN1201', 7280, 10, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1211, 'Thái Nguyên, Việt Nam', '2024-12-06T10:00:00', 21.40, 21.40, 16.80, 75.06, 0.00, 6.50, 'None', 0.00, 0.00, 13.70, 7.60, 108.40, 1016, 100, 24.1, 76, 0.3, 1, 10, 'Overcast', 'cloudy', 'None', 51, 'VN1201', 7280, 11, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1212, 'Thái Nguyên, Việt Nam', '2024-12-06T11:00:00', 21.30, 21.30, 17.00, 76.49, 0.10, 6.50, '[rain]', 0.00, 0.00, 14.00, 8.30, 108.30, 1015, 100, 24.1, 41, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 51, 'VN1201', 7280, 12, 1, 1, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1213, 'Thái Nguyên, Việt Nam', '2024-12-06T12:00:00', 21.30, 21.30, 17.20, 77.46, 0.00, 6.50, '[rain]', 0.00, 0.00, 13.00, 7.60, 102.60, 1014, 100, 24, 37, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 51, 'VN1201', 7280, 13, 1, 1, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1214, 'Thái Nguyên, Việt Nam', '2024-12-06T13:00:00', 20.80, 20.80, 17.30, 80.38, 0.10, 6.50, '[rain]', 0.00, 0.00, 14.80, 7.20, 99.60, 1013, 100, 24.1, 18, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 51, 'VN1201', 7280, 14, 1, 1, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1215, 'Thái Nguyên, Việt Nam', '2024-12-06T14:00:00', 20.60, 20.60, 17.50, 82.42, 0.20, 45.20, '[rain]', 0.00, 0.00, 14.80, 6.50, 91.00, 1012, 100, 24.1, 16, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 51, 'VN1201', 7280, 15, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1216, 'Thái Nguyên, Việt Nam', '2024-12-06T15:00:00', 20.60, 20.60, 17.40, 81.90, 0.20, 45.20, '[rain]', 0.00, 0.00, 14.80, 6.50, 76.70, 1012, 100, 24.1, 16, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 51, 'VN1201', 7280, 16, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1217, 'Thái Nguyên, Việt Nam', '2024-12-06T16:00:00', 20.50, 20.50, 17.30, 81.88, 0.00, 45.20, '[rain]', 0.00, 0.00, 10.40, 5.40, 51.70, 1012, 100, 24.1, 9, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 51, 'VN1201', 7280, 17, 1, 1, 1, 3, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1218, 'Thái Nguyên, Việt Nam', '2024-12-06T17:00:00', 20.20, 20.20, 17.30, 83.42, 0.10, 45.20, '[rain]', 0.00, 0.00, 10.10, 6.80, 12.90, 1013, 100, 24.1, 3, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 51, 'VN1201', 7280, 18, 1, 1, 1, 5, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1219, 'Thái Nguyên, Việt Nam', '2024-12-06T18:00:00', 19.80, 19.80, 17.30, 85.51, 0.20, 45.20, '[rain]', 0.00, 0.00, 11.50, 6.50, 14.70, 1013, 100, 22.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 51, 'VN1201', 7280, 19, 1, 1, 1, 5, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1220, 'Thái Nguyên, Việt Nam', '2024-12-06T19:00:00', 19.40, 19.40, 17.40, 88.22, 0.50, 45.20, '[rain]', 0.00, 0.00, 7.60, 5.00, 352.50, 1014, 100, 22.8, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 51, 'VN1201', 7280, 20, 1, 1, 1, 4, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1221, 'Thái Nguyên, Việt Nam', '2024-12-06T20:00:00', 19.10, 19.10, 17.30, 89.31, 0.30, 32.30, '[rain]', 0.00, 0.00, 6.80, 5.00, 342.30, 1015, 100, 21.3, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 51, 'VN1201', 7280, 21, 1, 1, 2, 4, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1222, 'Thái Nguyên, Việt Nam', '2024-12-06T21:00:00', 18.90, 18.90, 17.20, 89.86, 0.50, 32.30, '[rain]', 0.00, 0.00, 7.20, 4.70, 351.00, 1015, 100, 18.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 51, 'VN1201', 7280, 22, 1, 1, 2, 4, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1223, 'Thái Nguyên, Việt Nam', '2024-12-06T22:00:00', 18.70, 18.70, 16.80, 88.72, 0.30, 32.30, '[rain]', 0.00, 0.00, 11.20, 6.80, 3.30, 1015, 100, 22.7, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 51, 'VN1201', 7280, 23, 1, 1, 2, 5, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1224, 'Thái Nguyên, Việt Nam', '2024-12-06T23:00:00', 18.10, 18.10, 16.10, 88.10, 0.60, 32.30, '[rain]', 0.00, 0.00, 11.50, 6.80, 6.40, 1016, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 51, 'VN1201', 7280, 24, 1, 1, 2, 5, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1225, 'Huế, Việt Nam', '2024-12-06T00:00:00', 20.90, 20.90, 20.30, 96.37, 0.00, 90.30, '[rain]', 0.00, 0.00, 5.00, 4.30, 174.60, 1013, 93.7, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 52, 'VN1225', 7280, 1, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1226, 'Huế, Việt Nam', '2024-12-06T01:00:00', 20.70, 20.70, 20.10, 96.36, 0.00, 90.30, '[rain]', 0.00, 0.00, 5.00, 4.30, 174.20, 1013, 79.3, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 52, 'VN1225', 7280, 2, 1, 1, 3, 1, 1, 1, 3, 3, 1, 6);
INSERT INTO `staging` VALUES (1227, 'Huế, Việt Nam', '2024-12-06T02:00:00', 20.60, 20.60, 20.00, 96.36, 0.00, 100.00, '[rain]', 0.00, 0.00, 4.70, 4.00, 174.30, 1012, 18, 24.1, 0, 0, 0, 10, 'Rain', 'rain', 'None', 52, 'VN1225', 7280, 3, 1, 1, 4, 1, 1, 1, 3, 3, 1, 5);
INSERT INTO `staging` VALUES (1228, 'Huế, Việt Nam', '2024-12-06T03:00:00', 20.50, 20.50, 19.90, 96.36, 0.10, 100.00, '[rain]', 0.00, 0.00, 4.30, 2.90, 172.60, 1012, 28.3, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 52, 'VN1225', 7280, 4, 1, 1, 3, 1, 1, 1, 3, 3, 1, 4);
INSERT INTO `staging` VALUES (1229, 'Huế, Việt Nam', '2024-12-06T04:00:00', 20.50, 20.50, 19.80, 95.76, 0.00, 100.00, '[rain]', 0.00, 0.00, 5.80, 3.60, 164.00, 1012, 44.8, 23.6, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 52, 'VN1225', 7280, 5, 1, 1, 3, 1, 1, 1, 3, 3, 1, 3);
INSERT INTO `staging` VALUES (1230, 'Huế, Việt Nam', '2024-12-06T05:00:00', 20.60, 20.60, 19.90, 95.77, 0.10, 100.00, '[rain]', 0.00, 0.00, 7.20, 4.70, 156.90, 1013, 71.2, 23, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 52, 'VN1225', 7280, 6, 1, 1, 3, 1, 1, 1, 3, 3, 1, 6);
INSERT INTO `staging` VALUES (1231, 'Huế, Việt Nam', '2024-12-06T06:00:00', 21.00, 21.00, 20.20, 95.19, 0.10, 100.00, '[rain]', 0.00, 0.00, 8.30, 5.40, 145.20, 1013, 93.8, 11.4, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 52, 'VN1225', 7280, 7, 1, 1, 1, 1, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1232, 'Huế, Việt Nam', '2024-12-06T07:00:00', 21.50, 21.50, 20.60, 94.62, 0.10, 100.00, '[rain]', 0.00, 0.00, 9.70, 5.80, 137.20, 1014, 93.9, 22.8, 13, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 52, 'VN1225', 7280, 8, 1, 1, 1, 1, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1233, 'Huế, Việt Nam', '2024-12-06T08:00:00', 22.20, 22.20, 20.90, 92.35, 0.20, 90.30, '[rain]', 0.00, 0.00, 12.20, 6.10, 137.00, 1014, 89.2, 24.1, 68, 0.2, 1, 10, 'Rain, Partially cloudy', 'rain', 'None', 52, 'VN1225', 7280, 9, 1, 1, 3, 1, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1234, 'Huế, Việt Nam', '2024-12-06T09:00:00', 23.10, 23.10, 21.20, 89.07, 0.00, 90.30, '[rain]', 0.00, 0.00, 16.20, 8.30, 133.80, 1015, 84, 23.3, 166, 0.6, 2, 10, 'Rain, Partially cloudy', 'rain', 'None', 52, 'VN1225', 7280, 10, 1, 1, 3, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1235, 'Huế, Việt Nam', '2024-12-06T10:00:00', 23.90, 23.90, 21.30, 85.39, 0.10, 90.30, '[rain]', 0.00, 0.00, 22.30, 9.70, 126.10, 1014, 90.5, 24.1, 247, 0.9, 2, 10, 'Rain, Overcast', 'rain', 'None', 52, 'VN1225', 7280, 11, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1236, 'Huế, Việt Nam', '2024-12-06T11:00:00', 24.30, 24.30, 21.20, 82.86, 0.00, 90.30, '[rain]', 0.00, 0.00, 23.80, 11.20, 122.60, 1013, 98.5, 24.1, 315, 1.1, 3, 10, 'Rain, Overcast', 'rain', 'None', 52, 'VN1225', 7280, 12, 1, 1, 1, 2, 1, 1, 1, 2, 2, 1);
INSERT INTO `staging` VALUES (1237, 'Huế, Việt Nam', '2024-12-06T12:00:00', 24.20, 24.20, 21.30, 83.87, 0.20, 90.30, '[rain]', 0.00, 0.00, 22.30, 11.90, 107.40, 1012, 99.1, 23.6, 229, 0.8, 2, 10, 'Rain, Overcast', 'rain', 'None', 52, 'VN1225', 7280, 13, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1238, 'Huế, Việt Nam', '2024-12-06T13:00:00', 24.20, 24.20, 21.40, 84.38, 0.10, 90.30, '[rain]', 0.00, 0.00, 22.00, 13.00, 98.10, 1011, 99.6, 23.2, 235, 0.8, 2, 10, 'Rain, Overcast', 'rain', 'None', 52, 'VN1225', 7280, 14, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1239, 'Huế, Việt Nam', '2024-12-06T14:00:00', 23.80, 23.80, 21.30, 85.91, 0.10, 77.40, '[rain]', 0.00, 0.00, 23.40, 14.00, 91.20, 1011, 99.8, 21.9, 167, 0.6, 2, 10, 'Rain, Overcast', 'rain', 'None', 52, 'VN1225', 7280, 15, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1240, 'Huế, Việt Nam', '2024-12-06T15:00:00', 23.20, 23.20, 21.20, 88.53, 0.20, 77.40, '[rain]', 0.00, 0.00, 27.00, 14.00, 88.80, 1011, 100, 24.1, 104, 0.4, 1, 10, 'Rain, Overcast', 'rain', 'None', 52, 'VN1225', 7280, 16, 1, 1, 1, 3, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1241, 'Huế, Việt Nam', '2024-12-06T16:00:00', 22.70, 22.70, 21.00, 90.14, 0.10, 77.40, '[rain]', 0.00, 0.00, 29.50, 14.00, 88.30, 1011, 99.5, 24.1, 37, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 52, 'VN1225', 7280, 17, 1, 1, 1, 3, 1, 1, 3, 5, 1, 1);
INSERT INTO `staging` VALUES (1242, 'Huế, Việt Nam', '2024-12-06T17:00:00', 22.50, 22.50, 20.80, 90.12, 0.20, 77.40, '[rain]', 0.00, 0.00, 30.60, 14.40, 95.30, 1012, 97.7, 24.1, 14, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 52, 'VN1225', 7280, 18, 1, 1, 1, 2, 1, 1, 3, 5, 1, 1);
INSERT INTO `staging` VALUES (1243, 'Huế, Việt Nam', '2024-12-06T18:00:00', 22.30, 22.30, 20.80, 91.23, 0.00, 77.40, '[rain]', 0.00, 0.00, 30.20, 13.30, 106.70, 1012, 98.8, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 52, 'VN1225', 7280, 19, 1, 1, 1, 2, 1, 1, 3, 5, 1, 1);
INSERT INTO `staging` VALUES (1244, 'Huế, Việt Nam', '2024-12-06T19:00:00', 22.30, 22.30, 20.80, 91.23, 0.00, 77.40, '[rain]', 0.00, 0.00, 29.90, 11.90, 116.50, 1013, 97.3, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 52, 'VN1225', 7280, 20, 1, 1, 1, 2, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1245, 'Huế, Việt Nam', '2024-12-06T20:00:00', 22.20, 22.20, 20.80, 91.78, 0.00, 22.60, 'None', 0.00, 0.00, 24.80, 9.70, 123.50, 1013, 92.2, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 52, 'VN1225', 7280, 21, 1, 2, 2, 2, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1246, 'Huế, Việt Nam', '2024-12-06T21:00:00', 22.00, 22.00, 20.80, 92.91, 0.00, 22.60, 'None', 0.00, 0.00, 13.70, 7.20, 131.00, 1014, 85.8, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 52, 'VN1225', 7280, 22, 1, 2, 6, 2, 4, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1247, 'Huế, Việt Nam', '2024-12-06T22:00:00', 21.90, 21.90, 20.70, 92.91, 0.00, 22.60, 'None', 0.00, 0.00, 10.80, 6.10, 138.90, 1014, 85.9, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 52, 'VN1225', 7280, 23, 1, 2, 6, 1, 4, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1248, 'Huế, Việt Nam', '2024-12-06T23:00:00', 21.90, 21.90, 20.80, 93.48, 0.10, 22.60, '[rain]', 0.00, 0.00, 10.10, 6.10, 133.70, 1013, 82.5, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 52, 'VN1225', 7280, 24, 1, 1, 6, 2, 4, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1249, 'Tiền Giang, Việt Nam', '2024-12-06T00:00:00', 24.50, 24.50, 23.50, 94.17, 0.00, 67.70, '[rain]', 0.00, 0.00, 25.90, 5.80, 134.00, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 53, 'VN1249', 7280, 1, 1, 1, 1, 2, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1250, 'Tiền Giang, Việt Nam', '2024-12-06T01:00:00', 24.40, 24.40, 23.40, 94.16, 0.00, 67.70, '[rain]', 0.00, 0.00, 19.40, 5.00, 134.60, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 53, 'VN1249', 7280, 2, 1, 1, 1, 2, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1251, 'Tiền Giang, Việt Nam', '2024-12-06T02:00:00', 24.30, 24.30, 23.40, 94.73, 0.00, 0.00, 'None', 0.00, 0.00, 20.50, 5.00, 120.50, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 53, 'VN1249', 7280, 3, 1, 2, 2, 2, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1252, 'Tiền Giang, Việt Nam', '2024-12-06T03:00:00', 24.30, 24.30, 23.50, 95.30, 0.00, 0.00, 'None', 0.00, 0.00, 7.20, 4.00, 97.70, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 53, 'VN1249', 7280, 4, 1, 2, 2, 2, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1253, 'Tiền Giang, Việt Nam', '2024-12-06T04:00:00', 24.00, 24.00, 23.40, 96.45, 0.00, 0.00, 'None', 0.00, 0.00, 9.70, 4.70, 85.20, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 53, 'VN1249', 7280, 5, 1, 2, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1254, 'Tiền Giang, Việt Nam', '2024-12-06T05:00:00', 23.90, 23.90, 23.40, 97.03, 0.00, 0.00, 'None', 0.00, 0.00, 12.60, 5.40, 80.10, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 53, 'VN1249', 7280, 6, 1, 2, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1255, 'Tiền Giang, Việt Nam', '2024-12-06T06:00:00', 23.70, 23.70, 23.20, 97.03, 0.00, 0.00, 'None', 0.00, 0.00, 11.20, 5.00, 73.50, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 53, 'VN1249', 7280, 7, 1, 2, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1256, 'Tiền Giang, Việt Nam', '2024-12-06T07:00:00', 24.20, 24.20, 23.50, 95.88, 0.00, 0.00, 'None', 0.00, 0.00, 10.10, 4.70, 55.00, 1009, 100, 24.1, 27, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 53, 'VN1249', 7280, 8, 1, 2, 2, 3, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1257, 'Tiền Giang, Việt Nam', '2024-12-06T08:00:00', 25.20, 25.20, 23.80, 91.96, 0.00, 67.70, '[rain]', 0.00, 0.00, 9.40, 5.40, 45.30, 1009, 100, 24.1, 123, 0.4, 1, 10, 'Rain, Overcast', 'rain', 'None', 53, 'VN1249', 7280, 9, 1, 1, 1, 3, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1258, 'Tiền Giang, Việt Nam', '2024-12-06T09:00:00', 26.80, 29.60, 24.00, 84.66, 0.10, 67.70, '[rain]', 0.00, 0.00, 8.30, 5.00, 37.10, 1010, 100, 24.1, 302, 1.1, 3, 10, 'Rain, Overcast', 'rain', 'None', 53, 'VN1249', 7280, 10, 1, 1, 1, 5, 1, 1, 1, 2, 2, 1);
INSERT INTO `staging` VALUES (1259, 'Tiền Giang, Việt Nam', '2024-12-06T10:00:00', 27.80, 31.70, 24.30, 81.29, 0.60, 67.70, '[rain]', 0.00, 0.00, 7.60, 5.40, 46.10, 1010, 100, 18.1, 435, 1.6, 4, 30, 'Rain, Overcast', 'rain', 'None', 53, 'VN1249', 7280, 11, 1, 1, 1, 3, 1, 1, 1, 2, 2, 1);
INSERT INTO `staging` VALUES (1260, 'Tiền Giang, Việt Nam', '2024-12-06T11:00:00', 29.00, 33.80, 24.40, 76.27, 0.90, 67.70, '[rain]', 0.00, 0.00, 11.90, 6.50, 52.50, 1009, 100, 18.3, 690, 2.5, 7, 30, 'Rain, Overcast', 'rain', 'None', 53, 'VN1249', 7280, 12, 1, 1, 1, 3, 1, 1, 1, 1, 3, 1);
INSERT INTO `staging` VALUES (1261, 'Tiền Giang, Việt Nam', '2024-12-06T12:00:00', 30.10, 35.20, 24.10, 70.30, 0.70, 67.70, '[rain]', 0.00, 0.00, 14.80, 7.20, 52.80, 1008, 100, 4.3, 823, 3, 8, 30, 'Rain, Overcast', 'rain', 'None', 53, 'VN1249', 7280, 13, 1, 1, 1, 3, 1, 1, 1, 1, 4, 1);
INSERT INTO `staging` VALUES (1262, 'Tiền Giang, Việt Nam', '2024-12-06T13:00:00', 30.30, 35.70, 24.30, 70.34, 0.60, 67.70, '[rain]', 0.00, 0.00, 16.20, 9.40, 59.50, 1007, 97.9, 8.7, 805, 2.9, 8, 30, 'Rain, Overcast', 'rain', 'None', 53, 'VN1249', 7280, 14, 1, 1, 1, 3, 1, 1, 1, 1, 4, 1);
INSERT INTO `staging` VALUES (1263, 'Tiền Giang, Việt Nam', '2024-12-06T14:00:00', 29.60, 35.20, 24.80, 75.45, 0.70, 77.40, '[rain]', 0.00, 0.00, 15.10, 9.00, 61.70, 1006, 13.1, 10.6, 591, 2.1, 6, 60, 'Rain', 'rain', 'None', 53, 'VN1249', 7280, 15, 1, 1, 4, 3, 1, 1, 1, 1, 3, 5);
INSERT INTO `staging` VALUES (1264, 'Tiền Giang, Việt Nam', '2024-12-06T15:00:00', 29.40, 35.10, 25.00, 77.24, 0.60, 77.40, '[rain]', 0.00, 0.00, 15.10, 8.30, 63.70, 1006, 5, 10.5, 575, 2.1, 6, 60, 'Rain', 'rain', 'None', 53, 'VN1249', 7280, 16, 1, 1, 4, 3, 1, 1, 1, 1, 3, 5);
INSERT INTO `staging` VALUES (1265, 'Tiền Giang, Việt Nam', '2024-12-06T16:00:00', 28.60, 33.80, 25.10, 81.39, 0.50, 77.40, '[rain]', 0.00, 0.00, 14.80, 7.20, 69.50, 1006, 0, 10.7, 394, 1.4, 4, 60, 'Rain', 'rain', 'None', 53, 'VN1249', 7280, 17, 1, 1, 4, 3, 1, 1, 1, 1, 2, 5);
INSERT INTO `staging` VALUES (1266, 'Tiền Giang, Việt Nam', '2024-12-06T17:00:00', 27.00, 30.40, 24.80, 87.78, 0.30, 77.40, '[rain]', 0.00, 0.00, 13.30, 6.10, 88.40, 1006, 5, 24.1, 172, 0.6, 2, 30, 'Rain', 'rain', 'None', 53, 'VN1249', 7280, 18, 1, 1, 4, 3, 1, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (1267, 'Tiền Giang, Việt Nam', '2024-12-06T18:00:00', 25.00, 25.00, 23.60, 91.95, 0.10, 77.40, '[rain]', 0.00, 0.00, 16.20, 6.80, 110.60, 1007, 5, 24.1, 0, 0, 0, 10, 'Rain', 'rain', 'None', 53, 'VN1249', 7280, 19, 1, 1, 4, 2, 1, 1, 3, 1, 1, 5);
INSERT INTO `staging` VALUES (1268, 'Tiền Giang, Việt Nam', '2024-12-06T19:00:00', 24.30, 24.30, 23.30, 94.16, 0.10, 77.40, '[rain]', 0.00, 0.00, 17.30, 6.10, 120.60, 1008, 35.5, 24.1, 0, 0, 0, 10, 'Rain, Partially cloudy', 'rain', 'None', 53, 'VN1249', 7280, 20, 1, 1, 3, 2, 1, 1, 3, 1, 1, 4);
INSERT INTO `staging` VALUES (1269, 'Tiền Giang, Việt Nam', '2024-12-06T20:00:00', 24.20, 24.20, 23.40, 95.30, 0.00, 16.10, 'None', 0.00, 0.00, 20.90, 5.80, 121.70, 1009, 17.1, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 53, 'VN1249', 7280, 21, 1, 2, 5, 2, 3, 1, 3, 2, 1, 5);
INSERT INTO `staging` VALUES (1270, 'Tiền Giang, Việt Nam', '2024-12-06T21:00:00', 24.30, 24.30, 23.50, 95.30, 0.00, 16.10, 'None', 0.00, 0.00, 23.80, 6.10, 120.20, 1009, 9.6, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 53, 'VN1249', 7280, 22, 1, 2, 5, 2, 3, 1, 3, 1, 1, 5);
INSERT INTO `staging` VALUES (1271, 'Tiền Giang, Việt Nam', '2024-12-06T22:00:00', 24.30, 24.30, 23.50, 95.30, 0.00, 16.10, 'None', 0.00, 0.00, 26.60, 6.50, 112.60, 1009, 10.1, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 53, 'VN1249', 7280, 23, 1, 2, 5, 2, 3, 1, 3, 1, 1, 5);
INSERT INTO `staging` VALUES (1272, 'Tiền Giang, Việt Nam', '2024-12-06T23:00:00', 24.20, 24.20, 23.40, 95.30, 0.00, 16.10, 'None', 0.00, 0.00, 29.20, 6.80, 112.30, 1009, 5, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 53, 'VN1249', 7280, 24, 1, 2, 5, 2, 3, 1, 3, 1, 1, 5);
INSERT INTO `staging` VALUES (1273, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T00:00:00', 25.10, 25.10, 23.80, 92.51, 0.00, 51.60, '[rain]', 0.00, 0.00, 3.20, 2.20, 236.90, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 54, 'VN1273', 7280, 1, 1, 1, 1, 6, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1274, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T01:00:00', 25.00, 25.00, 23.70, 92.50, 0.00, 51.60, '[rain]', 0.00, 0.00, 5.80, 4.00, 300.60, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 54, 'VN1273', 7280, 2, 1, 1, 1, 7, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1275, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T02:00:00', 24.90, 24.90, 23.70, 93.06, 0.00, 0.00, 'None', 0.00, 0.00, 6.10, 3.60, 287.70, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 54, 'VN1273', 7280, 3, 1, 2, 2, 7, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1276, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T03:00:00', 24.90, 24.90, 23.60, 92.50, 0.00, 0.00, 'None', 0.00, 0.00, 4.70, 2.90, 312.70, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 54, 'VN1273', 7280, 4, 1, 2, 2, 7, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1277, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T04:00:00', 24.80, 24.80, 23.60, 93.05, 0.00, 0.00, 'None', 0.00, 0.00, 4.70, 3.20, 330.20, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 54, 'VN1273', 7280, 5, 1, 2, 2, 4, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1278, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T05:00:00', 24.70, 24.70, 23.50, 93.05, 0.00, 0.00, 'None', 0.00, 0.00, 4.00, 3.20, 339.20, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 54, 'VN1273', 7280, 6, 1, 2, 2, 4, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1279, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T06:00:00', 24.60, 24.60, 23.30, 92.48, 0.00, 0.00, 'None', 0.00, 0.00, 3.20, 3.20, 345.30, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 54, 'VN1273', 7280, 7, 1, 2, 2, 4, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1280, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T07:00:00', 25.00, 25.00, 23.30, 90.30, 0.00, 0.00, 'None', 0.00, 0.00, 3.20, 2.90, 302.40, 1009, 100, 24.1, 20, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 54, 'VN1273', 7280, 8, 1, 2, 2, 7, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1281, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T08:00:00', 25.80, 25.80, 23.10, 85.07, 0.00, 41.90, 'None', 0.00, 0.00, 4.00, 2.90, 316.70, 1009, 100, 24.1, 113, 0.4, 1, 10, 'Overcast', 'cloudy', 'None', 54, 'VN1273', 7280, 9, 1, 2, 2, 4, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1282, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T09:00:00', 26.80, 29.20, 23.00, 79.71, 0.00, 41.90, 'None', 0.00, 0.00, 3.20, 2.90, 302.50, 1010, 100, 24.1, 238, 0.9, 2, 10, 'Overcast', 'cloudy', 'None', 54, 'VN1273', 7280, 10, 1, 2, 2, 7, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1283, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T10:00:00', 27.60, 30.50, 23.00, 76.05, 0.00, 41.90, 'None', 0.00, 0.00, 3.20, 3.20, 294.70, 1010, 100, 24.1, 323, 1.2, 3, 10, 'Overcast', 'cloudy', 'None', 54, 'VN1273', 7280, 11, 1, 2, 2, 7, 2, 1, 1, 3, 2, 1);
INSERT INTO `staging` VALUES (1284, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T11:00:00', 28.90, 32.60, 23.20, 71.37, 0.20, 41.90, '[rain]', 0.00, 0.00, 1.40, 3.20, 299.10, 1009, 98.1, 24.1, 487, 1.8, 5, 10, 'Overcast', 'cloudy', 'None', 54, 'VN1273', 7280, 12, 1, 1, 2, 7, 2, 1, 1, 3, 2, 1);
INSERT INTO `staging` VALUES (1285, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T12:00:00', 30.90, 35.60, 23.40, 64.38, 0.20, 41.90, '[rain]', 0.00, 0.00, 3.60, 1.10, 333.30, 1008, 97, 24.1, 734, 2.6, 7, 10, 'Overcast', 'cloudy', 'None', 54, 'VN1273', 7280, 13, 1, 1, 2, 4, 2, 1, 2, 3, 3, 1);
INSERT INTO `staging` VALUES (1286, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T13:00:00', 31.80, 36.70, 23.30, 60.80, 0.30, 41.90, '[rain]', 0.00, 0.00, 5.40, 1.80, 69.20, 1007, 66.9, 24.1, 802, 2.9, 8, 10, 'Partially cloudy', 'partly-cloudy-day', 'None', 54, 'VN1273', 7280, 14, 1, 1, 6, 3, 5, 1, 2, 3, 4, 6);
INSERT INTO `staging` VALUES (1287, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T14:00:00', 31.30, 36.20, 23.40, 62.93, 0.60, 74.20, '[rain]', 0.00, 0.00, 7.20, 4.70, 101.00, 1006, 25.1, 12.6, 719, 2.6, 7, 10, 'Rain, Partially cloudy', 'rain', 'None', 54, 'VN1273', 7280, 15, 1, 1, 3, 2, 1, 1, 2, 3, 3, 4);
INSERT INTO `staging` VALUES (1288, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T15:00:00', 30.70, 35.50, 23.50, 65.52, 0.40, 74.20, '[rain]', 0.00, 0.00, 7.60, 6.10, 114.20, 1006, 19.9, 19.2, 567, 2, 6, 30, 'Rain', 'rain', 'None', 54, 'VN1273', 7280, 16, 1, 1, 4, 2, 1, 1, 2, 1, 3, 5);
INSERT INTO `staging` VALUES (1289, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T16:00:00', 30.30, 35.10, 23.70, 67.85, 0.00, 74.20, '[rain]', 0.00, 0.00, 6.10, 5.80, 138.10, 1005, 10.7, 24.1, 382, 1.4, 4, 30, 'Rain', 'rain', 'None', 54, 'VN1273', 7280, 17, 1, 1, 4, 1, 1, 1, 2, 2, 2, 5);
INSERT INTO `staging` VALUES (1290, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T17:00:00', 28.90, 33.40, 24.10, 75.34, 0.10, 74.20, '[rain]', 0.00, 0.00, 9.70, 8.30, 157.10, 1006, 4.9, 24.1, 160, 0.6, 2, 30, 'Rain', 'rain', 'None', 54, 'VN1273', 7280, 18, 1, 1, 4, 1, 1, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (1291, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T18:00:00', 26.70, 26.70, 23.80, 84.14, 0.50, 74.20, '[rain]', 0.00, 0.00, 14.40, 7.90, 163.30, 1007, 1.3, 10.4, 0, 0, 0, 10, 'Rain', 'rain', 'None', 54, 'VN1273', 7280, 19, 1, 1, 4, 1, 1, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (1292, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T19:00:00', 25.30, 25.30, 23.30, 88.70, 1.00, 74.20, '[rain]', 0.00, 0.00, 11.20, 6.80, 168.40, 1008, 3.8, 19.3, 0, 0, 0, 10, 'Rain', 'rain', 'None', 54, 'VN1273', 7280, 20, 1, 1, 4, 1, 1, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (1293, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T20:00:00', 25.20, 25.20, 23.50, 90.31, 0.40, 41.90, '[rain]', 0.00, 0.00, 7.20, 5.40, 184.30, 1009, 5, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 54, 'VN1273', 7280, 21, 1, 1, 5, 8, 3, 1, 3, 2, 1, 5);
INSERT INTO `staging` VALUES (1294, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T21:00:00', 25.20, 25.20, 23.50, 90.31, 0.10, 41.90, '[rain]', 0.00, 0.00, 5.00, 4.00, 182.20, 1009, 94.8, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 54, 'VN1273', 7280, 22, 1, 1, 2, 8, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1295, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T22:00:00', 25.10, 25.10, 23.40, 90.31, 0.50, 41.90, '[rain]', 0.00, 0.00, 2.20, 1.80, 190.00, 1009, 97.9, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 54, 'VN1273', 7280, 23, 1, 1, 2, 8, 2, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1296, 'Thủ Đức, Hồ Chí Minh, Việt Nam', '2024-12-06T23:00:00', 25.10, 25.10, 23.50, 90.85, 0.00, 41.90, 'None', 0.00, 0.00, 1.80, 1.40, 69.70, 1009, 52.2, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 54, 'VN1273', 7280, 24, 1, 2, 6, 3, 4, 1, 3, 3, 1, 3);
INSERT INTO `staging` VALUES (1297, 'Trà Vinh, Việt Nam', '2024-12-06T00:00:00', 25.00, 25.00, 22.50, 86.03, 0.00, 9.70, 'None', 0.00, 0.00, 30.60, 9.70, 91.50, 1008, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 55, 'VN1297', 7280, 1, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1298, 'Trà Vinh, Việt Nam', '2024-12-06T01:00:00', 25.00, 25.00, 22.60, 86.55, 0.00, 9.70, 'None', 0.00, 0.00, 26.60, 8.60, 94.20, 1008, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 55, 'VN1297', 7280, 2, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1299, 'Trà Vinh, Việt Nam', '2024-12-06T02:00:00', 25.00, 25.00, 22.60, 86.55, 0.00, 0.00, 'None', 0.00, 0.00, 29.20, 10.10, 95.40, 1007, 100, 24.1, 0, 0, 0, 3, 'Overcast', 'cloudy', 'None', 55, 'VN1297', 7280, 3, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1300, 'Trà Vinh, Việt Nam', '2024-12-06T03:00:00', 25.10, 25.10, 22.70, 86.56, 0.00, 0.00, 'None', 0.00, 0.00, 30.20, 10.80, 91.40, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 55, 'VN1297', 7280, 4, 1, 2, 2, 2, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1301, 'Trà Vinh, Việt Nam', '2024-12-06T04:00:00', 25.00, 25.00, 22.80, 87.61, 0.00, 0.00, 'None', 0.00, 0.00, 29.50, 10.40, 84.50, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 55, 'VN1297', 7280, 5, 1, 2, 2, 3, 2, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1302, 'Trà Vinh, Việt Nam', '2024-12-06T05:00:00', 24.60, 24.60, 22.90, 90.27, 0.00, 0.00, 'None', 0.00, 0.00, 27.70, 9.70, 81.90, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 55, 'VN1297', 7280, 6, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1303, 'Trà Vinh, Việt Nam', '2024-12-06T06:00:00', 24.20, 24.20, 23.00, 93.02, 0.00, 0.00, 'None', 0.00, 0.00, 24.50, 8.30, 79.80, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 55, 'VN1297', 7280, 7, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1304, 'Trà Vinh, Việt Nam', '2024-12-06T07:00:00', 25.10, 25.10, 23.60, 91.40, 0.00, 0.00, 'None', 0.00, 0.00, 23.40, 7.60, 68.90, 1008, 100, 24.1, 47, 0.2, 0, 10, 'Overcast', 'cloudy', 'None', 55, 'VN1297', 7280, 8, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1305, 'Trà Vinh, Việt Nam', '2024-12-06T08:00:00', 26.70, 26.70, 23.70, 83.64, 0.00, 67.70, '[rain]', 0.00, 0.00, 19.10, 10.80, 63.20, 1009, 100, 24.1, 209, 0.8, 2, 10, 'Rain, Overcast', 'rain', 'None', 55, 'VN1297', 7280, 9, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1306, 'Trà Vinh, Việt Nam', '2024-12-06T09:00:00', 28.30, 32.10, 23.70, 76.16, 0.10, 67.70, '[rain]', 0.00, 0.00, 15.80, 10.10, 61.90, 1010, 96.5, 23.3, 424, 1.5, 4, 10, 'Rain, Overcast', 'rain', 'None', 55, 'VN1297', 7280, 10, 1, 1, 1, 3, 1, 1, 1, 1, 2, 1);
INSERT INTO `staging` VALUES (1307, 'Trà Vinh, Việt Nam', '2024-12-06T10:00:00', 29.40, 33.90, 23.80, 71.89, 0.70, 67.70, '[rain]', 0.00, 0.00, 21.20, 11.20, 60.60, 1009, 99.9, 10.4, 659, 2.4, 7, 10, 'Rain, Overcast', 'rain', 'None', 55, 'VN1297', 7280, 11, 1, 1, 1, 3, 1, 1, 1, 2, 3, 1);
INSERT INTO `staging` VALUES (1308, 'Trà Vinh, Việt Nam', '2024-12-06T11:00:00', 30.70, 35.30, 23.30, 64.73, 0.40, 67.70, '[rain]', 0.00, 0.00, 24.80, 13.70, 61.70, 1009, 90.5, 24.1, 789, 2.8, 8, 10, 'Rain, Overcast', 'rain', 'None', 55, 'VN1297', 7280, 12, 1, 1, 1, 3, 1, 1, 2, 5, 4, 1);
INSERT INTO `staging` VALUES (1309, 'Trà Vinh, Việt Nam', '2024-12-06T12:00:00', 31.40, 35.60, 22.70, 59.98, 0.40, 67.70, '[rain]', 0.00, 0.00, 24.80, 15.10, 73.40, 1008, 79.1, 24.1, 725, 2.6, 7, 10, 'Rain, Partially cloudy', 'rain', 'None', 55, 'VN1297', 7280, 13, 1, 1, 3, 3, 1, 1, 2, 5, 3, 6);
INSERT INTO `staging` VALUES (1310, 'Trà Vinh, Việt Nam', '2024-12-06T13:00:00', 31.30, 35.30, 22.50, 59.59, 0.10, 67.70, '[rain]', 0.00, 0.00, 25.90, 18.00, 87.30, 1007, 75.7, 24.1, 679, 2.4, 7, 10, 'Rain, Partially cloudy', 'rain', 'None', 55, 'VN1297', 7280, 14, 1, 1, 3, 3, 1, 1, 2, 5, 3, 6);
INSERT INTO `staging` VALUES (1311, 'Trà Vinh, Việt Nam', '2024-12-06T14:00:00', 30.90, 34.80, 22.50, 60.97, 0.00, 71.00, '[rain]', 0.00, 0.00, 26.60, 18.40, 91.50, 1006, 46.5, 24.1, 596, 2.1, 6, 10, 'Rain, Partially cloudy', 'rain', 'None', 55, 'VN1297', 7280, 15, 1, 1, 3, 2, 1, 1, 2, 5, 3, 3);
INSERT INTO `staging` VALUES (1312, 'Trà Vinh, Việt Nam', '2024-12-06T15:00:00', 30.40, 34.20, 22.60, 63.12, 0.20, 71.00, '[rain]', 0.00, 0.00, 27.40, 17.60, 90.80, 1005, 5, 24.1, 543, 2, 5, 10, 'Rain', 'rain', 'None', 55, 'VN1297', 7280, 16, 1, 1, 4, 2, 1, 1, 2, 5, 2, 5);
INSERT INTO `staging` VALUES (1313, 'Trà Vinh, Việt Nam', '2024-12-06T16:00:00', 29.50, 33.30, 23.00, 68.10, 0.10, 71.00, '[rain]', 0.00, 0.00, 26.60, 15.10, 92.80, 1006, 5, 24.1, 399, 1.4, 4, 10, 'Rain', 'rain', 'None', 55, 'VN1297', 7280, 17, 1, 1, 4, 2, 1, 1, 2, 5, 2, 5);
INSERT INTO `staging` VALUES (1314, 'Trà Vinh, Việt Nam', '2024-12-06T17:00:00', 27.50, 30.40, 23.10, 76.96, 0.00, 71.00, '[rain]', 0.00, 0.00, 25.90, 13.00, 92.10, 1006, 5, 24.1, 174, 0.6, 2, 10, 'Rain', 'rain', 'None', 55, 'VN1297', 7280, 18, 1, 1, 4, 2, 1, 1, 1, 5, 1, 5);
INSERT INTO `staging` VALUES (1315, 'Trà Vinh, Việt Nam', '2024-12-06T18:00:00', 25.90, 25.90, 23.00, 84.06, 0.00, 71.00, '[rain]', 0.00, 0.00, 27.00, 10.10, 93.10, 1007, 5.3, 24.1, 0, 0, 0, 10, 'Rain', 'rain', 'None', 55, 'VN1297', 7280, 19, 1, 1, 4, 2, 1, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (1316, 'Trà Vinh, Việt Nam', '2024-12-06T19:00:00', 25.40, 25.40, 23.20, 87.64, 0.00, 71.00, '[rain]', 0.00, 0.00, 33.10, 9.00, 93.60, 1008, 10.6, 24.1, 0, 0, 0, 10, 'Rain', 'rain', 'None', 55, 'VN1297', 7280, 20, 1, 1, 4, 2, 1, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (1317, 'Trà Vinh, Việt Nam', '2024-12-06T20:00:00', 25.60, 25.60, 23.10, 86.08, 0.00, 12.90, 'None', 0.00, 0.00, 39.60, 11.50, 98.80, 1009, 98.9, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 55, 'VN1297', 7280, 21, 1, 2, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1318, 'Trà Vinh, Việt Nam', '2024-12-06T21:00:00', 25.90, 25.90, 23.10, 84.57, 0.00, 12.90, 'None', 0.00, 0.00, 42.50, 13.70, 95.80, 1009, 97.4, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 55, 'VN1297', 7280, 22, 1, 2, 2, 2, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1319, 'Trà Vinh, Việt Nam', '2024-12-06T22:00:00', 25.80, 25.80, 23.10, 85.07, 0.00, 12.90, 'None', 0.00, 0.00, 42.10, 14.00, 99.10, 1009, 31.5, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 55, 'VN1297', 7280, 23, 1, 2, 6, 2, 4, 1, 1, 5, 1, 4);
INSERT INTO `staging` VALUES (1320, 'Trà Vinh, Việt Nam', '2024-12-06T23:00:00', 25.60, 25.60, 23.20, 86.61, 0.00, 12.90, 'None', 0.00, 0.00, 42.10, 13.70, 98.20, 1009, 5, 24.1, 0, 0, 0, 10, 'Clear', 'clear-night', 'None', 55, 'VN1297', 7280, 24, 1, 2, 5, 2, 3, 1, 1, 5, 1, 5);
INSERT INTO `staging` VALUES (1321, 'Tuyên Quang, Việt Nam', '2024-12-06T00:00:00', 21.90, 21.90, 16.90, 73.26, 0.00, 29.00, 'None', 0.00, 0.00, 7.90, 4.70, 91.30, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 56, 'VN1321', 7280, 1, 1, 2, 2, 2, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1322, 'Tuyên Quang, Việt Nam', '2024-12-06T01:00:00', 21.60, 21.60, 17.00, 75.09, 0.10, 29.00, '[rain]', 0.00, 0.00, 5.40, 4.70, 78.90, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 56, 'VN1321', 7280, 2, 1, 1, 2, 3, 2, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1323, 'Tuyên Quang, Việt Nam', '2024-12-06T02:00:00', 21.30, 21.30, 17.10, 76.97, 0.00, 93.50, '[rain]', 0.00, 0.00, 4.70, 4.00, 64.80, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 3, 1, 1, 1, 3, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1324, 'Tuyên Quang, Việt Nam', '2024-12-06T03:00:00', 21.00, 21.00, 17.20, 78.90, 0.00, 93.50, '[rain]', 0.00, 0.00, 6.10, 4.30, 68.50, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 4, 1, 1, 1, 3, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1325, 'Tuyên Quang, Việt Nam', '2024-12-06T04:00:00', 20.80, 20.80, 17.30, 80.38, 0.00, 93.50, '[rain]', 0.00, 0.00, 6.10, 4.00, 60.90, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 5, 1, 1, 1, 3, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1326, 'Tuyên Quang, Việt Nam', '2024-12-06T05:00:00', 20.60, 20.60, 17.30, 81.38, 0.00, 93.50, '[rain]', 0.00, 0.00, 4.00, 3.60, 67.10, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 6, 1, 1, 1, 3, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1327, 'Tuyên Quang, Việt Nam', '2024-12-06T06:00:00', 20.60, 20.60, 17.30, 81.38, 0.10, 93.50, '[rain]', 0.00, 0.00, 4.70, 3.60, 101.00, 1014, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 7, 1, 1, 1, 2, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1328, 'Tuyên Quang, Việt Nam', '2024-12-06T07:00:00', 20.60, 20.60, 17.30, 81.38, 0.00, 93.50, '[rain]', 0.00, 0.00, 3.20, 2.50, 96.00, 1014, 100, 24.1, 1, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 8, 1, 1, 1, 2, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1329, 'Tuyên Quang, Việt Nam', '2024-12-06T08:00:00', 20.60, 20.60, 17.60, 82.94, 0.10, 90.30, '[rain]', 0.00, 0.00, 2.50, 1.80, 42.60, 1015, 100, 23.6, 8, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 9, 1, 1, 1, 5, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1330, 'Tuyên Quang, Việt Nam', '2024-12-06T09:00:00', 20.30, 20.30, 17.80, 85.56, 0.10, 90.30, '[rain]', 0.00, 0.00, 2.20, 1.40, 20.70, 1016, 100, 24.1, 8, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 10, 1, 1, 1, 5, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1331, 'Tuyên Quang, Việt Nam', '2024-12-06T10:00:00', 20.30, 20.30, 18.00, 86.64, 0.10, 90.30, '[rain]', 0.00, 0.00, 2.90, 0.70, 239.50, 1016, 100, 24.1, 18, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 11, 1, 1, 1, 6, 1, 1, 1, 4, 1, 1);
INSERT INTO `staging` VALUES (1332, 'Tuyên Quang, Việt Nam', '2024-12-06T11:00:00', 20.40, 20.40, 17.90, 85.57, 0.20, 90.30, '[rain]', 0.00, 0.00, 2.50, 0.70, 203.50, 1015, 100, 24.1, 37, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 12, 1, 1, 1, 8, 1, 1, 1, 4, 1, 1);
INSERT INTO `staging` VALUES (1333, 'Tuyên Quang, Việt Nam', '2024-12-06T12:00:00', 20.80, 20.80, 17.90, 83.48, 0.10, 90.30, '[rain]', 0.00, 0.00, 5.40, 1.80, 179.30, 1014, 100, 24.1, 98, 0.4, 1, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 13, 1, 1, 1, 1, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1334, 'Tuyên Quang, Việt Nam', '2024-12-06T13:00:00', 20.50, 20.50, 17.90, 85.04, 0.30, 90.30, '[rain]', 0.00, 0.00, 3.60, 1.40, 344.00, 1013, 100, 24.1, 46, 0.2, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 14, 1, 1, 1, 4, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1335, 'Tuyên Quang, Việt Nam', '2024-12-06T14:00:00', 19.90, 19.90, 18.30, 90.50, 0.40, 80.60, '[rain]', 0.00, 0.00, 4.00, 1.80, 15.90, 1012, 100, 17, 17, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 15, 1, 1, 1, 5, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1336, 'Tuyên Quang, Việt Nam', '2024-12-06T15:00:00', 19.60, 19.60, 18.40, 92.78, 0.40, 80.60, '[rain]', 0.00, 0.00, 6.10, 2.50, 16.00, 1012, 100, 23.1, 11, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 16, 1, 1, 1, 5, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1337, 'Tuyên Quang, Việt Nam', '2024-12-06T16:00:00', 19.50, 19.50, 18.50, 93.95, 0.50, 80.60, '[rain]', 0.00, 0.00, 5.40, 2.50, 354.70, 1012, 100, 14.5, 8, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 17, 1, 1, 1, 4, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1338, 'Tuyên Quang, Việt Nam', '2024-12-06T17:00:00', 19.40, 19.40, 18.40, 93.95, 0.40, 80.60, '[rain]', 0.00, 0.00, 8.60, 3.60, 47.00, 1013, 100, 24.1, 2, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 18, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1339, 'Tuyên Quang, Việt Nam', '2024-12-06T18:00:00', 19.30, 19.30, 18.20, 93.35, 0.10, 80.60, '[rain]', 0.00, 0.00, 10.10, 4.70, 31.10, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 19, 1, 1, 1, 5, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1340, 'Tuyên Quang, Việt Nam', '2024-12-06T19:00:00', 19.10, 19.10, 18.00, 93.34, 0.20, 80.60, '[rain]', 0.00, 0.00, 11.20, 4.30, 39.10, 1014, 100, 13.7, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 20, 1, 1, 1, 5, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1341, 'Tuyên Quang, Việt Nam', '2024-12-06T20:00:00', 18.80, 18.80, 17.70, 93.33, 0.60, 93.50, '[rain]', 0.00, 0.00, 15.10, 4.30, 45.30, 1014, 100, 23.9, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 21, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1342, 'Tuyên Quang, Việt Nam', '2024-12-06T21:00:00', 18.60, 18.60, 17.40, 92.73, 0.20, 93.50, '[rain]', 0.00, 0.00, 10.40, 4.70, 36.60, 1015, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 22, 1, 1, 1, 5, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1343, 'Tuyên Quang, Việt Nam', '2024-12-06T22:00:00', 18.40, 18.40, 17.20, 92.72, 0.20, 93.50, '[rain]', 0.00, 0.00, 7.20, 3.20, 41.50, 1015, 100, 24, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 23, 1, 1, 1, 5, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1344, 'Tuyên Quang, Việt Nam', '2024-12-06T23:00:00', 18.20, 18.20, 17.10, 93.30, 0.30, 93.50, '[rain]', 0.00, 0.00, 9.70, 3.60, 41.30, 1016, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 56, 'VN1321', 7280, 24, 1, 1, 1, 5, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1345, 'Vĩnh Long, Việt Nam', '2024-12-06T00:00:00', 24.90, 24.90, 23.50, 91.94, 0.00, 67.70, '[rain]', 0.00, 0.00, 23.00, 7.20, 130.00, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 57, 'VN1345', 7280, 1, 1, 1, 1, 2, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1346, 'Vĩnh Long, Việt Nam', '2024-12-06T01:00:00', 24.70, 24.70, 23.30, 91.93, 0.00, 67.70, '[rain]', 0.00, 0.00, 20.50, 6.50, 130.70, 1008, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 57, 'VN1345', 7280, 2, 1, 1, 1, 2, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1347, 'Vĩnh Long, Việt Nam', '2024-12-06T02:00:00', 24.70, 24.70, 23.20, 91.38, 0.00, 9.70, 'None', 0.00, 0.00, 17.30, 6.10, 122.90, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 57, 'VN1345', 7280, 3, 1, 2, 2, 2, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1348, 'Vĩnh Long, Việt Nam', '2024-12-06T03:00:00', 24.60, 24.60, 23.20, 91.93, 0.00, 9.70, 'None', 0.00, 0.00, 15.80, 5.80, 102.10, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 57, 'VN1345', 7280, 4, 1, 2, 2, 2, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1349, 'Vĩnh Long, Việt Nam', '2024-12-06T04:00:00', 24.40, 24.40, 23.20, 93.03, 0.00, 9.70, 'None', 0.00, 0.00, 9.70, 5.80, 89.50, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 57, 'VN1345', 7280, 5, 1, 2, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1350, 'Vĩnh Long, Việt Nam', '2024-12-06T05:00:00', 24.20, 24.20, 23.20, 94.16, 0.00, 9.70, 'None', 0.00, 0.00, 11.50, 6.50, 87.70, 1007, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 57, 'VN1345', 7280, 6, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1351, 'Vĩnh Long, Việt Nam', '2024-12-06T06:00:00', 24.10, 24.10, 23.30, 95.30, 0.00, 9.70, 'None', 0.00, 0.00, 10.10, 6.10, 86.20, 1008, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 57, 'VN1345', 7280, 7, 1, 2, 2, 3, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1352, 'Vĩnh Long, Việt Nam', '2024-12-06T07:00:00', 24.70, 24.70, 23.60, 93.61, 0.00, 9.70, 'None', 0.00, 0.00, 10.10, 5.40, 60.20, 1008, 100, 24.1, 32, 0.1, 0, 10, 'Overcast', 'cloudy', 'None', 57, 'VN1345', 7280, 8, 1, 2, 2, 3, 2, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1353, 'Vĩnh Long, Việt Nam', '2024-12-06T08:00:00', 25.70, 25.70, 23.80, 89.27, 0.00, 67.70, '[rain]', 0.00, 0.00, 8.60, 6.10, 47.60, 1009, 100, 24.1, 131, 0.5, 1, 10, 'Rain, Overcast', 'rain', 'None', 57, 'VN1345', 7280, 9, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1354, 'Vĩnh Long, Việt Nam', '2024-12-06T09:00:00', 26.70, 26.70, 23.90, 84.65, 0.00, 67.70, '[rain]', 0.00, 0.00, 7.90, 5.80, 25.70, 1010, 100, 24.1, 261, 0.9, 3, 10, 'Rain, Overcast', 'rain', 'None', 57, 'VN1345', 7280, 10, 1, 1, 1, 5, 1, 1, 1, 2, 2, 1);
INSERT INTO `staging` VALUES (1355, 'Vĩnh Long, Việt Nam', '2024-12-06T10:00:00', 27.80, 31.50, 24.00, 79.84, 0.60, 67.70, '[rain]', 0.00, 0.00, 6.50, 5.80, 28.70, 1010, 100, 24.1, 432, 1.6, 4, 10, 'Rain, Overcast', 'rain', 'None', 57, 'VN1345', 7280, 11, 1, 1, 1, 5, 1, 1, 1, 2, 2, 1);
INSERT INTO `staging` VALUES (1356, 'Vĩnh Long, Việt Nam', '2024-12-06T11:00:00', 29.00, 33.50, 24.00, 74.46, 1.00, 67.70, '[rain]', 0.00, 0.00, 7.90, 6.10, 42.00, 1009, 100, 24, 595, 2.1, 6, 30, 'Rain, Overcast', 'rain', 'None', 57, 'VN1345', 7280, 12, 1, 1, 1, 5, 1, 1, 1, 1, 3, 1);
INSERT INTO `staging` VALUES (1357, 'Vĩnh Long, Việt Nam', '2024-12-06T12:00:00', 30.20, 35.10, 23.80, 68.65, 1.00, 67.70, '[rain]', 0.00, 0.00, 12.20, 7.60, 64.80, 1008, 100, 15.9, 801, 2.9, 8, 30, 'Rain, Overcast', 'rain', 'None', 57, 'VN1345', 7280, 13, 1, 1, 1, 3, 1, 1, 2, 1, 4, 1);
INSERT INTO `staging` VALUES (1358, 'Vĩnh Long, Việt Nam', '2024-12-06T13:00:00', 30.50, 35.60, 23.90, 67.89, 0.70, 67.70, '[rain]', 0.00, 0.00, 14.40, 9.40, 63.20, 1007, 88.6, 7.1, 819, 2.9, 8, 30, 'Rain, Partially cloudy', 'rain', 'None', 57, 'VN1345', 7280, 14, 1, 1, 3, 3, 1, 1, 2, 1, 4, 1);
INSERT INTO `staging` VALUES (1359, 'Vĩnh Long, Việt Nam', '2024-12-06T14:00:00', 30.00, 35.20, 24.20, 71.13, 1.20, 80.60, '[rain]', 0.00, 0.00, 14.00, 10.10, 67.10, 1006, 74.6, 7.7, 710, 2.6, 7, 30, 'Rain, Partially cloudy', 'rain', 'None', 57, 'VN1345', 7280, 15, 1, 1, 3, 3, 1, 1, 1, 1, 3, 6);
INSERT INTO `staging` VALUES (1360, 'Vĩnh Long, Việt Nam', '2024-12-06T15:00:00', 29.80, 34.90, 24.20, 71.96, 0.60, 80.60, '[rain]', 0.00, 0.00, 14.80, 10.10, 70.00, 1006, 10.1, 24.1, 566, 2, 6, 30, 'Rain', 'rain', 'None', 57, 'VN1345', 7280, 16, 1, 1, 4, 3, 1, 1, 1, 1, 3, 5);
INSERT INTO `staging` VALUES (1361, 'Vĩnh Long, Việt Nam', '2024-12-06T16:00:00', 28.90, 33.80, 24.50, 77.17, 0.60, 80.60, '[rain]', 0.00, 0.00, 13.70, 9.00, 73.50, 1006, 4.6, 7.6, 397, 1.4, 4, 30, 'Rain', 'rain', 'None', 57, 'VN1345', 7280, 17, 1, 1, 4, 3, 1, 1, 1, 1, 2, 5);
INSERT INTO `staging` VALUES (1362, 'Vĩnh Long, Việt Nam', '2024-12-06T17:00:00', 27.20, 30.70, 24.60, 85.72, 0.80, 80.60, '[rain]', 0.00, 0.00, 12.60, 7.20, 79.90, 1006, 5, 10.1, 175, 0.6, 2, 30, 'Rain', 'rain', 'None', 57, 'VN1345', 7280, 18, 1, 1, 4, 3, 1, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (1363, 'Vĩnh Long, Việt Nam', '2024-12-06T18:00:00', 25.80, 25.80, 23.90, 89.27, 0.20, 80.60, '[rain]', 0.00, 0.00, 9.40, 7.60, 98.70, 1007, 5, 24.1, 0, 0, 0, 10, 'Rain', 'rain', 'None', 57, 'VN1345', 7280, 19, 1, 1, 4, 2, 1, 1, 1, 1, 1, 5);
INSERT INTO `staging` VALUES (1364, 'Vĩnh Long, Việt Nam', '2024-12-06T19:00:00', 25.20, 25.20, 23.60, 90.86, 0.10, 80.60, '[rain]', 0.00, 0.00, 16.90, 9.00, 120.80, 1008, 5, 24.1, 0, 0, 0, 10, 'Rain', 'rain', 'None', 57, 'VN1345', 7280, 20, 1, 1, 4, 2, 1, 1, 3, 1, 1, 5);
INSERT INTO `staging` VALUES (1365, 'Vĩnh Long, Việt Nam', '2024-12-06T20:00:00', 24.60, 24.60, 23.30, 92.48, 0.00, 19.40, 'None', 0.00, 0.00, 19.80, 8.30, 121.50, 1009, 17.3, 24.1, 0, 0, 0, 3, 'Clear', 'clear-night', 'None', 57, 'VN1345', 7280, 21, 1, 2, 5, 2, 3, 1, 3, 1, 1, 5);
INSERT INTO `staging` VALUES (1366, 'Vĩnh Long, Việt Nam', '2024-12-06T21:00:00', 24.40, 24.40, 23.30, 93.60, 0.00, 19.40, 'None', 0.00, 0.00, 25.90, 8.30, 109.00, 1009, 52.5, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 57, 'VN1345', 7280, 22, 1, 2, 6, 2, 4, 1, 3, 1, 1, 3);
INSERT INTO `staging` VALUES (1367, 'Vĩnh Long, Việt Nam', '2024-12-06T22:00:00', 24.30, 24.30, 23.40, 94.73, 0.00, 19.40, 'None', 0.00, 0.00, 24.80, 7.20, 103.70, 1009, 94, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 57, 'VN1345', 7280, 23, 1, 2, 2, 2, 2, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1368, 'Vĩnh Long, Việt Nam', '2024-12-06T23:00:00', 24.20, 24.20, 23.30, 94.73, 0.00, 19.40, 'None', 0.00, 0.00, 27.40, 7.60, 108.80, 1009, 41.9, 24.1, 0, 0, 0, 10, 'Partially cloudy', 'partly-cloudy-night', 'None', 57, 'VN1345', 7280, 24, 1, 2, 6, 2, 4, 1, 3, 1, 1, 3);
INSERT INTO `staging` VALUES (1369, 'Vĩnh Phúc, Việt Nam', '2024-12-06T00:00:00', 22.40, 22.40, 18.60, 79.10, 0.00, 0.00, 'None', 0.00, 0.00, 27.40, 14.80, 114.30, 1014, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 58, 'VN1369', 7280, 1, 1, 2, 2, 2, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1370, 'Vĩnh Phúc, Việt Nam', '2024-12-06T01:00:00', 22.20, 22.20, 18.70, 80.57, 0.10, 0.00, '[rain]', 0.00, 0.00, 27.70, 14.80, 109.90, 1014, 98.5, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 58, 'VN1369', 7280, 2, 1, 1, 2, 2, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1371, 'Vĩnh Phúc, Việt Nam', '2024-12-06T02:00:00', 21.90, 21.90, 18.60, 81.55, 0.00, 71.00, '[rain]', 0.00, 0.00, 26.60, 14.80, 98.50, 1013, 99, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 3, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1372, 'Vĩnh Phúc, Việt Nam', '2024-12-06T03:00:00', 21.60, 21.60, 18.60, 83.06, 0.10, 71.00, '[rain]', 0.00, 0.00, 27.70, 14.00, 95.00, 1013, 100, 24, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 4, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1373, 'Vĩnh Phúc, Việt Nam', '2024-12-06T04:00:00', 21.50, 21.50, 18.40, 82.52, 0.20, 71.00, '[rain]', 0.00, 0.00, 27.70, 14.00, 93.30, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 5, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1374, 'Vĩnh Phúc, Việt Nam', '2024-12-06T05:00:00', 21.20, 21.20, 18.10, 82.49, 0.30, 71.00, '[rain]', 0.00, 0.00, 26.60, 12.20, 98.30, 1013, 100, 11.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 6, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1375, 'Vĩnh Phúc, Việt Nam', '2024-12-06T06:00:00', 20.60, 20.60, 18.00, 85.05, 0.60, 71.00, '[rain]', 0.00, 0.00, 30.20, 14.00, 103.30, 1014, 100, 21.4, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 7, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1376, 'Vĩnh Phúc, Việt Nam', '2024-12-06T07:00:00', 20.60, 20.60, 17.70, 83.46, 0.10, 71.00, '[rain]', 0.00, 0.00, 31.30, 11.50, 105.80, 1014, 100, 24.1, 1, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 8, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1377, 'Vĩnh Phúc, Việt Nam', '2024-12-06T08:00:00', 20.70, 20.70, 17.70, 82.95, 0.40, 45.20, '[rain]', 0.00, 0.00, 29.20, 11.50, 107.70, 1015, 100, 21.8, 13, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 9, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1378, 'Vĩnh Phúc, Việt Nam', '2024-12-06T09:00:00', 20.90, 20.90, 17.60, 81.42, 0.10, 45.20, '[rain]', 0.00, 0.00, 32.00, 12.20, 117.10, 1016, 90.3, 24.1, 31, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 10, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1379, 'Vĩnh Phúc, Việt Nam', '2024-12-06T10:00:00', 22.40, 22.40, 17.70, 74.75, 0.00, 45.20, '[rain]', 0.00, 0.00, 30.60, 15.50, 112.30, 1016, 100, 24.1, 153, 0.6, 2, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 11, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1380, 'Vĩnh Phúc, Việt Nam', '2024-12-06T11:00:00', 22.00, 22.00, 17.60, 76.11, 0.10, 45.20, '[rain]', 0.00, 0.00, 29.90, 14.80, 107.20, 1015, 100, 24.1, 90, 0.3, 1, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 12, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1381, 'Vĩnh Phúc, Việt Nam', '2024-12-06T12:00:00', 21.60, 21.60, 17.70, 78.49, 0.10, 45.20, '[rain]', 0.00, 0.00, 27.00, 12.20, 102.20, 1014, 100, 24.1, 31, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 13, 1, 1, 1, 2, 1, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1382, 'Vĩnh Phúc, Việt Nam', '2024-12-06T13:00:00', 21.80, 21.80, 17.80, 78.03, 0.10, 45.20, '[rain]', 0.00, 0.00, 27.00, 11.90, 99.90, 1012, 100, 24.1, 28, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 14, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1383, 'Vĩnh Phúc, Việt Nam', '2024-12-06T14:00:00', 22.10, 22.10, 17.90, 77.09, 0.00, 71.00, '[rain]', 0.00, 0.00, 25.60, 11.20, 93.20, 1012, 100, 24.1, 45, 0.2, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 15, 1, 1, 1, 2, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1384, 'Vĩnh Phúc, Việt Nam', '2024-12-06T15:00:00', 21.80, 21.80, 18.20, 80.01, 0.10, 71.00, '[rain]', 0.00, 0.00, 22.70, 9.70, 92.10, 1011, 100, 24.1, 22, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 16, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1385, 'Vĩnh Phúc, Việt Nam', '2024-12-06T16:00:00', 21.80, 21.80, 18.40, 81.02, 0.10, 71.00, '[rain]', 0.00, 0.00, 23.40, 10.10, 66.30, 1012, 100, 24.1, 12, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 17, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1386, 'Vĩnh Phúc, Việt Nam', '2024-12-06T17:00:00', 21.60, 21.60, 18.30, 81.51, 0.00, 71.00, '[rain]', 0.00, 0.00, 20.50, 9.40, 37.50, 1012, 100, 23.9, 5, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 18, 1, 1, 1, 5, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1387, 'Vĩnh Phúc, Việt Nam', '2024-12-06T18:00:00', 20.80, 20.80, 18.60, 87.23, 0.50, 71.00, '[rain]', 0.00, 0.00, 14.40, 6.10, 28.90, 1013, 100, 14.6, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 19, 1, 1, 1, 5, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1388, 'Vĩnh Phúc, Việt Nam', '2024-12-06T19:00:00', 20.40, 20.40, 18.60, 89.41, 0.70, 71.00, '[rain]', 0.00, 0.00, 20.20, 7.60, 53.90, 1014, 100, 13.7, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 20, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1389, 'Vĩnh Phúc, Việt Nam', '2024-12-06T20:00:00', 20.30, 20.30, 18.30, 88.29, 0.50, 74.20, '[rain]', 0.00, 0.00, 24.80, 9.70, 63.20, 1014, 100, 22, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 21, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1390, 'Vĩnh Phúc, Việt Nam', '2024-12-06T21:00:00', 20.10, 20.10, 18.20, 88.83, 0.40, 74.20, '[rain]', 0.00, 0.00, 27.40, 11.50, 60.40, 1014, 100, 23.7, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 22, 1, 1, 1, 3, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1391, 'Vĩnh Phúc, Việt Nam', '2024-12-06T22:00:00', 20.10, 20.10, 18.20, 88.83, 0.80, 74.20, '[rain]', 0.00, 0.00, 24.50, 10.10, 52.60, 1015, 100, 12.2, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 23, 1, 1, 1, 3, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1392, 'Vĩnh Phúc, Việt Nam', '2024-12-06T23:00:00', 20.10, 20.10, 18.00, 87.72, 0.50, 74.20, '[rain]', 0.00, 0.00, 26.30, 11.50, 59.60, 1015, 100, 22.4, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 58, 'VN1369', 7280, 24, 1, 1, 1, 3, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1393, 'Yên Bái, Việt Nam', '2024-12-06T00:00:00', 22.60, 22.60, 17.90, 74.78, 0.10, 6.50, '[rain]', 0.00, 0.00, 27.00, 12.60, 135.00, 1014, 100, 22.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 59, 'VN1393', 7280, 1, 1, 1, 2, 1, 2, 1, 1, 5, 1, 1);
INSERT INTO `staging` VALUES (1394, 'Yên Bái, Việt Nam', '2024-12-06T01:00:00', 22.00, 22.00, 18.00, 78.06, 0.20, 6.50, '[rain]', 0.00, 0.00, 25.20, 11.20, 121.70, 1013, 100, 24.1, 0, 0, 0, 10, 'Overcast', 'cloudy', 'None', 59, 'VN1393', 7280, 2, 1, 1, 2, 2, 2, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1395, 'Yên Bái, Việt Nam', '2024-12-06T02:00:00', 21.80, 21.80, 17.80, 78.03, 0.30, 100.00, '[rain]', 0.00, 0.00, 19.40, 6.80, 98.60, 1013, 100, 15.4, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 3, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1);
INSERT INTO `staging` VALUES (1396, 'Yên Bái, Việt Nam', '2024-12-06T03:00:00', 21.40, 21.40, 17.70, 79.46, 0.30, 100.00, '[rain]', 0.00, 0.00, 14.00, 5.00, 75.80, 1013, 100, 19.3, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 4, 1, 1, 1, 3, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1397, 'Yên Bái, Việt Nam', '2024-12-06T04:00:00', 20.90, 20.90, 17.90, 82.97, 0.40, 100.00, '[rain]', 0.00, 0.00, 7.20, 5.00, 27.90, 1013, 100, 19.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 5, 1, 1, 1, 5, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1398, 'Yên Bái, Việt Nam', '2024-12-06T05:00:00', 20.50, 20.50, 18.10, 86.12, 0.20, 100.00, '[rain]', 0.00, 0.00, 6.10, 5.40, 25.30, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 6, 1, 1, 1, 5, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1399, 'Yên Bái, Việt Nam', '2024-12-06T06:00:00', 20.50, 20.50, 18.00, 85.58, 0.10, 100.00, '[rain]', 0.00, 0.00, 4.70, 2.90, 65.20, 1013, 100, 24.1, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 7, 1, 1, 1, 3, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1400, 'Yên Bái, Việt Nam', '2024-12-06T07:00:00', 20.60, 20.60, 18.10, 85.59, 0.10, 100.00, '[rain]', 0.00, 0.00, 2.50, 0.00, 346.00, 1014, 100, 18.7, 1, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 8, 1, 1, 1, 4, 1, 1, 1, 4, 1, 1);
INSERT INTO `staging` VALUES (1401, 'Yên Bái, Việt Nam', '2024-12-06T08:00:00', 20.30, 20.30, 18.40, 88.85, 0.50, 96.80, '[rain]', 0.00, 0.00, 7.90, 1.40, 128.70, 1015, 100, 14.8, 4, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 9, 1, 1, 1, 2, 1, 1, 1, 3, 1, 1);
INSERT INTO `staging` VALUES (1402, 'Yên Bái, Việt Nam', '2024-12-06T09:00:00', 20.20, 20.20, 18.60, 90.52, 0.40, 96.80, '[rain]', 0.00, 0.00, 12.60, 4.70, 139.50, 1016, 100, 15.6, 11, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 10, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1403, 'Yên Bái, Việt Nam', '2024-12-06T10:00:00', 20.20, 20.20, 18.60, 90.52, 0.50, 96.80, '[rain]', 0.00, 0.00, 11.90, 5.00, 153.60, 1016, 100, 18.3, 20, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 11, 1, 1, 1, 1, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1404, 'Yên Bái, Việt Nam', '2024-12-06T11:00:00', 20.10, 20.10, 18.60, 91.09, 0.50, 96.80, '[rain]', 0.00, 0.00, 13.00, 6.10, 143.60, 1015, 100, 22.5, 22, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 12, 1, 1, 1, 1, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1405, 'Yên Bái, Việt Nam', '2024-12-06T12:00:00', 20.30, 20.30, 18.60, 89.97, 0.50, 96.80, '[rain]', 0.00, 0.00, 12.20, 5.80, 145.40, 1014, 100, 10.4, 61, 0.2, 1, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 13, 1, 1, 1, 1, 1, 1, 1, 2, 1, 1);
INSERT INTO `staging` VALUES (1406, 'Yên Bái, Việt Nam', '2024-12-06T13:00:00', 19.90, 19.90, 18.70, 92.80, 1.20, 96.80, '[rain]', 0.00, 0.00, 5.40, 3.20, 135.50, 1013, 100, 6.4, 20, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 14, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1407, 'Yên Bái, Việt Nam', '2024-12-06T14:00:00', 19.60, 19.60, 18.70, 94.54, 1.20, 87.10, '[rain]', 0.00, 0.00, 5.40, 3.20, 126.20, 1012, 100, 9.6, 13, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 15, 1, 1, 1, 2, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1408, 'Yên Bái, Việt Nam', '2024-12-06T15:00:00', 19.60, 19.60, 18.70, 94.54, 0.70, 87.10, '[rain]', 0.00, 0.00, 2.20, 1.10, 167.40, 1012, 100, 9.7, 15, 0.1, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 16, 1, 1, 1, 1, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1409, 'Yên Bái, Việt Nam', '2024-12-06T16:00:00', 19.60, 19.60, 18.70, 94.54, 0.90, 87.10, '[rain]', 0.00, 0.00, 3.20, 1.80, 51.50, 1012, 100, 13.2, 9, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 17, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1410, 'Yên Bái, Việt Nam', '2024-12-06T17:00:00', 19.70, 19.70, 18.70, 93.96, 0.60, 87.10, '[rain]', 0.00, 0.00, 5.00, 3.20, 39.90, 1013, 100, 8.3, 4, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 18, 1, 1, 1, 5, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1411, 'Yên Bái, Việt Nam', '2024-12-06T18:00:00', 19.70, 19.70, 18.60, 93.37, 0.80, 87.10, '[rain]', 0.00, 0.00, 6.80, 4.30, 49.40, 1013, 100, 10.7, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 19, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1412, 'Yên Bái, Việt Nam', '2024-12-06T19:00:00', 19.70, 19.70, 18.50, 92.79, 0.70, 87.10, '[rain]', 0.00, 0.00, 6.80, 4.70, 54.10, 1014, 100, 12.2, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 20, 1, 1, 1, 3, 1, 1, 3, 3, 1, 1);
INSERT INTO `staging` VALUES (1413, 'Yên Bái, Việt Nam', '2024-12-06T20:00:00', 19.60, 19.60, 18.30, 92.20, 0.70, 93.50, '[rain]', 0.00, 0.00, 6.80, 5.00, 52.20, 1014, 100, 10.5, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 21, 1, 1, 1, 3, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1414, 'Yên Bái, Việt Nam', '2024-12-06T21:00:00', 19.40, 19.40, 18.10, 92.19, 0.70, 93.50, '[rain]', 0.00, 0.00, 7.90, 5.80, 50.90, 1015, 100, 13.5, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 22, 1, 1, 1, 3, 1, 1, 3, 2, 1, 1);
INSERT INTO `staging` VALUES (1415, 'Yên Bái, Việt Nam', '2024-12-06T22:00:00', 19.20, 19.20, 17.90, 92.18, 0.80, 93.50, '[rain]', 0.00, 0.00, 7.90, 6.10, 33.80, 1015, 100, 17.4, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 23, 1, 1, 1, 5, 1, 1, 3, 1, 1, 1);
INSERT INTO `staging` VALUES (1416, 'Yên Bái, Việt Nam', '2024-12-06T23:00:00', 19.10, 19.10, 17.60, 91.02, 0.40, 93.50, '[rain]', 0.00, 0.00, 7.60, 5.40, 29.20, 1016, 100, 19.3, 0, 0, 0, 10, 'Rain, Overcast', 'rain', 'None', 59, 'VN1393', 7280, 24, 1, 1, 1, 5, 1, 1, 3, 2, 1, 1);

-- ----------------------------
-- Procedure structure for insert_into_temp_table
-- ----------------------------
DROP PROCEDURE IF EXISTS `insert_into_temp_table`;
delimiter ;;
CREATE PROCEDURE `insert_into_temp_table`()
BEGIN
    -- Tạo temporary table nếu chưa tồn tại
    CREATE TEMPORARY TABLE IF NOT EXISTS temp_table LIKE staging;
    
    -- Xóa dữ liệu cũ trong temp table
    TRUNCATE temp_table;
    
    -- Insert dữ liệu vào temp_table sử dụng subquery để lấy bản ghi đầu tiên của mỗi nhóm
    INSERT INTO temp_table
    SELECT s.*
    FROM staging s
    WHERE (s.id) IN (
        SELECT MIN(id)
        FROM staging
        GROUP BY TRIM(SUBSTRING_INDEX(name, ',', 1))
    );

    -- Cập nhật province_id với giá trị "VN" + MIN(id) của mỗi nhóm
    UPDATE temp_table t
    JOIN (
        SELECT TRIM(SUBSTRING_INDEX(name, ',', 1)) AS province_name, MIN(id) AS min_id
        FROM staging
        GROUP BY TRIM(SUBSTRING_INDEX(name, ',', 1))
    ) AS subquery
    ON TRIM(SUBSTRING_INDEX(t.name, ',', 1)) = subquery.province_name
    SET t.province_id = CONCAT('VN', subquery.min_id);

    -- Hiển thị kết quả
--     SELECT * FROM temp_table;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for transform_cloudcover_dim
-- ----------------------------
DROP PROCEDURE IF EXISTS `transform_cloudcover_dim`;
delimiter ;;
CREATE PROCEDURE `transform_cloudcover_dim`()
BEGIN
 -- Chèn các giá trị cloudcover duy nhất vào dim_cloudcover theo nhóm
    INSERT INTO warehouse.dim_cloudcover (cloudcover)
    SELECT DISTINCT 
        CASE
            WHEN s.cloudcover >= 0 AND s.cloudcover <= 20 THEN 'Clear'
            WHEN s.cloudcover >= 21 AND s.cloudcover <= 40 THEN 'Partly Cloudy'
            WHEN s.cloudcover >= 41 AND s.cloudcover <= 60 THEN 'Mostly Cloudy'
            WHEN s.cloudcover >= 61 AND s.cloudcover <= 80 THEN 'Cloudy'
            WHEN s.cloudcover >= 81 AND s.cloudcover <= 100 THEN 'Overcast'
            ELSE 'Unknown'
        END AS cloudcover
    FROM staging.staging s
    WHERE NOT EXISTS (
        SELECT 1 
        FROM warehouse.dim_cloudcover d
        WHERE d.cloudcover = 
            CASE
                WHEN s.cloudcover >= 0 AND s.cloudcover <= 20 THEN 'Clear'
                WHEN s.cloudcover >= 21 AND s.cloudcover <= 40 THEN 'Partly Cloudy'
                WHEN s.cloudcover >= 41 AND s.cloudcover <= 60 THEN 'Mostly Cloudy'
                WHEN s.cloudcover >= 61 AND s.cloudcover <= 80 THEN 'Cloudy'
                WHEN s.cloudcover >= 81 AND s.cloudcover <= 100 THEN 'Overcast'
                ELSE 'Unknown'
            END
    );

    -- Cập nhật dữ liệu trong bảng staging
    UPDATE staging.staging s
    JOIN warehouse.dim_cloudcover d
    ON
        CASE
            WHEN s.cloudcover >= 0 AND s.cloudcover <= 20 THEN 'Clear'
            WHEN s.cloudcover >= 21 AND s.cloudcover <= 40 THEN 'Partly Cloudy'
            WHEN s.cloudcover >= 41 AND s.cloudcover <= 60 THEN 'Mostly Cloudy'
            WHEN s.cloudcover >= 61 AND s.cloudcover <= 80 THEN 'Cloudy'
            WHEN s.cloudcover >= 81 AND s.cloudcover <= 100 THEN 'Overcast'
            ELSE 'Unknown'
        END = d.cloudcover
    SET s.cloudcover_id = d.id;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for transform_conditions_dim
-- ----------------------------
DROP PROCEDURE IF EXISTS `transform_conditions_dim`;
delimiter ;;
CREATE PROCEDURE `transform_conditions_dim`()
BEGIN
    INSERT INTO warehouse.dim_conditions (conditions)
    SELECT DISTINCT s.conditions
    FROM staging.staging s
    WHERE NOT EXISTS (
        SELECT 1 
        FROM warehouse.dim_conditions d
        WHERE d.conditions = s.conditions
    );
		
				update staging.staging as s
		join warehouse.dim_conditions as dim
		on s.conditions = dim.conditions
		set s.conditions_id = dim.id;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for transform_date_dim
-- ----------------------------
DROP PROCEDURE IF EXISTS `transform_date_dim`;
delimiter ;;
CREATE PROCEDURE `transform_date_dim`()
BEGIN
	update staging s
join warehouse.dim_date d
on CAST(d.datetime as DATE) = CAST(s.datetime AS DATE)
set s.date_id = d.date_sk;


END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for transform_humidity_dim
-- ----------------------------
DROP PROCEDURE IF EXISTS `transform_humidity_dim`;
delimiter ;;
CREATE PROCEDURE `transform_humidity_dim`()
BEGIN
INSERT INTO warehouse.dim_humidity (humidity)
    SELECT DISTINCT 
        CASE
            WHEN s.humidity < 30 THEN 'Very Low'
            WHEN s.humidity >= 30 AND s.humidity < 50 THEN 'Low'
            WHEN s.humidity >= 50 AND s.humidity < 70 THEN 'Normal'
            WHEN s.humidity >= 70 AND s.humidity < 90 THEN 'High'
            WHEN s.humidity >= 90 THEN 'Very High'
            ELSE 'Unknown'
        END AS humidity
    FROM staging.staging s
    WHERE NOT EXISTS (
        SELECT 1 
        FROM warehouse.dim_humidity d
        WHERE d.humidity = 
            CASE
                WHEN s.humidity < 30 THEN 'Very Low'
                WHEN s.humidity >= 30 AND s.humidity < 50 THEN 'Low'
                WHEN s.humidity >= 50 AND s.humidity < 70 THEN 'Normal'
                WHEN s.humidity >= 70 AND s.humidity < 90 THEN 'High'
                WHEN s.humidity >= 90 THEN 'Very High'
                ELSE 'Unknown'
            END
    );

    -- Cập nhật dữ liệu trong bảng staging
    UPDATE staging.staging s
    JOIN warehouse.dim_humidity d
    ON
        CASE
            WHEN s.humidity < 30 THEN 'Very Low'
            WHEN s.humidity >= 30 AND s.humidity < 50 THEN 'Low'
            WHEN s.humidity >= 50 AND s.humidity < 70 THEN 'Normal'
            WHEN s.humidity >= 70 AND s.humidity < 90 THEN 'High'
            WHEN s.humidity >= 90 THEN 'Very High'
            ELSE 'Unknown'
        END = d.humidity
    SET s.humidity_id = d.id;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for transform_icon_dim
-- ----------------------------
DROP PROCEDURE IF EXISTS `transform_icon_dim`;
delimiter ;;
CREATE PROCEDURE `transform_icon_dim`()
BEGIN
    INSERT INTO warehouse.dim_icon (icon)
    SELECT DISTINCT s.icon
    FROM staging.staging s
    WHERE NOT EXISTS (
        SELECT 1 
        FROM warehouse.dim_icon d
        WHERE d.icon = s.icon
    );
		
				update staging.staging as s
		join warehouse.dim_icon as dim
		on s.icon = dim.icon
		set s.icon_id = dim.id;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for transform_location_dim
-- ----------------------------
DROP PROCEDURE IF EXISTS `transform_location_dim`;
delimiter ;;
CREATE PROCEDURE `transform_location_dim`()
BEGIN
	CALL insert_into_temp_table();
	

	INSERT INTO warehouse.dim_location (province_id,province,country)
	SELECT province_id,TRIM(SUBSTRING_INDEX(name, ',', 1)),TRIM(SUBSTRING_INDEX(name, ',', -1))
	FROM staging.temp_table t
	WHERE NOT EXISTS (
    SELECT 1
    FROM warehouse.dim_location d
    WHERE d.province = TRIM(SUBSTRING_INDEX(t.name, ',', 1))
     AND d.country = TRIM(SUBSTRING_INDEX(t.name, ',', -1)));
		 
	update staging as s
	join warehouse.dim_location as dim
	on TRIM(SUBSTRING_INDEX(s.name, ',', 1)) = dim.province
	and TRIM(SUBSTRING_INDEX(name, ',', -1)) = dim.country
	set s.LOCATION_ID = dim.id,
	s.province_id = dim.province_id;
-- 	
-- 

END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for transform_preciptype_dim
-- ----------------------------
DROP PROCEDURE IF EXISTS `transform_preciptype_dim`;
delimiter ;;
CREATE PROCEDURE `transform_preciptype_dim`()
BEGIN
    INSERT INTO warehouse.dim_preciptype (preciptype)
    SELECT DISTINCT preciptype
    FROM staging.staging s
    WHERE NOT EXISTS (
        SELECT 1 
        FROM warehouse.dim_preciptype d
        WHERE d.preciptype = s.preciptype
    );
		
		update staging.staging as s
		join warehouse.dim_preciptype as dim
		on s.preciptype = dim.preciptype
		set s.preciptype_id = dim.id;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for transform_pressure_dim
-- ----------------------------
DROP PROCEDURE IF EXISTS `transform_pressure_dim`;
delimiter ;;
CREATE PROCEDURE `transform_pressure_dim`()
BEGIN
    -- Chèn các giá trị pressure duy nhất vào dim_pressure theo nhóm
    INSERT INTO warehouse.dim_pressure (pressure)
    SELECT DISTINCT 
        CASE
            WHEN s.pressure < 950 THEN 'Very Low'
            WHEN s.pressure >= 950 AND s.pressure < 1000 THEN 'Low'
            WHEN s.pressure >= 1000 AND s.pressure < 1020 THEN 'Normal'
            WHEN s.pressure >= 1020 AND s.pressure < 1050 THEN 'High'
            WHEN s.pressure >= 1050 THEN 'Very High'
            ELSE 'Unknown'
        END AS pressure
    FROM staging.staging s
    WHERE NOT EXISTS (
        SELECT 1 
        FROM warehouse.dim_pressure d
        WHERE d.pressure = 
            CASE
                WHEN s.pressure < 950 THEN 'Very Low'
                WHEN s.pressure >= 950 AND s.pressure < 1000 THEN 'Low'
                WHEN s.pressure >= 1000 AND s.pressure < 1020 THEN 'Normal'
                WHEN s.pressure >= 1020 AND s.pressure < 1050 THEN 'High'
                WHEN s.pressure >= 1050 THEN 'Very High'
                ELSE 'Unknown'
            END
    );

    -- Cập nhật dữ liệu trong bảng staging
    UPDATE staging.staging s
    JOIN warehouse.dim_pressure d
    ON
        CASE
            WHEN s.pressure < 950 THEN 'Very Low'
            WHEN s.pressure >= 950 AND s.pressure < 1000 THEN 'Low'
            WHEN s.pressure >= 1000 AND s.pressure < 1020 THEN 'Normal'
            WHEN s.pressure >= 1020 AND s.pressure < 1050 THEN 'High'
            WHEN s.pressure >= 1050 THEN 'Very High'
            ELSE 'Unknown'
        END = d.pressure
    SET s.pressure_id = d.id;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for transform_stations_dim
-- ----------------------------
DROP PROCEDURE IF EXISTS `transform_stations_dim`;
delimiter ;;
CREATE PROCEDURE `transform_stations_dim`()
BEGIN
    INSERT INTO warehouse.dim_stations (stations)
    SELECT DISTINCT s.stations
    FROM staging.staging s
    WHERE NOT EXISTS (
        SELECT 1 
        FROM warehouse.dim_stations d
        WHERE d.stations = s.stations
    );
		
				update staging.staging as s
		join warehouse.dim_stations as dim
		on s.stations = dim.stations
		set s.stations_id = dim.id;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for transform_time_dim
-- ----------------------------
DROP PROCEDURE IF EXISTS `transform_time_dim`;
delimiter ;;
CREATE PROCEDURE `transform_time_dim`()
BEGIN
		update staging s
join warehouse.dim_time d
on CAST(SUBSTRING(datetime, 12, 2) AS UNSIGNED) = d.`hour`
set s.time_id = d.time_sk;


END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for transform_uvindex_dim
-- ----------------------------
DROP PROCEDURE IF EXISTS `transform_uvindex_dim`;
delimiter ;;
CREATE PROCEDURE `transform_uvindex_dim`()
BEGIN
INSERT INTO warehouse.dim_uvindex (uvindex)
    SELECT DISTINCT 
        CASE
            WHEN s.uvindex >= 0 AND s.uvindex <= 2 THEN 'Low'
            WHEN s.uvindex >= 3 AND s.uvindex <= 5 THEN 'Moderate'
            WHEN s.uvindex >= 6 AND s.uvindex <= 7 THEN 'High'
            WHEN s.uvindex >= 8 AND s.uvindex <= 10 THEN 'Very High'
            WHEN s.uvindex >= 11 THEN 'Extreme'
            ELSE 'Unknown'
        END AS uvindex
    FROM staging.staging s
    WHERE NOT EXISTS (
        SELECT 1 
        FROM warehouse.dim_uvindex d
        WHERE d.uvindex = 
            CASE
                WHEN s.uvindex >= 0 AND s.uvindex <= 2 THEN 'Low'
                WHEN s.uvindex >= 3 AND s.uvindex <= 5 THEN 'Moderate'
                WHEN s.uvindex >= 6 AND s.uvindex <= 7 THEN 'High'
                WHEN s.uvindex >= 8 AND s.uvindex <= 10 THEN 'Very High'
                WHEN s.uvindex >= 11 THEN 'Extreme'
                ELSE 'Unknown'
            END
    );

    -- Cập nhật dữ liệu trong bảng staging
    UPDATE staging.staging s
    JOIN warehouse.dim_uvindex d
    ON
        CASE
            WHEN s.uvindex >= 0 AND s.uvindex <= 2 THEN 'Low'
            WHEN s.uvindex >= 3 AND s.uvindex <= 5 THEN 'Moderate'
            WHEN s.uvindex >= 6 AND s.uvindex <= 7 THEN 'High'
            WHEN s.uvindex >= 8 AND s.uvindex <= 10 THEN 'Very High'
            WHEN s.uvindex >= 11 THEN 'Extreme'
            ELSE 'Unknown'
        END = d.uvindex
    SET s.uvindex_id = d.id;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for transform_weather_dim
-- ----------------------------
DROP PROCEDURE IF EXISTS `transform_weather_dim`;
delimiter ;;
CREATE PROCEDURE `transform_weather_dim`()
BEGIN
	INSERT INTO warehouse.dim_weather (conditions, icon, preciptype, severerisk, cloudcover, humidity_level, temperature_type, wind_condition)
    SELECT DISTINCT
        conditions,
        icon,
        
        -- Chuẩn hóa giá trị preciptype
        CASE
            WHEN preciptype = '[rain]' THEN 'Rain'
            ELSE 'None'
        END AS preciptype,
        
        severerisk,
        cloudcover,
        
        -- Phân loại độ ẩm thành mức (Low, Medium, High)
        CASE
            WHEN humidity <= 40 THEN 'Low'
            WHEN humidity BETWEEN 41 AND 70 THEN 'Medium'
            ELSE 'High'
        END AS humidity_level,
        
        -- Phân loại nhiệt độ thành mức (Cold, Warm, Hot)
        CASE
            WHEN temp < 10 THEN 'Cold'
            WHEN temp BETWEEN 10 AND 25 THEN 'Warm'
            ELSE 'Hot'
        END AS temperature_type,
        
        -- Phân loại điều kiện gió (Calm, Breezy, Windy)
        CASE
            WHEN windspeed < 10 THEN 'Calm'
            WHEN windspeed BETWEEN 10 AND 30 THEN 'Breezy'
            ELSE 'Windy'
        END AS wind_condition
    FROM staging.staging s
    WHERE NOT EXISTS (
        SELECT 1 
        FROM warehouse.dim_weather wd
        WHERE wd.conditions = s.conditions
          AND wd.icon = s.icon
          AND wd.preciptype = CASE
                                  WHEN s.preciptype = '[rain]' THEN 'Rain'
                                  ELSE 'None'
                              END
          AND wd.severerisk = s.severerisk
          AND wd.cloudcover = s.cloudcover
          AND wd.humidity_level = CASE
                                      WHEN s.humidity <= 40 THEN 'Low'
                                      WHEN s.humidity BETWEEN 41 AND 70 THEN 'Medium'
                                      ELSE 'High'
                                  END
          AND wd.temperature_type = CASE
                                        WHEN s.temp < 10 THEN 'Cold'
                                        WHEN s.temp BETWEEN 10 AND 25 THEN 'Warm'
                                        ELSE 'Hot'
                                    END
          AND wd.wind_condition = CASE
                                      WHEN s.windspeed < 10 THEN 'Calm'
                                      WHEN s.windspeed BETWEEN 10 AND 30 THEN 'Breezy'
                                      ELSE 'Windy'
                                  END
    );

	UPDATE staging.staging AS s
JOIN warehouse.dim_weather AS wd
ON s.conditions = wd.conditions
   AND s.icon = wd.icon
   AND CASE
           WHEN s.preciptype = '[rain]' THEN 'Rain'
           ELSE 'None'
       END = wd.preciptype
   AND s.severerisk = wd.severerisk
   AND s.cloudcover = wd.cloudcover
   AND CASE
           WHEN s.humidity <= 40 THEN 'Low'
           WHEN s.humidity BETWEEN 41 AND 70 THEN 'Medium'
           ELSE 'High'
       END = wd.humidity_level
   AND CASE
           WHEN s.temp < 10 THEN 'Cold'
           WHEN s.temp BETWEEN 10 AND 25 THEN 'Warm'
           ELSE 'Hot'
       END = wd.temperature_type
   AND CASE
           WHEN s.windspeed < 10 THEN 'Calm'
           WHEN s.windspeed BETWEEN 10 AND 30 THEN 'Breezy'
           ELSE 'Windy'
       END = wd.wind_condition
SET s.weather_id = wd.id;



END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for transform_weather_fact
-- ----------------------------
DROP PROCEDURE IF EXISTS `transform_weather_fact`;
delimiter ;;
CREATE PROCEDURE `transform_weather_fact`()
BEGIN
    INSERT INTO warehouse.weather_fact (
        weather_id,
        location_id,
        time_id,
        date_id,
        stations_id,
        preciptype_id,
        conditions_id,
        winddir_id,
        icon_id,
        pressure_id,
        humidity_id,
        winspeed_id,
        uvindex_id,
        cloudcover_id,
        temperature,
        feels_like,
        dew_point,
        precip,
        precip_prob,
        snow,
        snow_depth,
        wind_gust,
        visibility,
        solar_radiation,
        solar_energy,
        severe_risk
    )
    SELECT
        id AS weather_id,
        LOCATION_ID AS location_id,
        time_id AS time_id,
        date_id AS date_id,
        stations_id AS stations_id,
        preciptype_id AS preciptype_id,
        conditions_id AS conditions_id,
        winddir_id AS winddir_id,
        icon_id AS icon_id,
        pressure_id AS pressure_id,
        humidity_id AS humidity_id,
        windspeed_id AS winspeed_id,
        uvindex_id AS uvindex_id,
        cloudcover_id AS cloudcover_id,
        temp AS temperature,
        feelslike AS feels_like,
        dew AS dew_point,
        precip AS precip,
        precipprob AS precip_prob,
        snow AS snow,
        snowdepth AS snow_depth,
        windgust AS wind_gust,
        visibility AS visibility,
        solarradiation AS solar_radiation,
        solarenergy AS solar_energy,
        severerisk AS severe_risk
    FROM
        staging.staging;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for transform_winddir_dim
-- ----------------------------
DROP PROCEDURE IF EXISTS `transform_winddir_dim`;
delimiter ;;
CREATE PROCEDURE `transform_winddir_dim`()
BEGIN
    -- Chèn dữ liệu vào bảng dim_winddir
    INSERT INTO warehouse.dim_winddir (winddir)
    SELECT DISTINCT 
        CASE
            WHEN s.winddir >= 0 AND s.winddir < 45 THEN 'North'
            WHEN s.winddir >= 45 AND s.winddir < 90 THEN 'North-East'
            WHEN s.winddir >= 90 AND s.winddir < 135 THEN 'East'
            WHEN s.winddir >= 135 AND s.winddir < 180 THEN 'South-East'
            WHEN s.winddir >= 180 AND s.winddir < 225 THEN 'South'
            WHEN s.winddir >= 225 AND s.winddir < 270 THEN 'South-West'
            WHEN s.winddir >= 270 AND s.winddir < 315 THEN 'West'
            WHEN s.winddir >= 315 AND s.winddir <= 360 THEN 'North-West'
            ELSE 'Unknown'
        END AS winddir
    FROM staging.staging s
    WHERE NOT EXISTS (
        SELECT 1 
        FROM warehouse.dim_winddir d
        WHERE d.winddir = 
            CASE
                WHEN s.winddir >= 0 AND s.winddir < 45 THEN 'North'
                WHEN s.winddir >= 45 AND s.winddir < 90 THEN 'North-East'
                WHEN s.winddir >= 90 AND s.winddir < 135 THEN 'East'
                WHEN s.winddir >= 135 AND s.winddir < 180 THEN 'South-East'
                WHEN s.winddir >= 180 AND s.winddir < 225 THEN 'South'
                WHEN s.winddir >= 225 AND s.winddir < 270 THEN 'South-West'
                WHEN s.winddir >= 270 AND s.winddir < 315 THEN 'West'
                WHEN s.winddir >= 315 AND s.winddir <= 360 THEN 'North-West'
                ELSE 'Unknown'
            END
    );

    -- Cập nhật dữ liệu trong bảng staging
    UPDATE staging.staging s
		join warehouse.dim_winddir d
		on
        CASE
            WHEN s.winddir >= 0 AND s.winddir < 45 THEN 'North'
            WHEN s.winddir >= 45 AND s.winddir < 90 THEN 'North-East'
            WHEN s.winddir >= 90 AND s.winddir < 135 THEN 'East'
            WHEN s.winddir >= 135 AND s.winddir < 180 THEN 'South-East'
            WHEN s.winddir >= 180 AND s.winddir < 225 THEN 'South'
            WHEN s.winddir >= 225 AND s.winddir < 270 THEN 'South-West'
            WHEN s.winddir >= 270 AND s.winddir < 315 THEN 'West'
            WHEN s.winddir >= 315 AND s.winddir <= 360 THEN 'North-West'
            ELSE 'Unknown'
        END = d.winddir
		set s.winddir_id = d.id;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for transform_windspeed_dim
-- ----------------------------
DROP PROCEDURE IF EXISTS `transform_windspeed_dim`;
delimiter ;;
CREATE PROCEDURE `transform_windspeed_dim`()
BEGIN
INSERT INTO warehouse.dim_windspeed (windspeed)
    SELECT DISTINCT 
        CASE
            WHEN s.windspeed < 1 THEN 'Calm'
            WHEN s.windspeed >= 1 AND s.windspeed < 5 THEN 'Light Air'
            WHEN s.windspeed >= 6 AND s.windspeed < 11 THEN 'Light Breeze'
            WHEN s.windspeed >= 12 AND s.windspeed < 19 THEN 'Moderate Breeze'
            WHEN s.windspeed >= 20 AND s.windspeed < 28 THEN 'Strong Breeze'
            WHEN s.windspeed >= 29 AND s.windspeed < 38 THEN 'Near Gale'
            WHEN s.windspeed >= 39 AND s.windspeed < 49 THEN 'Gale'
            WHEN s.windspeed >= 50 THEN 'Strong Gale'
            ELSE 'Unknown'
        END AS windspeed
    FROM staging.staging s
    WHERE NOT EXISTS (
        SELECT 1 
        FROM warehouse.dim_windspeed d
        WHERE d.windspeed = 
            CASE
                WHEN s.windspeed < 1 THEN 'Calm'
                WHEN s.windspeed >= 1 AND s.windspeed < 5 THEN 'Light Air'
                WHEN s.windspeed >= 6 AND s.windspeed < 11 THEN 'Light Breeze'
                WHEN s.windspeed >= 12 AND s.windspeed < 19 THEN 'Moderate Breeze'
                WHEN s.windspeed >= 20 AND s.windspeed < 28 THEN 'Strong Breeze'
                WHEN s.windspeed >= 29 AND s.windspeed < 38 THEN 'Near Gale'
                WHEN s.windspeed >= 39 AND s.windspeed < 49 THEN 'Gale'
                WHEN s.windspeed >= 50 THEN 'Strong Gale'
                ELSE 'Unknown'
            END
    );

    -- Cập nhật dữ liệu trong bảng staging
    UPDATE staging.staging s
    JOIN warehouse.dim_windspeed d
    ON
        CASE
            WHEN s.windspeed < 1 THEN 'Calm'
            WHEN s.windspeed >= 1 AND s.windspeed < 5 THEN 'Light Air'
            WHEN s.windspeed >= 6 AND s.windspeed < 11 THEN 'Light Breeze'
            WHEN s.windspeed >= 12 AND s.windspeed < 19 THEN 'Moderate Breeze'
            WHEN s.windspeed >= 20 AND s.windspeed < 28 THEN 'Strong Breeze'
            WHEN s.windspeed >= 29 AND s.windspeed < 38 THEN 'Near Gale'
            WHEN s.windspeed >= 39 AND s.windspeed < 49 THEN 'Gale'
            WHEN s.windspeed >= 50 THEN 'Strong Gale'
            ELSE 'Unknown'
        END = d.windspeed
    SET s.windspeed_id = d.id;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for truncate_staging
-- ----------------------------
DROP PROCEDURE IF EXISTS `truncate_staging`;
delimiter ;;
CREATE PROCEDURE `truncate_staging`(in table_name varchar(255))
BEGIN
SET @query = CONCAT('TRUNCATE TABLE ', table_name);
    PREPARE stmt FROM @query;
    EXECUTE stmt;
    DEALLOCATE PREPARE stmt;
END
;;
delimiter ;

SET FOREIGN_KEY_CHECKS = 1;
